{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Carolyn Beauchamp",
            "url": "/name/nm0064299/"
        },
        {
            "@type": "Person",
            "name": "Sean Bowen",
            "url": "/name/nm0100916/"
        },
        {
            "@type": "Person",
            "name": "Rick Washburn",
            "url": "/name/nm0913370/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2312,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019150/"
        },
        {
            "@type": "Person",
            "name": "Lloyd Kaufman",
            "url": "/name/nm0442207/"
        },
        {
            "@type": "Person",
            "name": "Mitchell Dana",
            "url": "/name/nm0199075/"
        },
        {
            "@type": "Person",
            "name": "Eric Hattler",
            "url": "/name/nm0369020/"
        }
    ],
    "datePublished": "1989-11-18",
    "description": "A group of assorted Americans survive a plane crash in a Caribbean island, and discover it is infested with crawling snakes and other venomous beasts. Even worse, terrorists are preparing a full out war on America with a biologica...",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Herz",
            "url": "/name/nm0381230/"
        },
        {
            "@type": "Person",
            "name": "Lloyd Kaufman",
            "url": "/name/nm0442207/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Action",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjM5Y2I1NzUtODAwMS00YjM1LTk1NDEtNzI3ZjY1YjNiMGEyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "parody,blood splatter,war veteran,kicked in the groin,social satire",
    "name": "Troma's War",
    "original_info": {
        "id": "Troma's War_1988",
        "name": "Troma's War",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ChoiBaby"
        },
        "dateCreated": "1999-01-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0096310/"
        },
        "name": "A good time for all (Especially for those with a twisted sense of humor)!",
        "reviewBody": "One of the BEST exploitation films ever made! This movie has everything a B-movie lover could want: Shootings, explosions, a multifarious cast, action, violence, thrills, mayhem, and romance! One of the finest pieces of opus ever embraced by the human being.\n\nEssentially, TROMA'S WAR is a spoof of the action and war genres. The film's contrived plot concerns a bunch of incompetent plane crash survivors on an island. They've encountered a conspiracy that will not only endanger the United States, but will place the whole world in jeopardy! Eventually, this leads to all sorts of scenes of random silliness...not to mention moments of bloodshed. Will the survivors beat the odds, or will the world spell doom?\n\nTROMA'S WAR is a fine amalgram of the features expected in a comedy, horror, and action mixture. Unlike most Troma films, this satricial flick offers caustic political commentary about biological warfare and fascist terrorism. The black humor in TROMA'S WAR is subtle at times, conspiciously sleazy during most other parts of this movie. The explosive intensity in this film is buoyed by great one-liners and a feeling of tons of guilty pleasure. Also, the delightfully amateurish cast in Troma's War also must receive approbation for having lots of fun with this movie. Highly recommended movie to all connoiseurs of fun, low budget films. A movie treat guaranteed to provide an entertaining time with lots of friends.\n\nRATING: ***1/2 out of ****."
    },
    "url": "/title/tt0096310/"
}