{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shelley Long",
            "url": "/name/nm0001480/"
        },
        {
            "@type": "Person",
            "name": "Craig T. Nelson",
            "url": "/name/nm0005266/"
        },
        {
            "@type": "Person",
            "name": "Betty Thomas",
            "url": "/name/nm0858525/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 10756,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0062678/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0045985/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0315611/"
        },
        {
            "@type": "Person",
            "name": "Ava Ostern Fries",
            "url": "/name/nm0652398/"
        },
        {
            "@type": "Person",
            "name": "Pamela Norris",
            "url": "/name/nm0635873/"
        },
        {
            "@type": "Person",
            "name": "Margaret Oberman",
            "url": "/name/nm0643315/"
        }
    ],
    "datePublished": "1989-03-24",
    "description": "A soon to be divorced Beverly Hills socialite is determined to prove to her husband and herself that she can finish what she starts out to do, by becoming a den mother to a troop of Beverly Hills Girl Scouts.",
    "director": [
        {
            "@type": "Person",
            "name": "Jeff Kanew",
            "url": "/name/nm0437596/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWJmMzJlYTgtMTlhZi00ZTEyLThiNjYtMzIyMDY3Y2YyMmFlXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "girl scout,beverly hills california,husband wife relationship,female bonding,farce",
    "name": "Troop Beverly Hills",
    "original_info": {
        "id": "Troop Beverly Hills_1989",
        "name": "Troop Beverly Hills",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "betchaareoffendedeasily"
        },
        "dateCreated": "2020-12-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0098519/"
        },
        "name": "I Miss Movies Like This",
        "reviewBody": "If you take a peak at the movies I have reviewed, most of them are low-budget weird films, or generally depressing fare. I tend to enjoy movies that challenge my mind I suppose, on some level. Troop Beverly Hills on the other hand is the EXACT opposite, and that's why I love it! Sometimes, I just need a silly movie with a generally predictable plot that is fun and upbeat and a little off kilter; Troop Beverly Hills is all of these things. I'm genuinely shocked this hasn't become a cult classic and has so view ratings and reviews.\n\nAnother reviews stated: 'This makes \"The Room\" look Oscar worthy. \"Troop Beverly Hills, you're tearing me apart !\" ' - That is beyond absurd, seriously. I have seen The Room and Troll 2 and Gymkata and many many more awful movies, \"Troop Beverly Hills\" is not poorly made. \"Troop Beverly Hills\" may not be perfect, but it is great for what it is. The script is goofy, but it is meant to be, it doesn't take itself very seriously, but the story is consistent and any absurdities, for the most part, are intentional. I enjoy so bad they are good movies, and that is what the person quoted above compares \"Troop Beverly Hills\" to; it is actually a well-executed film, most of the acting is above average, though you have to look at it through an 80's lens, the sound, cinematography, lighting, and other technical aspects are are solid, so their comparison is totally absurd. This is a movie for tweens, teens, and adults who enjoy silly humor. There is plenty of adult humor in the film as well, hoever, which many people seem to miss. The person quoted above must dislike cheesey 1980's family films, and that's fine, but don't compare it to something it does not resemble please.\n\nWhile this movie teaches morals, such as cheating is not a virtues, honesty is important, caring about your friends matters more than winning, etc, it is by and largely a silly satire with very silly, but fun characters. It's characters are all caricatures in film larger than life from the decade of excess, and I miss these kinds of movies, they just don't make em like this anymore. Some people may be happy about that, but I'm not, the world could use more fun movies such as this!\n\nYes, it is a film about a bunch of spoiled rich kids who know nothing about camping or who's idea of roughing it is a suite with 10 people and a bathroom, learning how to be responsible contributors to society on some level. If that is not your cup, just skip it. It is ridiculous and silly, it is after all an 1980's movie and it is filled with really awesome late 80's fashions.\n\nI grew up watching this on TV, and until I was about 25yrs, I hadn't see it since I was, say 12. I had no idea if I would find it unbearable to watch, the funny thing is, I think I actually enjoy it more as an adult. This is a coming of age story, the coming of age for a 30-something Rodeo Drive House wife that is! This woman knows nothing about reality, one has to wonder how she made it to the point of marrying her soon to be ex husband, but we can only assume she used to be a tad more responsible before her husband hit it big in the muffler business. Honestly though, it really doesn't matter.\n\nThis movie is really Shelly's show and I feel she delivers. Betty Thomas as Velda Plendor, however, is amazing and an absolute blast to watch. quite well, but some people might find her grating, she is. Not all of the acting is phenomenal, we have a young Kelly Martin who is decent, but not spectacular, and a Carla Gugino who is the weakest of the kids, especially in the scene with her birthday, her \"crying\" is incredibly fake, thankfully she got better as she aged..\n\nThis movie should not be taken seriously, and if you watch with less cynical eyes, and just enjoy the ride, there is a lot of fun to be had as the girls learn some actual life skills and become real \"Wilderness Girls\"."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT1M50S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2772548121",
        "name": "Troop Beverly Hills",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGQ0NWJkMjEtYzZjMC00MmYwLWJiMWEtMzc3OTA2NDc0M2NhXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGQ0NWJkMjEtYzZjMC00MmYwLWJiMWEtMzc3OTA2NDc0M2NhXkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg",
        "uploadDate": "2019-03-05T17:18:38.820Z",
        "url": "https://www.imdb.com/video/vi2772548121/"
    },
    "url": "/title/tt0098519/"
}