{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Geoffrey Holder",
            "url": "/name/nm0390305/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 196,
        "ratingValue": 6,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0003515/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0150868/"
        },
        {
            "@type": "Person",
            "name": "Simon Campbell-Jones",
            "url": "/name/nm1621561/"
        }
    ],
    "datePublished": "1998-09-05",
    "description": "A spectacular and unforgettable journey into the heart of the remote and far-flung rainforests of Australia, Costa Rica, French Guiana and Malaysia, this globally important adventure explores these disappearing jungle habitats and...",
    "director": [
        {
            "@type": "Person",
            "name": "Ben Shedd",
            "url": "/name/nm0790536/"
        }
    ],
    "duration": "PT38M",
    "genre": [
        "Documentary",
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTUxNjY4NTExOV5BMl5BanBnXkFtZTcwMTg2MjczMQ@@._V1_.jpg",
    "keywords": "rainforest,evolution,environmental,nature,imax",
    "name": "Tropical Rainforest",
    "original_info": {
        "id": "Tropical Rainforest: IMAX_1992",
        "name": "Tropical Rainforest: IMAX",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TheLittleSongbird"
        },
        "dateCreated": "2022-09-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0105644/"
        },
        "name": "Beautiful tropical rainforest",
        "reviewBody": "1992's 'Tropical Rainforest' immediately appealed to me prior to watching. Absolutely love nature documentaries (have done ever since seeing David Attenborough's groundbreaking work for the first time when they first aired) and it is always wonderful seeing the tropical rainforest which has always fascinated and visually captivated. Not to mention its beautifully varied wildlife, familiar and not so familiar. Interesting to hear Geoffrey Holder, best known to me for his roles in 'Live and Let Die' and 'Annie', narrating.\n\nAs to be hoped this is absolutely wonderful and lived up to high expectations. It may not be one of the best documentaries ever made, but it was great to see a documentary that focused specifically on the tropical rainforest, the inhabitants and the dangers they have to face when it can usually be seen as part of an episode of a 3 plus part documentary series. It does do a great job in this respect and when it comes to documentaries on rainforests it is a must see.\n\nMy only issue is the length, as it does feel too short like many of the recently seen IMAX documentary short films. With a lot of content, this could very comfortably have been 20 minutes longer perhaps which would have given the viewer more time to take in the information and also learn more.\n\nOtherwise, this is fabulous. It looks absolutely great for one thing, with both beautiful and unforgiving scenery and especially the photography that leaves one in awe at its best. There is though more to 'Tropical Rainforest' than cute animals and plants in beautiful environments, one is reminded without being preached at that there are daily challenges.\n\nExpectedly there is some messaging, but it is as relevant today as it was back then, so it is hardly outdated. It also makes its point quite powerfully and thoughtfully, was very worried about it being preachy but there are documentaries that are a million times worse at that. The music, with an accessible style, is relaxing in some parts while having some edge in other parts. The animals and plants are a great mix of adorable, formidable and exotic and their behaviors and ways to survive are relatable, surprising and inspiring.\n\nWhen it comes to the information, it is very educational and the narration entertains and informs without preachiness or being gimmicky, any familiar content is approached freshly, and in a way that will captivate and never disturb kids while not being cookie cutter. Holder does a good account of himself in the narrator role, it is true that there is some stumbling initially, but he mostly narrates warmly and in a way that never sounds bored or over eager.\n\nIn conclusion, great. 9/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from SlingShot Entertainment",
        "duration": "PT2M40S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3456041241",
        "name": "Tropical Rainforest",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWZhZmRhMjMtYTQ2My00NDNlLTlmOTUtOTFlNDk1OWUwMmM1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWZhZmRhMjMtYTQ2My00NDNlLTlmOTUtOTFlNDk1OWUwMmM1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:31:31Z",
        "url": "https://www.imdb.com/video/vi3456041241/"
    },
    "url": "/title/tt0105644/"
}