{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Woods",
            "url": "/name/nm0000249/"
        },
        {
            "@type": "Person",
            "name": "Robert Downey Jr.",
            "url": "/name/nm0000375/"
        },
        {
            "@type": "Person",
            "name": "Margaret Colin",
            "url": "/name/nm0171513/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5112,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009384/"
        },
        {
            "@type": "Person",
            "name": "Wesley Strick",
            "url": "/name/nm0834338/"
        }
    ],
    "datePublished": "1989-02-17",
    "description": "A cynical former civil liberties attorney now reduced to \"specializing\" in defending drug dealers becomes transformed by an eight-year-old murder case.",
    "director": [
        {
            "@type": "Person",
            "name": "Joseph Ruben",
            "url": "/name/nm0747849/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjkwNjM3ZDctYTQwMy00Yjc5LTg2NmUtN2M1YTNlNzRiNjdjXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "korean american,mentor protege relationship,disillusionment,district attorney,idealist",
    "name": "True Believer",
    "original_info": {
        "id": "True Believer_1989",
        "name": "True Believer",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rondine"
        },
        "dateCreated": "2007-03-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0098524/"
        },
        "name": "One of Wood's best performances... seriously.",
        "reviewBody": "This is a very well done court room drama that is based on an actual case from actual liberal left wing attorney, J. Tony Serra. James Woods plays the fictionalized version of Serra, under the name Eddie Dodd. Robert Downey, Jr. plays Roger Baron, a young idealistic lawyer that comes to clerk for the once famous Dodd- with dreams of defending civil liberties and making a difference. \n\nHe arrives only to find the once rebellious and justice minded Dodd defending drug addicts and drug dealers. One evening a young Korean woman & lady come to his offices looking for help. Her son was sent to jail 8 years ago & is now accused of murder because of a prison fight that resulted in the death of a member of the Aryan army. Despite the fact it's not his area of \"expertise,\" Roger convinces Dodd to take the case. \n\nFor Dodd, this case, this young man, Shu Kai Kim played very well by Yuji Okumoto, represents so much more than just another case. Dodd himself is looking to reclaim his own enthusiasm, freedom and hope. The District Attorney is played very reliably by Kurtwood Smith (poor guy- pre \"70's show\" he always seemed to play a bad guy.)\n\nThe main reason I like this movie are the actors. Yes, the story is somewhat predictable- but there are some turns that make you doubt who is innocent & who is guilty on first viewing. James Woods' performance in this movie is one of his most versatile and enjoyable. He transitions with ease from humorous sarcasm to an almost raw vulnerability. One of the best scenes is one in which he tells his client, \"I know you're innocent- even if you've forgotten.\" After 8 years in prison, Shu isn't the same man he was when he went in. Just as Dodd tells Roger at the beginning of the movie that 10 years is a lot of time- in other words, despite his shinning past as a defender of civil liberties- he has also changed. Cynicism is something that creeps stealthily into everyone as age and time increase. In the movie \"And Justice for All\" they delve into the difficulty of being a defense lawyer & having to defend people you may know full well did a heinous crime of some sort. This has to change a person and that is part of what this movie is about. \n\nAll the other actors, including Margaret Colin as the PI Kitty Greer, are believable and supply good support for the main character of Dodd. This is basically Woods' show, and that's okay with me since I'm a big fan of his. He was also fabulous in \"Salvador\" but then I think he is fabulous. If you like Woods, you'll like this movie I think - if you like a good story, I think you'll like this movie.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "text on screen",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3841458457",
        "name": "True Believer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjc1NGE2MGEtMzZiOS00ODllLWJjMDgtOGU1ZTIyMjVhZWFlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjc1NGE2MGEtMzZiOS00ODllLWJjMDgtOGU1ZTIyMjVhZWFlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:06:20Z",
        "url": "https://www.imdb.com/video/vi3841458457/"
    },
    "url": "/title/tt0098524/"
}