{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Bridges",
            "url": "/name/nm0000313/"
        },
        {
            "@type": "Person",
            "name": "Joan Allen",
            "url": "/name/nm0000260/"
        },
        {
            "@type": "Person",
            "name": "Martin Landau",
            "url": "/name/nm0001445/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 20808,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0071326/"
        },
        {
            "@type": "Person",
            "name": "Arnold Schulman",
            "url": "/name/nm0776068/"
        },
        {
            "@type": "Person",
            "name": "David Seidler",
            "url": "/name/nm0782436/"
        }
    ],
    "datePublished": "1988-08-12",
    "description": "The story of Preston Tucker, the maverick car designer and his ill-fated challenge to the auto industry with his revolutionary car concept.",
    "director": [
        {
            "@type": "Person",
            "name": "Francis Ford Coppola",
            "url": "/name/nm0000338/"
        }
    ],
    "duration": "PT1H50M",
    "genre": [
        "Biography",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjIxODE5ZDktZmUxOS00N2IyLWI5MWMtNWFkZjEyMGU3NTM4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "based on real person,united states of america,police officer,scene during opening credits,timeframe 1940s",
    "name": "Tucker: The Man and His Dream",
    "original_info": {
        "id": "Tucker: The Man and His Dream_1988",
        "name": "Tucker: The Man and His Dream",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "KnightsofNi11"
        },
        "dateCreated": "2010-10-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0096316/"
        },
        "name": "Not much but it's still good",
        "reviewBody": "Tucker: The Man and His Dream is a good spirited story of perseverance, loyalty, honor, and integrity from legendary director Francis Ford Coppola. Coppola's name is synonymous with landmark cinema that changed the face of the film industry forever with classics like The Godfather and Apocalypse Now. This movie is obviously not of that caliber, but it is an enjoyable experience nonetheless. In it, a thinner, younger, and clean shaven Jeff Bridges plays Preston Tucker, a likable businessman who had big ideas for the auto industry that would ultimately lead to bigger consequences. It's a true story about how one man tried to change the auto industry after World War II by creating the greatest car ever made. His financial support in the booming big government economy after WWII is an issue, but he perseveres through it all with the goal of achieving what others say is impossible. It's a happily inspiring tale, performed excellently by Mr. Bridges, one of my all time favorite actors.\n\nCoppola shows in this movie that he can still be a fine director without the backing of a gangster or Vietnam war epic. He has a straightforward directing style for this straightforward film, but it doesn't fault a movie that mainly focuses on character and plot, rather than visual aesthetic. However, the film did get nominated at the Academy Awards for best Art Direction and Costume Design, and deservedly so. Tucker: The Man and His Dream is a period piece, and everything about the film stays true to its time frame. It is always interesting to see such a specific time period like the 1940's projected through an 80's lens, and Tucker: The Man and His Dream does a captivating job at this. The costumes are interesting and relevant, along with the set design and of course the cars. And it is all backed by a fantastic early 1900's jazz soundtrack.\n\nThe story itself stays mildly interesting the whole way through. It lags in some spots where not as much is happening, but it sets up for a great climax with a beautifully inspirational speech delivered by Bridges. The flow and pacing of the film has its noticeable issues and parts felt slightly choppy. The beginning of the film starts out with an infomercial/historical newsreel quirk that is very creative, but practically abandoned by the end of the film. Despite some minor flaws nothing significantly deteriorates the overall quality of the film.\n\nTucker: The Man and His Dream is a solid film that anyone can at least find mildly interesting, since it is based on a true story after all. Putting this film into today's perspective, it is still relevant and interesting what with all the auto industry crises going on today and how I'm sure we all wish we somebody as steadfast and innovative as Preston Tucker could pick the industry back up on its feet. I commend a film if it makes me think in terms of current events, so kudos to this film. I will say that as a Coppola film, it's nothing too special. I would obviously recommend the first two Godfathers and Apocalypse Now long before Tucker: The Man and His Dream. But as just another film, this movie is plenty enjoyable and interesting to watch.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "4K Re-release Trailer",
        "duration": "PT1M56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1126349593",
        "name": "Tucker: The Man and His Dream",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2NiODQ5ZjctMmViZi00ZTQyLWFiNGUtOGJjZTM4Y2M5NDU1XkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2NiODQ5ZjctMmViZi00ZTQyLWFiNGUtOGJjZTM4Y2M5NDU1XkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg",
        "uploadDate": "2018-08-09T17:18:46.542Z",
        "url": "https://www.imdb.com/video/vi1126349593/"
    },
    "url": "/title/tt0096316/"
}