{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Alec Guinness",
            "url": "/name/nm0000027/"
        },
        {
            "@type": "Person",
            "name": "John Mills",
            "url": "/name/nm0590055/"
        },
        {
            "@type": "Person",
            "name": "Susannah York",
            "url": "/name/nm0948772/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4283,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0139589/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0127447/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0947780/"
        },
        {
            "@type": "Person",
            "name": "James Kennaway",
            "url": "/name/nm0447860/"
        }
    ],
    "datePublished": "1960-09-17",
    "description": "After World War II, a Highland Regiment's acting Commanding Officer, who rose from the ranks, is replaced by a peace-time Oxford-educated Commanding Officer, leading to a dramatic conflict between the two.",
    "director": [
        {
            "@type": "Person",
            "name": "Ronald Neame",
            "url": "/name/nm0623768/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDljMTRiOWMtYzJjZC00MDBkLWEyNDYtZGYyYTc3Y2IwMjY2XkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "british military,post world war two,discontent,british soldier,man dances with a man",
    "name": "Tunes of Glory",
    "original_info": {
        "id": "Tunes of Glory_1960",
        "name": "Tunes of Glory",
        "year": "1960"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Pedro_H"
        },
        "dateCreated": "2012-04-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0054412/"
        },
        "name": "\"All is vanity... All is ego.\": Nietzsche",
        "reviewBody": "Rough-necked and uneducated Jock Sinclair (Alec Guinness) has fought his way through the ranks, and despite the love of hard drink and the odd highland fling, has proved himself in the very heat of battle. So much so that he has been made Acting Colonel of an (unnamed) Scottish regiment. \n\nSadly, for him, his informal barracks is going to be reformed under the auspices of the public school via Sandhurst graduate Lt. Col. Basil Barrow (John Mills) who believes in doing all things by-the-book. This sets the scene for a post WW2 power battle under a grey Scottish winter sky.\n\nWhen writing a review of any excellent film - such as this - you are frightened you are going to put people off by its limits. However this is a classic example of less really being more. The claustrophobic atmosphere and the sense that armies without wars are prone to be heavy with politics. Not unlike like prisons: To many people in the same space with too much time on their hands. They drive men mad and extend the worst in the human character.\n\nGuinness and Mills are fantastic actors. Oscar winners both and more. They could read the phone book and captivate an audience. For the record they had both seen war service, although Mills baby face and short stature had made him the butt of many jokes (many he was happy to re-tell). Did this help form his character? The guy who was laughed at and therefore worked even harder to enforce discipline or gain respect. This is, naturally, speculation.\n\nI have no the knowledge of author (of book and film) but just by watching you know he has seen it for real. The little details that only the insider would know. The story would just as well be served as a theatre piece and it employs some its stock devices. The accidental narrator being the more obvious. Maybe this was to save money, but it would not have helped the picture to see - say - the incident that Mills had to endure from the Japanese.\n\nEyewitness testimony from the filming says that Guinness thought he would look silly in a kilt and used fake tanner on his pale legs. He is not the biggest of men and has to stick out his chest and stand on tiptoe to be imposing, but you do believe him. What an actor he was. An actor's actor. Like Peter Sellars, totally bland out of character (and not always very nice as he writes in his various autobiographies) but always mesmeric on screen. Mills - on the other hand - could never work as a bad guy. The perfect uncle figure who you would want to confide in.\n\n(I am maybe giving the support cast short-shrift - but most British films of the time had quality character actors. No exception here. Amazing to see Susannah York in her first role.) \n\nAlfred Hitchcock himself said Tunes of Glory was his own personal favourite film. It is not quite mine, but a great demonstration of how brilliant film can be when top class actors get their teeth in to a wonderful script. The end is pure Shakespeare. Don't watch it once, watch it twice...",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "After World War II, a Highland Regiment's acting Commanding Officer, who rose from the ranks, is replaced by a peace-time Oxford-educated Commanding Officer, leading to a dramatic conflict between the two.",
        "duration": "PT3M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3019424025",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjg1MTczYzgtZjVkYi00YWE1LWJhMzktZWMyYjY3NTU4MWRlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjg1MTczYzgtZjVkYi00YWE1LWJhMzktZWMyYjY3NTU4MWRlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-10-19T08:36:43.763Z",
        "url": "https://www.imdb.com/video/vi3019424025/"
    },
    "url": "/title/tt0054412/"
}