{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tupac Shakur",
            "url": "/name/nm0000637/"
        },
        {
            "@type": "Person",
            "name": "Rappin' 4-Tay",
            "url": "/name/nm0005578/"
        },
        {
            "@type": "Person",
            "name": "Conrad Bain",
            "url": "/name/nm0047699/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9669,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0113677/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0034438/"
        }
    ],
    "datePublished": "2003-11-14",
    "description": "Home movies, photographs, and recited poetry illustrate the life of Tupac Shakur, one of the most beloved, revolutionary, and volatile hip-hop M.Cs. of all time.",
    "director": [
        {
            "@type": "Person",
            "name": "Lauren Lazin",
            "url": "/name/nm1020749/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Documentary",
        "Biography",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY4OTY1NzI4N15BMl5BanBnXkFtZTYwNDI5MzQ3._V1_.jpg",
    "keywords": "title directed by female,reference to latasha harlins,hip hop,reference to tupac shakur,name in title",
    "name": "Tupac: Resurrection",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Buddy-51"
        },
        "dateCreated": "2004-09-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0343121/"
        },
        "name": "compelling look into a man's life",
        "reviewBody": "Gangsta' Rap artist Tupac Shakur was gunned down on the streets of Las Vegas in 1996, the end result of the life he led and the people he knew. He was 25. The documentary 'Tupac: Resurrection' takes an unusual and interesting approach to its subject, allowing the deceased singer to speak to us, as it were, directly from the grave. The film begins with him commenting on his own murder, then tracing back over the events of his life as a means of both setting the record straight and trying to make some sense out of all that happened to him in his very brief time here on earth.\n\nThe film, directed by Lauren Lazin, relies primarily on interviews Tupac gave throughout his short career, supplemented with some additional commentary from those who knew him best. Though he became a lightning rod of controversy due to both his criminal activities and his provocative (i.e. violent, sexist) lyrics, Tupac saw himself more as a 'voice of the people,' using his music as a vehicle for reaching out to and connecting with the downtrodden, impoverished blacks living in the kinds of ghettoes from which he himself sprang. However, even many well-known black leaders and spokespersons had trouble accepting Tupac's rather rose-colored definition of himself. What's most interesting about 'Tupac: Resurrection' is the dichotomy it establishes between the violence, drug use and criminal activities which played so prominent a part in Tupac's life, and the genial, reflective, almost apologetic tone of so much of what we hear him saying. It's hard to know just how much of what has found its way into this film is really raw truth and how much is sugarcoated revisionism designed to 'resurrect' and burnish a man's posthumous image and reputation. His views on women come out particularly incoherent and unresolved. Yet, 'Tupac: Resurrection' is an intriguing documentary because it gives us a glimpse not only into a strangely conflicted individual but also into the even more bizarre world of corporate thuggery he inhabited. Like many artists who have attempted to speak for the 'little people,' Tupac became a victim of his own success and celebrity, living the kind of pampered lifestyle that most of the people he was singing about would clearly never know. It's a conflict as old as art itself, and it is one that Tupac, for understandable reasons, was never able to resolve in his own life. Interestingly, however, his brutal death at the hands of murderous rivals, demonstrated that he never made it quite so far from his roots as his lavish lifestyle might otherwise have suggested.\n\nAs a document, the film traces Tupac from his early years as the child of two Black Panther members ( a pedigree that, he believes, set him on the path to social crusader early on), through his youth in poverty, his exposure to literature and drama at a performing arts high school in Baltimore, his early attempts at performing, his meteoric rise in the music industry, his years as a controversial celebrity, his burgeoning film career, his continuing battles with police, the first attempt on his life, his conviction for rape, his time in prison, and, finally, to the rivalry between his own West Coast label, Death Row Records, and the East Coast label, Bad Boy Records, which ultimately led to his untimely death. For that little bit of history alone, the film is worth watching.\n\nAs someone who knew very little about the life of Tupac - and even less about his music - before watching the movie, I found him to be both appealing and repellant, frightening and charismatic. The film leaves the audience feeling as conflicted as the subject - which is what a truly successful documentary should do after all."
    },
    "url": "/title/tt0343121/"
}