{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Monique van de Ven",
            "url": "/name/nm0892857/"
        },
        {
            "@type": "Person",
            "name": "Rutger Hauer",
            "url": "/name/nm0000442/"
        },
        {
            "@type": "Person",
            "name": "Tonny Huurdeman",
            "url": "/name/nm0404702/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11347,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "alternateName": "Turkish Delight",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0013530/"
        },
        {
            "@type": "Person",
            "name": "Gerard Soeteman",
            "url": "/name/nm0812121/"
        },
        {
            "@type": "Person",
            "name": "Jan Wolkers",
            "url": "/name/nm0938512/"
        }
    ],
    "datePublished": "1974-09-27",
    "description": "A young love faces with old problems.",
    "director": [
        {
            "@type": "Person",
            "name": "Paul Verhoeven",
            "url": "/name/nm0000682/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWI1NmFkNzAtMTUxOC00NGYyLWJhMmUtYWUyYjIzMmEyY2VmXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "female nudity,female full frontal nudity,nudity,hairy vagina,vagina",
    "name": "Turks fruit",
    "original_info": {
        "id": "Turkish Delight_1974",
        "name": "Turkish Delight",
        "year": "1974"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Galina_movie_fan"
        },
        "dateCreated": "2006-09-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0070842/"
        },
        "name": "\"Love Story\" told by Paul Verhoeven",
        "reviewBody": "Few days ago, I watched the documentary Z Channel: A Magnificent Obsession (2004) about a channel that had brought the great and unavailable anywhere else films to its 100, 000 lucky subscribers in LA in 70s - 80s. While enjoying the clips from many Foreign and Independent movies that were the best part of documentary, I was able to recognize the movie that I saw many years ago in Moscow and still remember well, I could not only recall the title. I remember that the movie was Dutch, very erotic  in the raw, brutal, twisted yet beautiful and passionate way. Watching \"Z Channel...\" I was happy to instantly recognize \"Turks fruit\" (1973) aka \"Turkish Delight\" made by Paul Verhoeven in 1973. I checked with Netflix, the movie was available; I bumped it up in my queue and just finished watching it. My memory served me well - Verhoeven's early film is as naturalistic, earthy, brutal, erotic, humorous, poetic, poignant, and captivating as I remember it. Based on the novel by Jan Wolker, \"Turkish Delight\" stars young, hot, very sexy (and I mean it - VERY SEXY) Rutger Hauer as a bohemian free spirited and often cruel sculptor Eric and even younger Monique van de Van as his wife Olga, child-like yet as sensual as Eric was, \"the light of his life, the fire of his loins\". The film that describes their stormy relationship has become the most financially successful Holland's film that was nominated for an Academy Award for Best Foreign Language film and was proclaimed by Jan Wolker a \"75% masterpiece\".\n\nThere are not very many directors in the world that can create the atmosphere of raw sensuality as well as Verhoeven (of his Dutch period, especially). Verhoeven is known for uncompromising approach to his work, fiery temperament, and aggressive movie-making. Joe Ezsterhaus who worked with Verhoeven on two films said about him: \"The guy is like his movies: brilliant, mercurial, very daring, perverse, a wonderful series of paradoxes and contradictions...\" \"The Turkish Delight\" is all that and I love it but I can understand how its graphic sexuality, more than one disgusting and revolting scenes (but they had to be in the movie) and crude behavior may put off a lot of viewers. Be prepared, \"Turkish Delight\" is delightful but it is very intense and often not easy to watch.\n\n8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0070842/"
}