{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Soran Ebrahim",
            "url": "/name/nm1714874/"
        },
        {
            "@type": "Person",
            "name": "Avaz Latif",
            "url": "/name/nm1716931/"
        },
        {
            "@type": "Person",
            "name": "Saddam Hossein Feysal",
            "url": "/name/nm1795482/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 20088,
        "ratingValue": 8,
        "worstRating": 1
    },
    "alternateName": "Turtles Can Fly",
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0087772/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0024879/"
        },
        {
            "@type": "Person",
            "name": "Bahman Ghobadi",
            "url": "/name/nm0315842/"
        }
    ],
    "datePublished": "2005-02-23",
    "description": "Near the Iraqi-Turkish border on the eve of an American invasion, refugee children like 13-year-old Kak (Ebrahim), gauge and await their fate.",
    "director": [
        {
            "@type": "Person",
            "name": "Bahman Ghobadi",
            "url": "/name/nm0315842/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMWRjMGI5YjMtYzY0Yy00MzE0LTgwZTQtMzc1MDE2YTQ5ZGVjXkEyXkFqcGdeQXVyODU5MDg5OTY@._V1_.jpg",
    "keywords": "orphan,watching tv,american,boy,refugee",
    "name": "Lakposhtha parvaz mikonand",
    "original_info": {
        "id": "Turtles Can Fly_2005",
        "name": "Turtles Can Fly",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "aliasanythingyouwant"
        },
        "dateCreated": "2005-12-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0424227/"
        },
        "name": "Hope and Despair in a World on the Brink",
        "reviewBody": "Turtles Can Fly takes place in a world of hellish bleakness, a land that seems post-apocalyptic with its barren expanses, its piles of rusted military machinery, its barbed-wire and tents. It's a world that has suffered wars before - the wreckage of them is everywhere, spent shells piled like cord-wood, disabled tanks tossed together like so many discarded toys - and again it is preparing for conflict; the talk among the people is all about the great army that's coming to invade, and sweep everyone away, they believe, in a tide of fire. But this is no fictional, Mad Max world - the story takes place in a village/refugee camp on the border between Kurdish Iraq and Turkey, and the great army the people speak of is the American force come to remove Saddam Hussein from power. With a kind of superstitious dread the village elders await news from the outside, buying themselves a satellite dish so they can watch CNN (but not the forbidden channels, the \"sexy and dancing\"). The guy who installs the dish for them is a figure of local renown nicknamed Satellite. He's about thirteen years old, yet comports himself as an adult, speaking to the elders on equal terms with them, arguing with them, refusing to stay and translate the English-speaking news programs. Besides his dish-installation and linguistic services, Satellite also has a few other irons in the fire. His main source of money is land-mines, digging them up and selling them to dealers, and to help him he employs an army of orphaned kids, many of whom bear the marks of accidents related to their deadly trade, missing and mangled limbs.\n\nThe film revolves around this anything-but-lonely Satellite, portrayed by Soran Ebrahim as a whirlwind of words and energy, who leads his compatriots through the darkness of a world where family ties have been not just ripped apart but obliterated, where the possibility of death or dismemberment lurks around every rock. Not quite a Messiah - he's too practical for that, and too easily distracted - Satellite takes on a quality reminiscent of Kipling's Kim, the quality of precociousness forced by circumstance to evolve not only into adult competence but the kind of leadership, firm but benevolent, one would be proud to discover in a general. The great thing about Satellite is that director Bahman Ghobadi allows him to be a kid too. Newly arrived in the village are a girl and her two brothers, one of whom has had his arms blown off, the other of whom is a blind infant with a propensity to sleepwalk; Satellite takes a particular shine to the girl, a pretty but somber creature named Agrin, and tries to impress her by diving into a pond for the red fish that allegedly dwell in its silty depths (he doesn't know that the girl, traumatized by Saddam's soldiers, is far beyond being impressed by anything, and is in fact suicidal).\n\nThere are no adult characters of any importance in Turtles Can Fly; the only grown-ups are the village elders, a load of cranky, useless worry-worts, and the various shady arms dealers Satellite does business with, who care about nothing but dickering. There's no sense of traditional family structure for the lost children of this borderline world, this barren, unforgiving land with its hidden dangers, its artifacts of calamities past; there's no kind of authority anywhere, except the soldiers on the other side of the border, who the kids like to tease until they fire off their guns (a crippled boy uses his withered leg as a \"gun\" he pretends to shoot at a border-guard). There's a certain irony to the elders' concern over the coming invasion - they fear some terrible thing is about to befall them, failing to realize that the earth-shattering event has already happened, that the village and the camp are filled with children whose parents have been killed or fled, that their society has already been torn into a million pieces, and that a different order has begun emerging, one represented by Satellite, who speaks not only the native tongue but English too, who knows about the new ways of technology as well as the old, who doesn't dread the coming of the Americans but awaits it with excitement. Satellite and his kids represent the future, one that is fraught with peril but also promises hope, but at the same time there are darker shadings, embodied by the character of Agrin, who wishes to do away with the infant she's been saddled with, and do herself in as well.\n\nAgrin is a mysterious character, a young woman who has been sapped of the will to live, who seems unable to feel anything anymore, who yet retains some strange magnetism, which is not lost on Satellite, who becomes entranced by her, but can never penetrate her impassive surface. Satellite embodies the essential life-force, the thing that survives in spite of everything, that shucks off misery and heartbreak and keeps plugging forward, while Agrin embodies the opposite force, which wishes to succumb to death's whispers, to fall into the fog and disappear forever. The film exists in a murky gray area between life and death, between plucky survivalism and blackest despair. The triumph of Satellite is that he keeps things moving toward tomorrow, not worrying about what kind of tomorrow is to come, but doing it because he has to, because there's no one else to do it. The film ends on an ambivalent note though: the American army has come at last, not to annihilate after all, but as the long-awaited convoy rumbles past, Satellite turns his back on it, and looks to the land instead. America, the film seems to be saying, offers no real salvation for this tortured world and its displaced people. The true salvation must come from within."
    },
    "url": "/title/tt0424227/"
}