{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gregory Peck",
            "url": "/name/nm0000060/"
        },
        {
            "@type": "Person",
            "name": "Hugh Marlowe",
            "url": "/name/nm0549280/"
        },
        {
            "@type": "Person",
            "name": "Gary Merrill",
            "url": "/name/nm0581282/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15187,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Person",
            "name": "Sy Bartlett",
            "url": "/name/nm0058905/"
        },
        {
            "@type": "Person",
            "name": "Beirne Lay Jr.",
            "url": "/name/nm0493446/"
        },
        {
            "@type": "Person",
            "name": "Henry King",
            "url": "/name/nm0454771/"
        }
    ],
    "datePublished": "1950-02-13",
    "description": "A hard-as-nails general (Gregory Peck as General Savage) takes over a B-17 bomber unit suffering from low morale and whips them into fighting shape.",
    "director": [
        {
            "@type": "Person",
            "name": "Henry King",
            "url": "/name/nm0454771/"
        }
    ],
    "duration": "PT2H12M",
    "genre": [
        "Drama",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmI0YTA4OWYtYTc2MC00ZTgxLTliMjItMTlhNzczODViZmYxXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "american in the uk,boeing b 17 flying fortress,ptsd post traumatic stress disorder,four engine airplane,airplane navigator",
    "name": "Twelve O'Clock High",
    "original_info": {
        "id": "Twelve O'Clock High_1949",
        "name": "Twelve O'Clock High",
        "year": "1949"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "writers_reign"
        },
        "dateCreated": "2004-08-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0041996/"
        },
        "name": "Plain Torque",
        "reviewBody": "It's a good twenty years since I last saw this movie on TV and I retained very pleasant memories of it, so much so that when I saw it on DVD a couple of days ago I snapped it up. Watching it again I was equally impressed but I turned to this site with some trepidation fearing that a modern audience may find it slightly risible but I was delighted to read the many raves to which I now add my own. Several commentators have noted a thematic similarity with 'Command Decision' released one year prior to this but no one seems to have realized, or at least not mentioned, that these two movies paved the way for a spate of 'stress' type movies in the 50s, Paul Newman in 'The Rack', Tony Hopkins in 'Fear Strikes Out' (actually a true story of the Red Sox's Jim Piersall and his stress-related breakdown) and ironically Peck himself, some fifteen years later would deal with stress from the other side of the shrink's desk in his eponymous role in 'Captain Newman, MD'. But I digress; several commentators have also mentioned the framing device and again I'd like to endorse the positive comments. The movie opens in 1949 in a London street when civilian Dean Jagger leaves a London Hatters (looking remarkably like Bates in Jermyn Street) and after exchanging what seems like an innocuous bit of dialogue with two shop assistants but is really there to illustrate the difference between Americans and English, he goes on his way, stopping briefly to look at his reflection in a neighboring shop window and find himself face to face with a Toby Jug that clearly has vivid memories for him. Having purchased the Jug he is next seen cycling in the country and walking through an abandoned airfield. Although not essentially a visual film - because the talk is the important thing - helmer Henry King obtains a beautifully lyrical effect by leaving his camera on Jagger's face as the sound of airplane engines grows louder and louder and the grass begins to sway dramatically and all at once we are back in 1942 on an airfield at the heart of the still unproved, ergo still controversial 'daylight' bombing raids over Germany. Quickly, economically, we are made privy to the situation that prevails; the station has been having a lean spell, okay, they may be overworked but there are too many planes not making it back, too many elementary mistakes. Colonel Keith Davenport (Gary Merrill) is idolised by the crews not least because he flies nearly every mission himself and is clearly all but burned-out. Brigadier General Frank Savage (Gregory Peck) realizes as much in an informal conversation with his friend, Davenport, and passes on his misgivings to Major General Ben Pritchard (Millard Mitchell). Finding it difficult to believe Pritchard goes to see for himself and what he DOES see leads him to relieve Davenport of command and replace him with Savage. It's a thankless job for Savage, go in playing the heavy because the humane approach doesn't cut it in wartime. We've been here before a thousand times and we KNOW that in the end the martinet is going to crumble and win the love of the guys but as I've said before in these pages and will no doubt say again, it's all in the wrist. Peck, a fine and underrated actor gives arguably his greatest ever performance here, and he gave many great ones but in no sense does he 'carry' the film because he doesn't have to. EVERYONE involved, even Merrill and Marlowe, normally wooden actors, rise to the occasion and deliver career-best performances. Jagger's performance earned him a Best Supporting Actor Oscar and if he wasn't perhaps the Best Supporting Actor that year it is safe to say that there were none BETTER. Perhaps the most amazing thing about this film is that even now, some sixty years later when stress, combat fatigue, maximum effort, etc have long been identified as medical conditions we can still watch this film with first-time eyes and enjoy it to the full. 9/10"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this war time drama",
        "duration": "PT2M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2943616793",
        "name": "Twelve O'Clock High",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjM5NDc0ZDItODg2OC00ZTc5LWE2YTctMTA2ZDZkYTA3YTUxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjM5NDc0ZDItODg2OC00ZTc5LWE2YTctMTA2ZDZkYTA3YTUxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-05-18T16:16:29Z",
        "url": "https://www.imdb.com/video/vi2943616793/"
    },
    "url": "/title/tt0041996/"
}