{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Cecilia Cheung",
            "url": "/name/nm0156444/"
        },
        {
            "@type": "Person",
            "name": "Eason Chan",
            "url": "/name/nm0150873/"
        },
        {
            "@type": "Person",
            "name": "Candy Lo",
            "url": "/name/nm0516284/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 451,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "Twelve Nights",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0035542/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0015592/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0033915/"
        },
        {
            "@type": "Person",
            "name": "Oi-Wah Lam",
            "url": "/name/nm0482673/"
        }
    ],
    "datePublished": "2000-04-20",
    "description": "Air stewardess Jeannie meets engineer Alan on a bus and the two start their love. The two are deeply attached to each other at the very beginning and feel the passage of affection as time goes on. They break up ultimately and star...",
    "director": [
        {
            "@type": "Person",
            "name": "Oi-Wah Lam",
            "url": "/name/nm0482673/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGUzOThmZmItMjg2NC00M2MwLTg1MzYtZTdmOTNlNmFiMWNjXkEyXkFqcGdeQXVyMjg0MTI5NzQ@._V1_.jpg",
    "name": "Shap yee yeh",
    "original_info": {
        "id": "Twelve Nights_2000",
        "name": "Twelve Nights",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "leekandham"
        },
        "dateCreated": "2003-02-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0282159/"
        },
        "name": "No depth",
        "reviewBody": "The idea was there, and probably it'd make a good book, but I'm afraid this is no Shakespeare, either literally or not.\n\nTwelve Nights tells of the ups and downs of a relationship, not over 12 consecutive nights as the story might suggest, but 12 particular snapshots. Jeannie (Cecilia Cheung) turns up to her birthday party only to find that her boyfriend may be cheating on her. Meanwhile, Alan (Eason) and his girlfriend are on the verge of breakup. They meet after Jeannie's party, as Alan accompanies her back to her flat. A relationship blooms and eventually, the natural questions are asked.\n\nThe scenes in this film are unfortunately too short. Given that all Chinese films have this unwritten rule (or maybe it is written), that films have to be an hour and a half long and no longer, 12 nights only leaves on average 7.5 minutes for each night... As a consequence the characters can't really develop very much, and I'm left feeling that I wish I knew the characters a little bit more before the end. And that's the real downfall. For me, it appears there isn't that much the actors have to do except go through the motions. There is very little depth in the story.\n\nUltimately, though, this film was a stepping stone for two talented actors. Eason Chan and Cecilia Cheung have done well since and well deserved. But for this film, I'm afraid it's probably one to leave on the shelf unless you want the full collection of films of either actor.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0282159/"
}