{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Yekaterina Golubeva",
            "url": "/name/nm0326751/"
        },
        {
            "@type": "Person",
            "name": "David Wissak",
            "url": "/name/nm0936618/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4882,
        "ratingValue": 5.1,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0029856/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0054820/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0107016/"
        },
        {
            "@type": "Person",
            "name": "Bruno Dumont",
            "url": "/name/nm0241622/"
        }
    ],
    "datePublished": "2003-09-17",
    "description": "David, an American photographer, and his Russian girlfriend Katia are scouting locations for a photo shoot. During the day, they drive through some of the wildest, most bizarre desert landscapes, but their luck begins to run out.",
    "director": [
        {
            "@type": "Person",
            "name": "Bruno Dumont",
            "url": "/name/nm0241622/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Drama",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzc3NDc1YTQtMTE2Mi00M2NjLTkwOWMtMWZmZjZhNmNmMjczL2ltYWdlXkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_.jpg",
    "keywords": "male nudity,desert,nudity,public nudity,sex scene",
    "name": "Twentynine Palms",
    "original_info": {
        "id": "Twentynine Palms_2004",
        "name": "Twentynine Palms",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "howard.schumann"
        },
        "dateCreated": "2003-10-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0315110/"
        },
        "name": "Shock and horror",
        "reviewBody": "A three-legged dog, a dead body lying naked in the middle of the desert, a cop on his walkie-talkie calling for backup and a road block miles from the nearest inhabitant. These and other bizarre things show up in Twentynine Palms, the latest film by Bruno Dumont (La Vie de Jesus, L'Humanite). It is essentially a horror film that might easily be called \"Scream 4\". The opening scenes are beautiful and serene. David (David Wassik), an independent photographer from Los Angeles, and Katia (Katia Golubeva), a young woman without work, travel in a red 4X4 Hummer toward the vast California desert preparing to do a photo shoot for a magazine near the Joshua Tree National Park. The road leads to a motel in the city of 29 Palms, a desert oasis that in the film consists of one gas station, one hotel, and a swimming pool. Dumont says that he filmed in the U.S. rather than his native France because he \" felt the need to change space, ingredients, colors... and it is while filming in California that I had a true shock\". The shock extends to the viewer as well. \n\nThere is little dialogue or action in the conventional sense. The communication between the couple is complicated by the absence of a common language: he speaks English, she only speaks French. What conversation exists is trapped in a level of superficial banality. The lovers explore the desert in their 4X4 and are focused entirely upon their own pleasure, seemingly defined by their sexuality. They swim in the motel pool, watch game shows on television, eat, make love in the middle of the desert, eat some more, argue and make up, then make love some more, all shown in explicit detail. Everything is familiar, a slice of typical Americana, yet nothing is as it seems. \n\nLittle by little the milieu becomes oppressive; a quiet and incoherent fear begins to settle in, an abstract fear because as Dumont says, \"there is no reason to be afraid.\" At the end, nothing can fill the emptiness but destruction. The contrast between the poetry of nature and the constricted range of the human experience is clear. In this world without a spiritual core, the screams of pain and screams of delight are indistinguishable and anguish has the same meaning as pleasure. According to Dumont, \"There is at the same time the bliss of pure happiness and absolute horror, the capacity to generate the two extremes: the hyper violence and the hyper pleasure. This is a couple that lives for pure pleasure and that will be led into abomination.\" \n\nOne cannot be neutral about a Bruno Dumont film (many people walked out during the Vancouver showing). His audiences are polarized between those who love and those that detest his films and the director seems disinterested in reconciling the two. I found this film extremely difficult to watch and even harder to be emotionally engaged with the characters. Dumont tests our endurance with scenes of brutal violence, making no concession to our sensibilities. In bringing us face to face with our worst nightmare, however, he forces us out of our state of emotional detachment and compels us to react, not with our minds or even our hearts, but viscerally with the totality of our being. Far removed from the pre-digested package cinema of Hollywood, Dumont has made an important statement about American values. The question must be asked however -- with films like Twentynine Palms that are so off-putting, will there be anyone who notices?"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Wellspring",
        "duration": "PT1M16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi892338969",
        "name": "TwentyNiNE Palms",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2E3N2VjNWMtYmI4NS00NDlkLWExZGItODEyZTZkY2Q4MWFkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2E3N2VjNWMtYmI4NS00NDlkLWExZGItODEyZTZkY2Q4MWFkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-01-25T07:50:29Z",
        "url": "https://www.imdb.com/video/vi892338969/"
    },
    "url": "/title/tt0315110/"
}