{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ellen Vogel",
            "url": "/name/nm0900887/"
        },
        {
            "@type": "Person",
            "name": "Gudrun Okras",
            "url": "/name/nm0645707/"
        },
        {
            "@type": "Person",
            "name": "Thekla Reuten",
            "url": "/name/nm0720671/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6984,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "Twin Sisters",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0006475/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0016496/"
        },
        {
            "@type": "Person",
            "name": "Tessa de Loo",
            "url": "/name/nm0519620/"
        },
        {
            "@type": "Person",
            "name": "Marieke van der Pol",
            "url": "/name/nm0688745/"
        }
    ],
    "datePublished": "2002-12-12",
    "description": "Twin Sisters is an epic love story based on the Dutch bestseller by Tessa de Loo that has been read by more than 3.5 million readers in Holland and Germany.",
    "director": [
        {
            "@type": "Person",
            "name": "Ben Sombogaart",
            "url": "/name/nm0813786/"
        }
    ],
    "duration": "PT2H17M",
    "genre": [
        "Drama",
        "Romance",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgyNjcwODg5OV5BMl5BanBnXkFtZTcwMzE1MzMzMQ@@._V1_.jpg",
    "keywords": "twins,nazi germany,holocaust,ss officer,1930s",
    "name": "De tweeling",
    "original_info": {
        "id": "Twin Sisters_2002",
        "name": "Twin Sisters",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jotix100"
        },
        "dateCreated": "2006-04-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0322674/"
        },
        "name": "Unidentical twins",
        "reviewBody": "Little prepares Lotte and Anna, twin sisters living happily with their beloved father, for what life had in store for them. After the girls' father dies, they are left alone at the mercy of relatives who separate them in an act of sheer cruelty. Lotte and Anna go through a lot in life, not knowing, at times, about one another, and spend most of their lives apart.\n\nLotte fares better of the two sisters. She was a frail girl growing up and her relatives dote on her since they regard her as an invalid. Lotte writes to Anna letters during the first years of being apart, but those letters are never sent. Anna, on the other hand, is made a slave, practically, as she is made to help in the family farm and is never given the opportunity to attend school until the kind priest discovers how she has been severely beaten.\n\nThe other encounter of the sisters occur too late in life. Lotte, who when first visits Anna at the place where she is employed as a maid, by a wealthy Nazi sympathizer, is appalled by the way Anna has turned out to be an anti Semite. This puts a barrier between them not to be broken until both are too old and too stubborn to recognize how wrong they both have been about the past. Their last reunion is a bitter experience, especially for Anna, who is in poor health.\n\nThis excellent Dutch film directed by Ben Sombogaart, is based on a novel by Tessa DeLoo, which was published in this country as \"Twins\", gets a magnificent treatment in a lavish production that covers several decades. The action is set in Holland and in Germany.\n\nThe basic reason for watching the film is the great acting the director got from Thekla Reutins and Nadja Uhl, who are seen as the young Lotte and Anna. Both these young actresses are perfect as the twins in their youth. Ellen Vogel and Gudrum Okras, on the other hand, are also effective as the older sisters have a final confrontation at a spa where both have gone for cures.\n\nThe film shows a talented director, Ben Bombogaart, doing an excellent job in this richly layered tale of sisterly love and missed opportunities.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0322674/"
}