{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tommy Buda",
            "url": "/name/nm2242768/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 269,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0100632/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003958/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046592/"
        }
    ],
    "description": "Two brothers, one a firefighter, one a police officer, are remembered for their bravery in New York City on September 11.",
    "director": [
        {
            "@type": "Person",
            "name": "Bill Guttentag",
            "url": "/name/nm0349702/"
        },
        {
            "@type": "Person",
            "name": "Robert David Port",
            "url": "/name/nm0691888/"
        }
    ],
    "duration": "PT34M",
    "genre": [
        "Documentary",
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzY2MDI2MzUxMV5BMl5BanBnXkFtZTcwNzMzMTcyMQ@@._V1_.jpg",
    "keywords": "september 11 2001,two word title",
    "name": "Twin Towers",
    "original_info": {
        "id": "Twin Towers_2003",
        "name": "Twin Towers",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Anonymous_Maxine"
        },
        "dateCreated": "2006-11-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0344503/"
        },
        "name": "A look a the real New Yorkers.",
        "reviewBody": "I have seen several films and documentaries based on the 9/11 attacks, but none that really showed the gritty New York firefighters and other emergency responders quite as clearly and effectively as this one. The film focuses on one of the countless tragic stories that occurred that day, this one of a family of dedicated firefighters that lost two of three sons in a matter of minutes as they rushed to help at Ground Zero. The one surviving son, Joseph Vigiano, talks in the film about growing up with two brothers who eventually became heroes, even more than they already were before they were killed.\n\nI think that the single most important thing to do to make movies and documentaries about 9/11 great - all of them - is to keep the politics out, at all costs, and this film definitely does that. It is not at all about the mistakes that were made or warnings that were ignored or phones that weren't answered or jets that weren't sent, but was only about the importance of family. United 93 came about as close to politics as I think 9/11 films can come without becoming preachy or assigning guilt, but only because it deals with the actual events, and our minds tend to have by now become so programmed to translate whatever we hear about 9/11 into a stratification of blame that we can watch an objective presentation of the events and see the blame without it even being there.\n\nJoseph Vigiano says in this film that no matter what, he always kisses his family when he leaves and says goodbye because he never knows when he might not come home. And the important message that this film delivers to men and women and families everywhere is the feeling that, no matter what job Joseph had, his goodbyes would never change. The film is an answer to the mournful cry, \"I never got to say goodbye.\"",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0344503/"
}