{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Anderson",
            "url": "/name/nm2644007/"
        },
        {
            "@type": "Person",
            "name": "Barbara Blaine",
            "url": "/name/nm3149808/"
        },
        {
            "@type": "Person",
            "name": "David Clohessy",
            "url": "/name/nm3149831/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 958,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0163927/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0139821/"
        }
    ],
    "datePublished": "2004-08-20",
    "description": "A man confronts the trauma of past sexual abuse as a boy by a Catholic priest only to find his decision shatters his relationships with his family, community and faith.",
    "director": [
        {
            "@type": "Person",
            "name": "Kirby Dick",
            "url": "/name/nm0225269/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYyNzM3Mzc3M15BMl5BanBnXkFtZTcwMjE4MDgyMQ@@._V1_.jpg",
    "keywords": "sexual abuse,family relationships,husband wife relationship,firefighter,first communion",
    "name": "Twist of Faith",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "meyerhoo512"
        },
        "dateCreated": "2011-03-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0436857/"
        },
        "name": "this is directed to Braindog",
        "reviewBody": "This is directed to Braindog... All I have to say is...have you ever been sexually abused? NOTHING is black and white. You have shown your utter ignorance in your review. I have not yet seen this film but after reading the reviews, I am very interested in seeing it. I have to say though, that I was completely blown away by Braindog's comment. If anyone has personally experienced sexual abuse, either personally or through a close friend, then they would know that it's not as simple as Braindog makes it seem. When the church is a huge part of one's life from the time they very little, even after something horrible happens by a respected member of the church, the person is not absolutely ready to reject the whole of the church by that one member's atrocity. There is separation and compartmentalization that occurs between the church as a whole and the offender who is a part of the church. The fact that one of the people highlighted in the film kept attending the church and had his daughter's First Communion in the church makes complete sense to me. Think of it this way. Are you willing to walk away from your family when one of them hurts you? Yes, the hurt is CONSIDERABLY less and completely in a different vain, but what if that parent hit you or verbally abused you throughout your life...you still feel a connection to that person or a connection to the family...most aren't willing to just walk away from the family for forever. To me, it's all about empathizing. Even though you may not have reacted a certain way, don't judge and put down others for what they did. And, you never know what you may do until you have \"walked a mile in another's shoes.\""
    },
    "url": "/title/tt0436857/"
}