{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Connie Mason",
            "url": "/name/nm0556654/"
        },
        {
            "@type": "Person",
            "name": "William Kerwin",
            "url": "/name/nm0450138/"
        },
        {
            "@type": "Person",
            "name": "Jeffrey Allen",
            "url": "/name/nm0020639/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5015,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0129116/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0147872/"
        },
        {
            "@type": "Person",
            "name": "Herschell Gordon Lewis",
            "url": "/name/nm0504496/"
        }
    ],
    "datePublished": "1964-03-20",
    "description": "Six people are lured into a small Deep South town for a Centennial celebration where the residents proceed to kill them one by one as revenge for the town's destruction during the Civil War.",
    "director": [
        {
            "@type": "Person",
            "name": "Herschell Gordon Lewis",
            "url": "/name/nm0504496/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMThkNzU1MzEtOGZjMi00OTBiLTg0ZTQtYjUzNWM1N2U2NjkzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "bluegrass music,quicksand,legend,psychopathic killer,southern gothic",
    "name": "Two Thousand Maniacs!",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tomgillespie2002"
        },
        "dateCreated": "2013-06-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0058694/"
        },
        "name": "An improvement on Blood Feast",
        "reviewBody": "After his successful début, Blood Feast (1963), which introduced cinema audiences to splatter horror, Herschell Gordon Lewis made his redneck horror movie, Two Thousand Manics!. Just a few years later, horror movies set in America's Deep South were all the rage, and are still a popular location for some gruesome slicing and dicing (Tucker and Dale Vs. Evil (2010) made fun of the racial stereotyping), so perhaps we have this film to thank for the likes of The Texas Chain Saw Massacre (1974) and Deliverance (1972). And Lewis goes all out, with Dixie flags aplenty and thick-accented inbred simpletons in dungarees, in what is a noticeable improvement on his ropey début.\n\nCelebrating their centennial, the town of Pleasant Valley welcome six Yankee visitors who unwittingly drive into their celebrations. The town's mayor, Buckman (Jeffrey Allen - who went on to star in a few of Lewis's films), promises them some of that famous Southern hospitality, but with his two retarded henchman, plans to butcher them all to gain vengeance for a massacre committed a hundred years previously in the midst of the American Civil War. Terry Adams (Connie Mason), who has picked up hitch-hiker Tom (William Kerwin) on his way to a 'teacher's conference', notice their fellow Yankees disappearing under strange circumstances and attempt to flee the increasingly bizarre town.\n\nEverything about this film looks more professional than Blood Feast, with a more patient approach taken with the moments of gore, and less atrocious editing and camera-work. Don't get me wrong though, the Lewis tropes are there - mannequin limbs, dodgy sound editing, paint-red gore, but it just seems that little bit better. It's still a dreadful film, with Feast's block-headed cheeseball William Kerwin - who actually had a pretty successful acting career - returning for more ham-fisted dialogue delivery, and elongated moments of tedium, but it's still quite fun. The gore is certainly better handled, with everything from dismemberment-by- horse and being pushed down a hill in a barrel full of nails being use to satisfy the blood lust. Which makes it all the more strange that Lewis seemed to retreat back into complete ineptitude after this, with his next film, Color Me Blood Red (1965) being the worst of his 'Blood Trilogy', and the long line of nudie cuties and Z-grade horror films that followed. Still, it's a must-see for horror fans.\n\nwww.the-wrath-of-blog.blogspot.com",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M13S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1595513369",
        "name": "Two Thousand Maniacs",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGY5NTEyZmItMzYxOS00NTZiLWJjMDAtMTE2YTU5NzAyNjBlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGY5NTEyZmItMzYxOS00NTZiLWJjMDAtMTE2YTU5NzAyNjBlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-01-28T06:37:28Z",
        "url": "https://www.imdb.com/video/vi1595513369/"
    },
    "url": "/title/tt0058694/"
}