{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bono",
            "url": "/name/nm0095104/"
        },
        {
            "@type": "Person",
            "name": "The Edge",
            "url": "/name/nm0857253/"
        },
        {
            "@type": "Person",
            "name": "Adam Clayton",
            "url": "/name/nm0165651/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 6032,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103607/"
        }
    ],
    "datePublished": "1988-11-04",
    "description": "A documentary of the Irish rock group U2 on their Fall 1987 tour of North America.",
    "director": [
        {
            "@type": "Person",
            "name": "Phil Joanou",
            "url": "/name/nm0423333/"
        }
    ],
    "duration": "PT1H39M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmE2NGM0YTMtZjE0ZC00NTlhLThmNjEtMzc3M2JkOTIzNTZiXkEyXkFqcGdeQXVyNjYyMTYxMzk@._V1_.jpg",
    "keywords": "u2,black and white to color,star spangled banner,concert film",
    "name": "U2: Rattle and Hum",
    "original_info": {
        "id": "U2: Rattle and Hum_1988",
        "name": "U2: Rattle and Hum",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "JawsOfJosh"
        },
        "dateCreated": "2000-11-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0096328/"
        },
        "name": "A capture of the band at the pinnacle of success and their discovery of America",
        "reviewBody": "\"U2 Rattle & Hum\" is one of the best rock documentaries ever produced because it not only showcases a band at work on stage and in the studio at the peak of their success, but also because it shares with us a rock group in the middle of a discovery. That discovery is U2's first wide-scale American tour, in which they start to explore American \"roots\" music, namely Elvis Presley and B.B. King, among unmentioned others. Aside from the blistering live performances in Denver, San Francisco and Phoenix, the band makes 'holy pilgrimages' to Graceland, Sun Studios and a Harlem church.\n\nU2 were criticized for supposedly saddling themselves up against American musical icons (B.B. King collaborates with them on a tune, they record 5 tracks at Sun Studios, and haggle a Graceland tour guide into letting them photograph one of Elvis' motorcycles), but once the mechanics of the band's relationship are understood, it's obviously clear they are only peeking into this world in an introverted manner instead of trying to include themselves in it. U2 have always been a band with sharp detractors because they place an importance upon music to suggest that it can BE more than just music. This attitude has enabled them to arguably remain the most consistent and important band of the last 20 years.\n\nThe live performances are just amazing. \"Exit,\" Bad,\" \"Pride,\" \"Bullet The Blue Sky,\" and \"Sunday Bloody Sunday\" are delivered with ferocious energy. The film is mostly in black-and-white, which lends itself that needed 'documentary' feel, except for 5 songs performed in color. The energy of the band onstage guarantees this to be a film that will sustain its liveliness no matter how many times you see it."
    },
    "url": "/title/tt0096328/"
}