{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Carlo Battisti",
            "url": "/name/nm0061472/"
        },
        {
            "@type": "Person",
            "name": "Maria Pia Casilio",
            "url": "/name/nm0143686/"
        },
        {
            "@type": "Person",
            "name": "Lina Gennari",
            "url": "/name/nm0312902/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 26619,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0052819/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0062467/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0049510/"
        },
        {
            "@type": "Person",
            "name": "Cesare Zavattini",
            "url": "/name/nm0953790/"
        }
    ],
    "datePublished": "1955-11-07",
    "description": "An elderly man and his dog struggle to survive on his government pension in Rome.",
    "director": [
        {
            "@type": "Person",
            "name": "Vittorio De Sica",
            "url": "/name/nm0001120/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTQyZGM5OTUtZjVlMy00MDgyLWE0YjYtZDYwYTgxMmMyZDIxXkEyXkFqcGdeQXVyNzYxODE3NTQ@._V1_.jpg",
    "keywords": "dog,old man,rent,landlady,pension",
    "name": "Umberto D.",
    "original_info": {
        "id": "Umberto D._1952",
        "name": "Umberto D.",
        "year": "1952"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2003-08-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0045274/"
        },
        "name": "\"Wherever you go, I'll be here.\"",
        "reviewBody": "As I watched Umberto D., by Oscar nominated actor and legendary Oscar winning director Vittorio De Sica, I knew clearly one thing for certain- Carlo Battisti, playing the role of retired civil servant Umberto Domenico Ferrari, is the most convincing non-professional actor in any given decade of European movie-making. He knows the purpose De Sica is after within every ounce of his soul (one can see it repeatedly in his eyes, the small mannerisms)- this is a story of loss, sad yet in an outlook and outcome that is cruel up to a point and never fiddles with the viewer's emotions dishonestly. Therefore, one can see him, in a sense, for what he is- he's us, merely you and I at the end of our lines of life with one wrong step sent to us after another.\n\nBattisti's Umberto is retired, known fairly among his past employees, and living in a dank, infested one room who seems to be on the standard downward spiral for such a neo-realist effort (indeed, like The Bicycle Thief, many of the elements against him are from society's natural pitfalls). His health starts to go, as he gets a fever, and is sent unsympathetically to the hospital and returns to find the place being torn at each wall. The landlady wants him out, since she will only accept full rent instead of partial rent, and the maid of the house (Maria Pia-Casillo), while kind and friendly, lives in a similar prism of fear and emptiness. However, even she can't help him in the financial difficulties. This leads him out into the streets outside of Rome, where the film plays out like a Chaplin movie, without the humor and female companion- only with his best friend in the world, a little dog named Flag.\n\nBy the 3rd act of this epitome of heartbreaker movie-making, a quote passed through my head that Michelangelo Antonionni once stated: The actor is a moving object. That sentence, I can guess, is true of Battisti, as well as for his little dog. Aldo Graziati's camera follows him and his companion like another piece of the frame, which makes our focus on them all the more compelling. They're just their, acting the ways an old man and his pet act with one another, which is care and devotion. Battisti, in turn, delivers for De Sica an over-whelming performance of emotion. The very last scene is one of the definitive milestones of the movement at the time in Italy - despite it all; a relationship between a man and his \"best friend\" can be stronger in desperate times than a man can have with a fellow human being. Truly, this ending is quite suitable for one of the best films of it's time, and for De Sica a memorial tribute to his father. A++",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Three Reasons Criterion Trailer for Umberto D.",
        "duration": "PT1M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi419477529",
        "name": "Umberto D",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGY2ZWMzNDUtNzYyZC00OTFhLWI1NjMtMTVlNDQ0ZDdlNDU1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGY2ZWMzNDUtNzYyZC00OTFhLWI1NjMtMTVlNDQ0ZDdlNDU1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2018-03-21T18:50:23Z",
        "url": "https://www.imdb.com/video/vi419477529/"
    },
    "url": "/title/tt0045274/"
}