{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Rekha",
            "url": "/name/nm0004334/"
        },
        {
            "@type": "Person",
            "name": "Farooq Shaikh",
            "url": "/name/nm0787582/"
        },
        {
            "@type": "Person",
            "name": "Naseeruddin Shah",
            "url": "/name/nm0787462/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1078,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0056387/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0600816/"
        },
        {
            "@type": "Person",
            "name": "Mirza Muhammad Hadi Ruswa",
            "url": "/name/nm1718023/"
        },
        {
            "@type": "Person",
            "name": "Shama Zaidi",
            "url": "/name/nm0952067/"
        },
        {
            "@type": "Person",
            "name": "Javed Siddiqui",
            "url": "/name/nm0796503/"
        }
    ],
    "description": "In Faizabad, British India, Dilawar is sentenced to several years in prison after Amiran's Daroga dad testifies against him. After his discharge around 1840, he extracts his vengeance by abducting Amiran and selling to a brothel m...",
    "director": [
        {
            "@type": "Person",
            "name": "Muzaffar Ali",
            "url": "/name/nm0019464/"
        }
    ],
    "duration": "PT2H25M",
    "genre": [
        "Drama",
        "Musical",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2QxMjc5NzktYmZjNC00NTdkLThjMTItM2NlNzdhNmNiNGU0XkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "love,heartbreak,bandit,brothel,poetess",
    "name": "Umrao Jaan",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jmathur_swayamprabha"
        },
        "dateCreated": "2014-08-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0083248/"
        },
        "name": "Ye Kya Jagah Hai Doston, Ye Kaun Sa Dayaar Hai",
        "reviewBody": "Umrao Jaan(1981) is based on the novel - 'Umrao Jaan Ada' of Mirza Mohammad Haadi Ruswa. I happened to watch the movie first and read the novel later. And undoubtedly, director Muzaffar Ali's cinematic version of the story originally written in the nineteenth century and said to be the true story of a true character, is better than the written work.\n\nThe story belongs to the Tawaayaf(courtesan) Umrao Jaan who was born at Faizabaad as Ameeran. After getting kidnapped and sold to a Kotha(brothel) in Lucknow, she grows up and becomes famous among the rich and the elite because of her Shaayari(Urdu poetry) sung in her melodious voice and coupled with her enchanting dances. However she finds almost everybody around him as greedy for her earnings and she continue to move through her journey of life with a sense of complete loneliness within her. Certain males enter her life and raise false hopes in her heart for being able to live a normal married life containing a loving husband, social acceptance and motherhood but finally, she finds that loneliness only is her destiny.\n\nTaking the story from the said novel, producer-director Muzaffar Ali himself has written the screenplay and dialogs of this movie in association with Shama Zaidi and Jaaved Siddiqui. This script has been written quite crisply without giving undue footage to anything and not allowing the focus to divert from the principal character and her woes. The narrative with the gloom and loneliness of the principal character prevalent in every moment of it, moves at a reasonable pace without allowing any laxity or boredom to creep in. The audience is not only kept engaged in the narrative and glued to the screen for more than two hours but also made to feel the pain, the feelings and the stuffiness of the pivotal character. It is a very impressive movie, no doubt.\n\nThe ending scene is just superb in which Umrao Jaan wipes the mirror to see her face in that. It's an example of sheer brilliance on the part of the filmmaker who conveys the permanent sense of loneliness in the courtesan to the audience leaving the theatre without any spoon-feeding. Anybody who has watched this movie on the big screen must have left the theatre with a throbbing in his / her heart.\n\nUmrao Jaan can be termed as pain-filled poetry written on celluloid. It stirs, moves, pinches and brings tears to eyes. It's a journey made by the spectator alongwith the courtesan known as Umrao Jaan. Within a few minutes, the narrative envelops the viewer and makes him a part of the unusual story of the protagonist being told to him.\n\nThe art director has brought the period of the 19th century alive on the screen. The complete milieu including the architecture, the dialect, the clothes, the style of living etc. are authentic. The cinematographer has also left no stone unturned from his side in this regard and thus a realistic account of that era is presented to the audience who also happen to witness the turbulence due to the Gadar or the mutiny of 1857 by a section of the Indians against the British rule.\n\nRekha quite deservingly won the national award for the best actress for the title role played by her in this movie(though Jennifer Kendal Kapoor was a stronger contender for that award for that year for her performance in 36 Chowringhee Lane). Rekha does not seem to be acting, she appears to be actually living the life of Umrao Jaan. Originally a Tamilian, this talented actress has portrayed the Urdu speaking Shaayara cum Tawaayaf in an amazing manner.\n\nFarooque Sheikh as Umrao Jaan's lover and all the other characters have also done exceedingly well. Even the small characters of Maulvi Saheb(Gajaanan Jaagirdaar) and Bismillah(Prema Naarayan) are able to leave their imprint in the movie. The romance between Farooque and Rekha is so delicate that the audience can't help falling in love with them and their relationship.\n\nKhayyam has composed immortal music with the great Shaayari of Shaharyaar for this movie. All the ghazals and nazms are so touching that any lover of music and Shaayari can keep on listening to them again and again. Dil Cheez Kya Hai Aap Meri Jaan Leejiye, In Aankhon Ki Masti Ke Mastaane Hazaaron Hain, Zindagi Jab Bhi Teri Bazm Mein Laati Hai Hamen, Justujoo Jiski Thi Usko To Na Paaya Humne etc. are heart-conquerors. Most of these are gems in the voice of Asha Bhosle whereas Zindagi Jab Bhi Teri Bazm Mein Laati Hai Hamen is a memorable ghazal of Talat Aziz. The album contains a couple of folk songs also and a classic written by Amir Khusro. However the pain-soaked ghazal (which is placed at the end of the movie) which always brings a flood of tears in my eyes is - Ye Kya Jagah Hai Doston, Ye Kaun Sa Dayaar Hai, Hadd-e-Nigaah Tak Jahaan Gubaar Hi Gubaar Hai.\n\nUmrao Jaan is a true classic. A masterpiece. It was remade by J.P. Dutta in 2006 by taking Aishwarya Rai in the title role. Though I found J.P. Dutta's movie as closer to the novel of Mirza Haadi Ruswa, it lacked the soul of the story. If anybody wants to meet the real Umrao Jaan that used to exist some 150 years ago, then this movie only is the perfect choice for him / her.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0083248/"
}