{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Margarita Fischer",
            "url": "/name/nm0279038/"
        },
        {
            "@type": "Person",
            "name": "James B. Lowe",
            "url": "/name/nm0522962/"
        },
        {
            "@type": "Person",
            "name": "Arthur Edmund Carewe",
            "url": "/name/nm0136886/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 470,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Person",
            "name": "Harriet Beecher Stowe",
            "url": "/name/nm0832952/"
        },
        {
            "@type": "Person",
            "name": "Walter Anthony",
            "url": "/name/nm0031033/"
        },
        {
            "@type": "Person",
            "name": "Harry A. Pollard",
            "url": "/name/nm0689471/"
        }
    ],
    "datePublished": "1928-09-02",
    "description": "Slavery tears apart a black family in the South before the start of the Civil War.",
    "director": [
        {
            "@type": "Person",
            "name": "Harry A. Pollard",
            "url": "/name/nm0689471/"
        }
    ],
    "duration": "PT2H24M",
    "genre": [
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGQxNDcyNzItYzE4OS00ODdmLTkzMmMtOWM5ZjgzYTM3MDZlXkEyXkFqcGdeQXVyMDUyOTUyNQ@@._V1_.jpg",
    "keywords": "slavery,kidnapping,blizzard,american civil war,whipping",
    "name": "Uncle Tom's Cabin",
    "original_info": {
        "id": "Uncle Tom's Cabin_1927",
        "name": "Uncle Tom's Cabin",
        "year": "1927"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bkoganbing"
        },
        "dateCreated": "2009-09-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0018524/"
        },
        "name": "A Family Man",
        "reviewBody": "In these days Harriet Beecher Stowe's novel of Uncle Tom's Cabin is known more by historians as a contributing cause of the Civil War than as an actual literary work. I would happily include myself in that number. The only exposure I had to the story at all was in watching The King And I where Tuptim puts on the play for the king recognizing the story as an indictment of slavery. So sadly did the king, but that's another story.\n\nWhat you're seeing in this 1927 version is not Harriet Beecher Stowe's story, it couldn't be because there are references in the film to the Dred Scott decision, the firing on Fort Sumter and the Emancipation Proclamation all in the future because her story was published in 1852.\n\nWhat slaves, free blacks, and sympathetic northerners like the Quaker family you see who rescue Eliza and her baby are afraid of the new strict fugitive slave law. The law was part of the Compromise of 1850 which almost mandated help for slave catchers who found runaway slaves in the north. It was a stench in the nostrils of folks like the Quakers who were prominent in the anti-slavery movement.\n\nWe're not seeing Stowe's story, but we are seeing her vision of the cruelty of slavery as an institution. Even the idea that black people were to be thought of as equal was radical in too many eyes back in the day.\n\nStowe used a lot of what would later be labeled stereotypes, most importantly the phrase 'Uncle Tom'. That which denotes a person willing to accept inequality in all its forms. The criticism has certain validity, but I think for the wrong reasons.\n\nAs seen her old Uncle Tom is the elder head of the plantation blacks on a Kentucky estate who the master even trusts to go to free state Ohio on business for him. No one can believe that Uncle Tom actually returns, the criticism is that his pride is so broken he accepts what the slave owners give him.\n\nTom returns, not because he accepts, but because in that cabin are his wife and children, even in slavery he's a family man. This is the most horrible thing of all for Stowe, the human beings are property. Even the kindly masters shown here like the Shelbys, Tom's owners accumulate debts and have to sell Tom and break up that family. Families being destroyed is the cardinal sin for Stowe.\n\nExcept for young Virginia Grey playing little Eliza the innocent who hasn't learned to regard certain people as beneath treating as human, most people today won't know the cast members. Some might know Lucien Littlefield who has a small role as a bottom feeding slave dealer. This was not a profession that attracted the best in society. James B. Lowe as Uncle Tom you will not forget, he invests great dignity in the original Uncle Tom role of them all.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0018524/"
}