{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kate Beckinsale",
            "url": "/name/nm0000295/"
        },
        {
            "@type": "Person",
            "name": "John Wood",
            "url": "/name/nm0939795/"
        },
        {
            "@type": "Person",
            "name": "Sinéad Cusack",
            "url": "/name/nm0193661/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2589,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0008195/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0619668/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0619667/"
        },
        {
            "@type": "Person",
            "name": "Arturo Pérez-Reverte",
            "url": "/name/nm0702416/"
        },
        {
            "@type": "Person",
            "name": "Michael Hirst",
            "url": "/name/nm0386694/"
        },
        {
            "@type": "Person",
            "name": "Jim McBride",
            "url": "/name/nm0564319/"
        }
    ],
    "datePublished": "1995-01-05",
    "description": "While restoring an old painting showing a woman and two men playing chess, Julia discovers the text \"Who killed the knight?\" underneath the paint. The painting's owner tells her that one of his forefathers was killed and the paint...",
    "director": [
        {
            "@type": "Person",
            "name": "Jim McBride",
            "url": "/name/nm0564319/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY0NGUxZjItMzZmYS00MTJiLWI3YmUtNzhlMTA3NWEyM2JkXkEyXkFqcGdeQXVyNDQ0MTYzMDA@._V1_.jpg",
    "keywords": "chess,restoration of painting,teacher student relationship,art,restoration",
    "name": "Uncovered",
    "original_info": {
        "id": "Uncovered_1994",
        "name": "Uncovered",
        "year": "1994"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "huh_oh_i_c"
        },
        "dateCreated": "2022-10-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0111549/"
        },
        "name": "Light murder mystery with hairy armpits, doubles as Barcelona tourist advert",
        "reviewBody": "A young Kate Beckinsale barely 20 years old during principal photography (which began one week after her 20th birthday, 2 august 1993), stars as the ingenue protagonist in this light murder mystery. We immediately and easily glean that this is indeed inténded to be a light hearted lowbrow movie, from the cheery musical score which is incessant and at times quite annoying.\n\nBeckinsale plays Julia Darro, a restorer of paintings in Barcelona, who gets a job to restore a 500 year old painting, by the fictitious painter Van Huys (sounds like Van Nuys .... from the boulevard ... get it?) from Flanders, so, not a true Dutch Master but something close to it. She discovers that the painting contains a hidden, painted over message in Latin: \"Quis Necavit Equitem\" or \"Who Killed the Knight?\". What unfolds is a who-dunnit with some plot twists, but since they eventually kill off all possible suspects, when we get near the end, it's pretty clear who is the culprit.\n\nNow, miss Beckinsale bravely shows some skin in this movie but, there have been numerous women who done that before her and at a younger age at that. Of the 260+ actresses in this 18-21 age group, Amber Heard, Barbara Capell, Charlotte Alexandra, Charlotte Walior, Clémence Poésy, Donna Wilkes, Georgina Cates, Hayley Mills, Heather Langenkamp, Helena Bonham Carter, Jacqueline Byers, Katie Holmes, Lizzie Brocheré, Mathilda May, Melanie Griffith, Odile Michel, Romane Bohringer, Tamara Mello come to mind, and those are just the ones that were of legal, non-Brooke Shields age, so to speak. But what makes her truly braver than her younger collegueas, are two things that stand out: She has the lips of Art Malik touching her breasts and ... she shows some truly hairy armpits somewhat later .... I found that last one to be especially shocking, since \"even\" French actressess haven't done that since the 70s. And they dó get a bad rep on the whole hairy armpits thing anyway.\n\nThe lightness of the movie is fully intentional, so much of the whining that it doesn't do the book justice is wholly irrelevant. And I get the feeling that much of the negative reviews come from .... let's call them ... the \"Cesar Belvedere\"-side of the spectrum. Which is odd, because John Wood (what's in a name) is actually one of the excellent aspects of this movie. Even.\n\nOh well. This movie is like Back to the Future, and all JCVD movies: they are excellent in their respective genres. So, don't go comparing this to \"They shoot horses, don't they?\" That's nonsensical. If you think this movie hurts the book, get the funding and make one yourself.\n\n7/10.\n\nThe Melancholic Alcholic.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0111549/"
}