{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kate Beckinsale",
            "url": "/name/nm0000295/"
        },
        {
            "@type": "Person",
            "name": "Scott Speedman",
            "url": "/name/nm0005454/"
        },
        {
            "@type": "Person",
            "name": "Shane Brolly",
            "url": "/name/nm0111274/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 275359,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005323/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010568/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0119799/"
        },
        {
            "@type": "Person",
            "name": "Kevin Grevioux",
            "url": "/name/nm0340485/"
        },
        {
            "@type": "Person",
            "name": "Len Wiseman",
            "url": "/name/nm0936482/"
        },
        {
            "@type": "Person",
            "name": "Danny McBride",
            "url": "/name/nm0564286/"
        }
    ],
    "datePublished": "2003-09-19",
    "description": "Selene, a vampire warrior, is entrenched in a conflict between vampires and werewolves, while falling in love with Michael, a human who is sought by werewolves for unknown reasons.",
    "director": [
        {
            "@type": "Person",
            "name": "Len Wiseman",
            "url": "/name/nm0936482/"
        }
    ],
    "duration": "PT2H1M",
    "genre": [
        "Action",
        "Fantasy",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTk1OTc2ZmUtODU0Yy00NGJiLWJmNmQtODI0MzBjODk3MjI4L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "vampire,latex catsuit,vampire bite,girls with guns,blood",
    "name": "Underworld",
    "original_info": {
        "id": "Underworld_2003",
        "name": "Underworld",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "possiblegod"
        },
        "dateCreated": "2005-11-03",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0320691/"
        },
        "name": "Ignore...",
        "reviewBody": "Everything you've heard from the critics, everything you know about vampires and werewolves, everything that is standard in most fantasy/action films. Then you'll enjoy this film. I, unlike a lot of fans, will not claim that this is a move masterpiece, I will not claim that this will change movie making history. I, however, will go against the critics and say that this is a good film. Not getting a chance to see this in the cinema, when it came out on video I rented it out immediately. Now, at first, I could see what the critics meant it wasn't how the trailers depicted it and the script and acting in places was a bit rusty. I put it back and gave no more thought to it. However I soon found myself thinking about the film and the bits I'd enjoyed. I soon realised that this was good because it wasn't conventional and I couldn't stop thinking about it. There had been so many plot twists, so much to take in that I knew I had to see it a second time. This time I bought it, on DVD, and I found myself watching it again and again. This film gives you wonderful villains and just when you start to hate them something nastier comes along or they give you a motive which makes you confused. In one film the world which you are presented with at the beginning, Lycans (Werewolves) vrs. Vampires, is thrown into doubt. There are no longer good and evil, it is no longer this side versus this side and our hero Selene is stuck in the middle. The thing is every villain in this film seems to be fully justifiable in their actions yet completely nasty. I was trying, after falling in love with this film, to work out where it went wrong. I realised there was too much. You are thrown into this world and you have to keep up, there is no chance to sit down and work things out. That comes after seeing the film, this world explains itself through the characters actions. It is as if this world is real and we are meant to know about it already. Their is a history, their is a false history, their are legendary characters and not all of it is gone into in particular detail. Pieces of the world's history are just thrown in by the characters, as they would be in real life, with no long detailed explanation. That mixed with the cliff hanger ending, the promise of more characters from the past. MEans that even if you weren't sure about this film, the sequel Underworld: Evolution looks like it will be amazing.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Screen Gems",
        "duration": "PT1M30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3258254105",
        "name": "Underworld",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjI2ZjE2NjYtNjRmZS00NmFkLTkzZTctZDdiYjY5ZDBjMGQ5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjI2ZjE2NjYtNjRmZS00NmFkLTkzZTctZDdiYjY5ZDBjMGQ5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-01-30T07:50:05Z",
        "url": "https://www.imdb.com/video/vi3258254105/"
    },
    "url": "/title/tt0320691/"
}