{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mark Canton",
            "url": "/name/nm0004799/"
        },
        {
            "@type": "Person",
            "name": "Peter Grunwald",
            "url": "/name/nm0344657/"
        },
        {
            "@type": "Person",
            "name": "Bernie Goldmann",
            "url": "/name/nm0325927/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 51,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0024003/"
        }
    ],
    "datePublished": "2005-10-18",
    "description": "This documentary appears on the Land of the Dead DVD.",
    "genre": [
        "Documentary",
        "Short"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNGFmYTgxZGUtNzJiZC00NDVmLWJjNjktMDE0OGYxYmMxMTYwXkEyXkFqcGdeQXVyMTEyMDcwNw@@._V1_.jpg",
    "keywords": "making of",
    "name": "Undead Again: The Making of 'Land of the Dead'",
    "original_info": {
        "id": "Undead_2005",
        "name": "Undead",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2012-01-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0496869/"
        },
        "name": "Good Featurette",
        "reviewBody": "Undead Again: The Making of Land of the Dead (2005)\n\n*** (out of 4) \n\nThis 20-minute featurette is about the making of LAND OF THE DEAD but for the most part it's a love feast for its director, George Romero. Dennis Hopper, Asia Argento, John Leguizamo, Robert Joy and Eugene Clark are among the people interviewed as well as producers and a few other crew members. As you'd expect, everyone is pretty much talking about what an honor and pleasure it is to work with Romero and several of them talk about their opinion on his work. This includes Argento talking about how she pretty much grew up on a couple of his sets and Hopper discusses how NIGHT OF THE LIVING DEAD was that same type of film that his EASY RIDER was. We even get a brief clip with Tom Savini talking about his old buddy. The main draw for fans is that they get plenty of behind-the-scenes stuff, which allows them to watch Romero work. There's a lot of footage of him directing and just hanging out with a few of the cast members on the set. Of course, he talks about what he wants from this film. In the end this is your typical promotional piece to help sell the film but for fans of Romero it's certainly better than nothing and is worth watching."
    },
    "url": "/title/tt0496869/"
}