{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jay Wong",
            "url": "/name/nm1303174/"
        },
        {
            "@type": "Person",
            "name": "James Marks",
            "url": "/name/nm0548858/"
        },
        {
            "@type": "Person",
            "name": "Sandra Lee",
            "url": "/name/nm0498205/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 541,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0060181/"
        },
        {
            "@type": "Person",
            "name": "David Lewis",
            "url": "/name/nm1921973/"
        }
    ],
    "datePublished": "2002-05-25",
    "description": "It's Sex and the City meets The Wedding Banquet for young San Franciscan Daniel Chang, living at home with his clueless, traditional mother.",
    "director": [
        {
            "@type": "Person",
            "name": "Todd Wilson",
            "url": "/name/nm0934230/"
        },
        {
            "@type": "Person",
            "name": "Robin Feinberg",
            "url": "/name/nm1359507/"
        }
    ],
    "duration": "PT1H16M",
    "genre": [
        "Romance",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA0MTEzNDA3M15BMl5BanBnXkFtZTYwNDI2NjI3._V1_.jpg",
    "keywords": "male frontal nudity,chinese,sex,basement,gay",
    "name": "Under One Roof",
    "original_info": {
        "id": "Under One Roof_2002",
        "name": "Under One Roof",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "PVcondo1"
        },
        "dateCreated": "2005-02-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0337738/"
        },
        "name": "Sweet yet flawed movie",
        "reviewBody": "As a gay Asian American man, I grew up watching TV and movies where I was never represented. So for me Under One Roof was a welcome change from the usual Hollywood depiction of Asian men as either mysterious strangers, emasculated servants, or comic side kicks. Asian men are never portrayed as the central love interest, or god forbid SEXY.\n\nFinally there is a movie where I can see myself reflected on the screen. A movie where not only the lead actor, but several supporting actors are gay Asian men. Yes, I am familiar with the Wedding Banquet, and yes it is a better movie, but how many years has it been since a gay Asian man was the lead in a movie?\n\nNow I am not saying this is a great movie, far from it. The acting can be wooden at times, and downright bad at other times, but after having listened to the directors commentary I think a lot of that can be blamed on the way that filming had to be rushed along.\n\nThe two leads, Daniel and Robert were convincing in their scenes together, but less so when they were acting with the others in the cast (I think they had real chemistry together) Given the limited budget and time I think everyone did a good job. The writing was a bit stilted in places, but there were some genuinely touching as well as funny scenes in this movie.\n\nAS for the male nudity. As a healthy gay man, I NEVER find frontal male nudity gratuitous. It is always appreciated and very welcome.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0337738/"
}