{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jamie Bell",
            "url": "/name/nm0068260/"
        },
        {
            "@type": "Person",
            "name": "Josh Lucas",
            "url": "/name/nm0524197/"
        },
        {
            "@type": "Person",
            "name": "Dermot Mulroney",
            "url": "/name/nm0000551/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9124,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0026841/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0150453/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041459/"
        },
        {
            "@type": "Person",
            "name": "Lingard Jervey",
            "url": "/name/nm1600857/"
        },
        {
            "@type": "Person",
            "name": "Joe Conway",
            "url": "/name/nm1345430/"
        },
        {
            "@type": "Person",
            "name": "David Gordon Green",
            "url": "/name/nm0337773/"
        }
    ],
    "datePublished": "2004-12-17",
    "description": "A pig farmer's wife dies and he's having problems with the oldest of 2 sons. There is more trouble when his recently released from prison brother arrives.",
    "director": [
        {
            "@type": "Person",
            "name": "David Gordon Green",
            "url": "/name/nm0337773/"
        }
    ],
    "duration": "PT1H48M",
    "genre": [
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYzODgyOTMzMV5BMl5BanBnXkFtZTcwMjU2MTcyMQ@@._V1_.jpg",
    "keywords": "psycho thriller,one word title,police officer,wetting oneself,southern gothic",
    "name": "Undertow",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Flagrant-Baronessa"
        },
        "dateCreated": "2006-07-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0360130/"
        },
        "name": "Intense, brooding, grimy  this is the best film I've seen in a long time",
        "reviewBody": "Director David Gordon Green's critically acclaimed Undertow is a strange but gripping experience. I don't know any other film quite like this. We've seen the slow pacing build up tension in the plot before in films, but it's so much more than that in Undertow  it's the pace of a family's life in the deep backwoods of Georgia and it it patiently lets us absorb everything. Maybe I was in a sensitive and impressionable frame of mind when I saw it, because I remember being so shaken and touched by this fare that its visuals and mood still haunt me.\n\nBut this patient, slow pace is the calm before the storm as it comes to an end when the brother of the father of the family comes to visit, newly released from prison. Josh Lucas is this brother, and he captures the shady nature of his character with effortless conviction. His presence is felt in scenes he is not even in. Upon arriving to the family, the film just takes a completely different turn and we follow the two brave kids in the family on the run in the south from their uncle.\n\nThis is further emphasized by attention-grabbing frames that freeze whenever intensity builds up. This may seem anti-climactic, but it's extremely effective and it makes the chase sequences very exciting and 1970s-influenced. So it essentially shifts between chase mode and (eerily) quiet South-paced calm in a genius way. If you like your films fast-paced and action-filled however, its brilliance may be lost on you  but if you give it time, Undertow will surprise you as it's unpredictable, even in style. This is just how meticulously-crafted it is.\n\nThe film is grimy, dense, brooding and realistic and it zooms in on the deep necks of Georgia, featuring some gorgeously striking visuals, making you feel the dirt and heat of the deep south as if you were right there, breathing the murky warm air from the brown rivers. Some say Green's directing style is reminiscent of Terrence Malick (it is very visually-driven) but I don't think so  rather it is an insult to the former; Green clearly knows what he's doing and lets nature visuals facilitate the story he tells, while Malick lets the story facilitate his pointless nature visuals.\n\nI loved Undertow more every minute it progressed and am now prepared to give this film a 9 out 10. I also have it firmly stapled in my top 10 films of all time list and that is quite a feat for such a low-key dark horse. \n\n9/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M17S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2527397145",
        "name": "Undertow",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjFkZmVkYWUtZWY3Ni00OWZiLThlMTAtYTcwZTA5YTQ3YTI1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjFkZmVkYWUtZWY3Ni00OWZiLThlMTAtYTcwZTA5YTQ3YTI1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-31T06:42:24Z",
        "url": "https://www.imdb.com/video/vi2527397145/"
    },
    "url": "/title/tt0360130/"
}