{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Gere",
            "url": "/name/nm0000152/"
        },
        {
            "@type": "Person",
            "name": "Diane Lane",
            "url": "/name/nm0000178/"
        },
        {
            "@type": "Person",
            "name": "Olivier Martinez",
            "url": "/name/nm0553648/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 92117,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017497/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007127/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0166202/"
        },
        {
            "@type": "Person",
            "name": "Claude Chabrol",
            "url": "/name/nm0001031/"
        },
        {
            "@type": "Person",
            "name": "Alvin Sargent",
            "url": "/name/nm0765091/"
        },
        {
            "@type": "Person",
            "name": "William Broyles Jr.",
            "url": "/name/nm0115310/"
        }
    ],
    "datePublished": "2002-05-10",
    "description": "A New York suburban couple's marriage goes dangerously awry when the wife indulges in an adulterous fling.",
    "director": [
        {
            "@type": "Person",
            "name": "Adrian Lyne",
            "url": "/name/nm0001490/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Drama",
        "Romance",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWRkOTdjMjktZTViMy00ZTgyLTg3NzktODdiZDk1YTExOGFhXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "infidelity,erotic thriller,marital infidelity,adulterous wife,cheating wife",
    "name": "Unfaithful",
    "original_info": {
        "id": "Unfaithful_2002",
        "name": "Unfaithful",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Aidan McGuinness"
        },
        "dateCreated": "2002-07-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0250797/"
        },
        "name": "Enjoyable drama/thriller helped by a great Lane performance",
        "reviewBody": "This is a movie about being unfaithful. you probably guessed that. The unfaithful person is one Connie Sumner (Diane Lane), wife to Edward (Richard Gere). Edward is actually a nice guy, and a loving father to their child Frank (`Malcolm in the Middle' star Erik Par Sullivan). Nonetheless Connie is not content with her somewhat staid home life. One day - caught in a Storm of Foreshadowing! - she is thrown into the life of a Frenchman Paul Martel (Olivier Martinez). He is much younger than her and gradually tempts her into getting with them. Connie must decide whether she can live with this secret affair, or will her misdeeds strike back!! Dum dum DA!\n\nThe first half of the movie is interesting. It's principally played from Connie's point-of-view. Diane Lane is quite excellent here - she's neither the selfish wife and yet she does not overplay the guilt role. She's never quite comfortable in her extra-marital affair but this is conveyed in nice subtle ways - Paul and her are ever only about sex for example (there's no real conversation between them). The whole thing is just a means of escapism - there's no real love there and Lane lets us clearly see this. She portrays passion well, but also the other emotions such as love and, on some level, sadness at being where she is. The minutiae of her performance are what make this movie worth seeing.\n\nUnfortunately the acting abilities of the rest of the cast are nothing special. Martinez gets by on merely looking good and saying suggestive things in silky tones. His character - mostly just a catalyst for Connie and Edward - is incredibly one dimensional, not helped by the forgettable performance. Gere is OK, even when he does get centre stage in the movie. His performances tend to fairly sedate - whether this is him purposely playing a (mostly) controlled character, or a lack of acting ability is not for me to say here. He's a nice guy, who has his suspicions about his wife's change, and reacts in a bog-standard movie way (quite disappointing in some senses). Their kid is just cute and while his lines do actually sound like that of an eight year olds, he's still just blandly `cute kid #1035'.\n\nAdrian Lyne, the director here, is back at his usual forte of adult relationship thrillers. It's all pretty good - some nice symbolic touches (ohh look a shot of a kettle on a hot stove as Connie wincingly dabs her cut!), and an ending that's agreeably ambiguous (and well shot). The pacing here is generally pretty good (the use of two main characters helping), although that can't help the disappointing nature of the second half of the movie. Still `Unfaithful' is above average for it's type, mostly due to Lane. Catch it on TV sometime as it does not requite a big screen. 6.3/10."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from 20th Century Fox",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2699034905",
        "name": "Unfaithful",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMThjYmFlMTEtODk1MC00OGE4LTg4MzQtMWVkZTBlOWJkYmU1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMThjYmFlMTEtODk1MC00OGE4LTg4MzQtMWVkZTBlOWJkYmU1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:36:19Z",
        "url": "https://www.imdb.com/video/vi2699034905/"
    },
    "url": "/title/tt0250797/"
}