{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Clint Eastwood",
            "url": "/name/nm0000142/"
        },
        {
            "@type": "Person",
            "name": "Gene Hackman",
            "url": "/name/nm0000432/"
        },
        {
            "@type": "Person",
            "name": "Morgan Freeman",
            "url": "/name/nm0000151/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 417919,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0010258/"
        },
        {
            "@type": "Person",
            "name": "David Webb Peoples",
            "url": "/name/nm0672459/"
        }
    ],
    "datePublished": "1992-08-07",
    "description": "Retired Old West gunslinger William Munny reluctantly takes on one last job, with the help of his old partner Ned Logan and a young man, The \"Schofield Kid.\"",
    "director": [
        {
            "@type": "Person",
            "name": "Clint Eastwood",
            "url": "/name/nm0000142/"
        }
    ],
    "duration": "PT2H10M",
    "genre": [
        "Drama",
        "Western"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODM3YWY4NmQtN2Y3Ni00OTg0LWFhZGQtZWE3ZWY4MTJlOWU4XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
    "keywords": "revenge,revisionist western,one last job,sadist,gun control",
    "name": "Unforgiven",
    "original_info": {
        "id": "Unforgiven_1992",
        "name": "Unforgiven",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "erostew"
        },
        "dateCreated": "2007-06-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0105695/"
        },
        "name": "A Fitting End",
        "reviewBody": "There may never be another real western. Clint appears to be done with the genre and there really isn't anyone else I can think of that can do it Properly. Sergio Leone is gone. William Wellman is gone. Sam Peckinpah is gone. John Huston is gone. John Ford is gone. Howard Hawks is gone.\n\nKevin Costner tries hard but he just doesn't get it. Dances With Wolves wasn't really a western. It wasn't even an anti-western. It was more like a political indictment of the actions of the Americans of the time. For all that I did enjoy it.\n\nMost of the others since Unforgiven are movies where somebody decides to put the characters on a horse, but the story is just generic pap. Nobody has the balls to make something with a meaning.\n\nI will grant that Deadwood is a truly excellent series but it isn't a movie.\n\nThat's why I believe that Unforgiven is a fitting end to the western genre. I won't get all rhapsodic and spout a bunch of crap about how Clint made this movie as a symbol of the end of the western. Cuz that's a load of crap. The script had been around since the early 70s when things were still going strong. What it is, is a movie that shows us that there is no black and white in any time. There are only shades of grey.\n\nIt is also just as dirty and violent as things actually were for most people in that era. Life was comparatively cheap and most people didn't have much hope of justice. The middle class was very small and the upper class was tiny. The vast majority belonged to the under-classes.\n\nGood guys didn't wear white hats and not every sheriff was a good guy. Some were violent and corrupt braggarts and bullies. Little Bill mocks English Bob's self-promotion, but at the same time he knocks Bob down he builds himself up. He doesn't bother with courts or judges and he is his own executioner. He isn't motivated by any innate sense of justice when he deals with any criminal elements. It's more that he takes it as an insult to his own power.\n\nWilliam Munny is a killer, plain and simple. He has human feelings but basically he is unrepentant. He changed for his wife, but like many changes it wasn't permanent. He won't sleep with a whore but when he needs money he is willing to kill for it. At the same time he treats the whore with kindness and is loyal to his friend. And somehow he managed to get a good woman to love him. A classic anti-hero.\n\nRather than being about the end of the Western genre I believe that it is actually an ode to what came before it. Sergio Leone would have been proud.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M37S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3445406489",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTRmNmQ1ZDQtNWJjZC00ZWFiLWE3OGEtNTQwMjVkMmRjNjYyXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTRmNmQ1ZDQtNWJjZC00ZWFiLWE3OGEtNTQwMjVkMmRjNjYyXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg",
        "uploadDate": "2018-09-14T22:40:44.440Z",
        "url": "https://www.imdb.com/video/vi3445406489/"
    },
    "url": "/title/tt0105695/"
}