{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Gena Rowlands",
            "url": "/name/nm0001687/"
        },
        {
            "@type": "Person",
            "name": "Marisa Tomei",
            "url": "/name/nm0000673/"
        },
        {
            "@type": "Person",
            "name": "Gérard Depardieu",
            "url": "/name/nm0000367/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2285,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0065791/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0047847/"
        },
        {
            "@type": "Person",
            "name": "Helen Caldwell",
            "url": "/name/nm0129724/"
        },
        {
            "@type": "Person",
            "name": "Nick Cassavetes",
            "url": "/name/nm0001024/"
        }
    ],
    "datePublished": "1997-02-14",
    "description": "After her abusive husband leaves, Monica asks her neighbor to look after her son while she's at work. Mildred's angry daughter's just moved out, so she's happy to have JJ.",
    "director": [
        {
            "@type": "Person",
            "name": "Nick Cassavetes",
            "url": "/name/nm0001024/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDc3ZjNjY2UtODhiMi00NjgyLTg5OTMtMDkwNDA2OGMwOWJhXkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "female protagonist,neighbor,san francisco california,friendship,dysfunctional family",
    "name": "Unhook the Stars",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jotix100"
        },
        "dateCreated": "2005-04-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118044/"
        },
        "name": "Unlikely neighbors",
        "reviewBody": "\"Unhook the stars\" marked the directorial film debut of Nick Casavettes, the son of the immensely talented John Casavettes and Gena Rowlands. This is clearly the director's homage to his beautiful mother, which probably was the reason this film was made. The screen play by the director and Helen Caldwell, doesn't translate to a good film, as we watch the finished product. Mr. Casavettes' heart is in the right place, but the movie, as written, doesn't make much sense.\n\nFirst of all, one wonders where Mildred went wrong. Her daughter Annie is a mess. Her son, the yuppie, lives in his own material world. We would like to think Mildred and her late husband created a nice environment for these two children. They both turned out to be losers in their own right.\n\nMildred's neighbors don't belong in her neighborhood. One wonders how the probably low wage earner, Monica, can live across the street from Mildred's better than average home. A lady like Mildred would probably have told Monica off from the beginning. The way Monica curses in every sentence would have been a turn off factor for Mildred. Of course, we know she goes along because suddenly she has found the sweet little J.J. that Monica dumps on her.\n\nMonica and Mildred live in two different worlds and it's hard for us to accept their situation because Monica shows no redeeming qualities, except the love for her son. Mildred, on the other hand, doesn't have a clue about how to reach out for her daughter. The only positive thing Mildred does is to sell the house and go into a new life. Miami in her future? The other thing that doesn't make sense is to watch the elegant Mildred going to the dive where Monica takes her to drink. Big Tommy's interest in her, while it might be sexual, is not fully realized either because they stick out like oil and vinegar. There is no chemistry between Mildred and this big French Canadian guy.\n\nGena Rowlands does an excellent job as Mildred. She is always serene and composed. That's why Marisa Tomei over acting, the way she does, looks completely out of place, next to Mildred. Jake Lloyd is sweet and not bratty as J.J., the boy who loves Mildred until his father comes back home. Moira Kelly's Annie is an enigma. David Sherrill and Bridgette Wilson play Mildred's son and daughter-in-law. Poor Gerard Depardieu, a great star in his native France, doesn't have a thing to show for himself. M. Depardieu should choose more carefully his future films in America!\n\nWith the exception of \"She's so Lovely\", which reminded us more of his father's influence, and \"John Q\", Nick Casavettes hasn't made a name for himself as of yet. It would be a great help for Mr. Casavettes to study his father's films, then, perhaps, he would find an inspiration for directing more movies that will showcase his talent. This one, or \"The Notebook\", alas, don't help him at all.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0118044/"
}