{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jean-Claude Van Damme",
            "url": "/name/nm0000241/"
        },
        {
            "@type": "Person",
            "name": "Dolph Lundgren",
            "url": "/name/nm0000185/"
        },
        {
            "@type": "Person",
            "name": "Ally Walker",
            "url": "/name/nm0001824/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 92236,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0047476/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0094459/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0149490/"
        },
        {
            "@type": "Person",
            "name": "Richard Rothstein",
            "url": "/name/nm0745330/"
        },
        {
            "@type": "Person",
            "name": "Christopher Leitch",
            "url": "/name/nm0500609/"
        },
        {
            "@type": "Person",
            "name": "Dean Devlin",
            "url": "/name/nm0002041/"
        }
    ],
    "datePublished": "1992-07-10",
    "description": "Soldiers who were killed in the Vietnam conflict are brought back to life in a top secret military experiment that creates superhuman warriors.",
    "director": [
        {
            "@type": "Person",
            "name": "Roland Emmerich",
            "url": "/name/nm0000386/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Action",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzMyZjNiOTYtMWJkZS00M2I5LWIzYWYtOTc2ZjYzMzBhY2MwXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "soldier,reporter,scientist,super soldier,top secret",
    "name": "Universal Soldier",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Crap_Connoisseur"
        },
        "dateCreated": "2006-05-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0105698/"
        },
        "name": "Excellent Action Fluff",
        "reviewBody": "Universal Soldier might be dumb and derivative but I couldn't care less, it is also one of the most entertaining action films to be released in the 1990s and provided signature roles for two of my favourite trash icons, Jean-Claude Van Damme and Dolph Lundgren. The film also serves as a testament to the last good movie made by Roland Emmerich before selling his soul to the Hollywood machine.\n\nThis film has long been a favourite with genre fans. Universal Soldier was a theatrical box office hit but really developed its cult following on video. I watch this film every couple of years and I'm always struck by the quality of the writing, directing and yes, even the acting. This is simply a well crafted movie and an excellent example of a film that is so much more than the sum of its admittedly tawdry parts.\n\nUniversal Soldier owes a hell of a lot to \"The Terminator\". It lifts a whole raft of ideas from Cameron's action classic, including the basic concept of a good guy with superhuman strength protecting a woman from a bad guy with superhuman strength. Actually, it even borrows minor details like the eye-cam, the nude walk and an act of self-mutilation. Nevertheless, the film never feels like a blatant rip off. Roland Emmerich, while never a particularly original mind, injects sufficient change and innovation into the film to ensure it has a distinct energy of its own.\n\nThe film recycles old ideas with great skill due to the excellent screenplay. The action comes thick and fast, and the dialogue is first rate for an action film. Furthermore, it provides several memorable characters and successfully introduces an element of black humour without detracting from the action. No matter how well written it is, an action film is only as good its action sequences and Mr Emmerich does not disappoint. The film contains several fantastic set pieces, from the grandeur of the hostage rescue to the phenomenal truck chase through the desert, which even manages to find time for a mid-chase game of \"catch\" with live grenades and a string of memorably corny one-liners. Emmerich is in his element, filming explosions and stunts from every imaginable angle. Universal Soldier is also far gorier than his later films and is all the better for it.\n\nThe film would not be half as enjoyable without its leading men. Jean-Claude and Dolph both give great performances. And no, I'm not being sarcastic. Jean-Claude was at his physical peak and excels during the action scenes. He performs several signature flying kicks in a great fight with Dolph, which is mercifully filmed in a long shot - I wish the John Woo wannabes from the \"cut and paste\" school of directing who directed Jean-Claude's later films had taken note. Dolph is great fun as the villain, making crazy eyes for all he is worth and relishing every trashy one-liner. They both are more than adequate in their non-action scenes, which probably has a lot to do with the fact that they are essentially playing refined zombies who walk around naked a lot. The supporting cast is also great. Ally Walker showed a lot of promise as the female lead and has gone on to have a good career in television. Jerry Orbach and Tico Wells, also TV regulars, give memorable performances in minor roles.\n\nUniversal Soldier is relentless, the film starts with a bang and never lets up. It might be trashy, but it is never less than completely entertaining. In my opinion, this is one of the seminal action films of the 90s. The sequels, however, are only recommended for experienced crap connoisseurs."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT2M24S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3638559001",
        "name": "Universal Soldier",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGNkY2E3NDgtZTc4ZS00MWYzLTk4ZTQtYzJiMjUyZGM4NWFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGNkY2E3NDgtZTc4ZS00MWYzLTk4ZTQtYzJiMjUyZGM4NWFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:36:44Z",
        "url": "https://www.imdb.com/video/vi3638559001/"
    },
    "url": "/title/tt0105698/"
}