{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Wei Wei Zhao",
            "url": "/name/nm1234999/"
        },
        {
            "@type": "Person",
            "name": "Qiong Wu",
            "url": "/name/nm1235551/"
        },
        {
            "@type": "Person",
            "name": "Tao Zhao",
            "url": "/name/nm0955504/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2476,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "alternateName": "Unknown Pleasures",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0069174/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021023/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003706/"
        },
        {
            "@type": "Person",
            "name": "Zhangke Jia",
            "url": "/name/nm0422605/"
        }
    ],
    "datePublished": "2003-01-22",
    "description": "Two unemployed Chinese teenagers have trouble resisting the temptations of the Western world.",
    "director": [
        {
            "@type": "Person",
            "name": "Zhangke Jia",
            "url": "/name/nm0422605/"
        }
    ],
    "duration": "PT1H52M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTExMzE1MzgxODFeQTJeQWpwZ15BbWU3MDk4NTA1MjE@._V1_.jpg",
    "keywords": "youth,china,teenager,contemplative cinema,cell phone",
    "name": "Ren xiao yao",
    "original_info": {
        "id": "Unknown Pleasures_2003",
        "name": "Unknown Pleasures",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gbill-74877"
        },
        "dateCreated": "2019-10-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0318025/"
        },
        "name": "A dark film of disaffected youth",
        "reviewBody": "There isn't an ounce of joy or spark in these characters, who I'm pretty sure don't crack a single smile throughout the film. They manage to smoke a million cigarettes though. Not that there's anything to smile about, and that's the point. There is no beauty anywhere, nor is there hope. The landscape is a wasteland, the buildings are ugly or in ruins, and jobs are few. One says there is no future, and the other says that 30 years is plenty for a lifetime. Even when they're alone with women, they look forlornly off to the side or curl up in the fetal position.\n\nThis is a heavy neorealist type of film, reflecting poor parts of China that were still attempting to modernize in this time period. Who knows, as China's economic strength has continued to rise, maybe this film is already looked upon as quaint, or will be soon. American cultural references (e.g. Pulp Fiction) are known by the characters in the film, but it's from a distance, and things like the modern dance moves that have been picked up seem pretty tepid. Meanwhile, a single American dollar is viewed as quite a find, and a can of Coke is a treat. It certainly reminded me of the blessings in my life.\n\nThe scene that was most powerful for me was when the young woman who sings and dances (Zhao Tao) is trying to leave her boyfriend's company. Again and again she gets up and tries to exit, and again and again he pushes her back into her seat, and it seems such a perfect metaphor for the cycle of abuse in these kinds of relationships. Later we see he's also given her a black eye.\n\nGiven the dreary view the film shows of China, and the nihilistic attitude it takes towards the future, it was a little surprising to me that it wasn't censored more by the government. We see the power of the State on small television sets cracking down on the Falun Gong, what seems like a forced confession, and in real life when a policeman tells one of the guys that the punishment for robbing a bank is death. There is a lottery in place that may be a way of instilling a larger hope in people's minds than the infinitesimal chance of winning would justify, perhaps not unlike American lotteries. There is also a new highway project being built and great fanfare when Beijing is announced as the home of the 2008 Olympics. I guess all of these things can be viewed as in keeping with the government's interests, but in light of all the shabby surroundings and the dismal future these two guys have, they seem pretty sorrowful.\n\nThe film is meaningful and I admire director Jia Zhangke for having worked in an underground, indie type manner to produce a view of honesty and truth. I didn't rate the film higher because it's so depressing that I wouldn't want to look for it again anytime soon.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0318025/"
}