{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jet Li",
            "url": "/name/nm0001472/"
        },
        {
            "@type": "Person",
            "name": "Bob Hoskins",
            "url": "/name/nm0001364/"
        },
        {
            "@type": "Person",
            "name": "Morgan Freeman",
            "url": "/name/nm0000151/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 104833,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0123433/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0048273/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0125537/"
        },
        {
            "@type": "Person",
            "name": "Luc Besson",
            "url": "/name/nm0000108/"
        }
    ],
    "datePublished": "2005-05-13",
    "description": "A man enslaved by the mob since childhood and raised into behaving like a human attack dog escapes his captors and attempts to start a new life.",
    "director": [
        {
            "@type": "Person",
            "name": "Louis Leterrier",
            "url": "/name/nm0504642/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgwNjIyNTczMF5BMl5BanBnXkFtZTcwODI5MDkyMQ@@._V1_.jpg",
    "keywords": "piano duet,deception,ice cream cone,man removes a woman's panties,man wears a dog collar",
    "name": "Unleashed",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Scotchorama"
        },
        "dateCreated": "2005-05-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0342258/"
        },
        "name": "Drama, not an action movie",
        "reviewBody": "Unleashed is the touching story of Danny (Jet Li) who as a young boy was brought harshly by a loanshark (Bob Hoskins) and was trained to kill once his dog collar is removed. Although Danny was brought up as a dog, he is human, and through the intervention of music and the care and love of a blind piano tuner (Morgan Freeman), and his stepdaughter (Kerry Condon), Danny discovers another side of life.\n\nUnleashed is not an action movie. There certainly are some spectacular fight scenes, but the emphasis is put on the relationship between Morgan Freeman and his stepdaughter, and Jet Li, and on the development of Danny's \"humanity\". Danny yearns for more than just killing; he discovers music and is saved by it. Music also plays a key role in his self-discovery as it awakens long-lost memories of his childhood.\n\nFor the first time, the audience are treated to Jet Li's true acting capabilities. Jet Li seems genuine and earnest--perhaps this is because the actor openly acknowledges that this film is close to his heart: as a Buddhist, Jet Li is against violence, and this film portrays the fight between humanity and violence.\n\nThis drama is a surprising break from usual martial arts movies. The fact that the number of action scenes is limited is counter-balanced by Yuen Wo Ping's masterful choreography; do not expect a fight-fest. Do however expect an unpretentious touching story featuring good actors with a few spectacular action scenes.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0342258/"
}