{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Isaac Mizrahi",
            "url": "/name/nm0594617/"
        },
        {
            "@type": "Person",
            "name": "Roseanne Barr",
            "url": "/name/nm0001683/"
        },
        {
            "@type": "Person",
            "name": "Sandra Bernhard",
            "url": "/name/nm0000928/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1159,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0091399/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022594/"
        }
    ],
    "datePublished": "1995-08-11",
    "description": "One of the most successful designers in high fashion plans his fall 1994 collection. Follow the behind-the-scenes look at the creative side of fashion.",
    "director": [
        {
            "@type": "Person",
            "name": "Douglas Keeve",
            "url": "/name/nm0444857/"
        }
    ],
    "duration": "PT1H13M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjU0NzFiNTgtNWNhMS00MWIzLWFiMDMtMDQ1ODZjZDAyN2VhL2ltYWdlXkEyXkFqcGdeQXVyMjM5NDQzNTk@._V1_.jpg",
    "keywords": "fashion show,supermodel,female rear nudity,dressing room,black british",
    "name": "Unzipped",
    "original_info": {
        "id": "Unzipped_1995",
        "name": "Unzipped",
        "year": "1995"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ar-imdb"
        },
        "dateCreated": "2006-01-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0114805/"
        },
        "name": "a wonderful look into the creative process. and Isaac is a hoot to boot!",
        "reviewBody": "OK - so i decided to rent this because i get such a kick out of watching Isaac on his show. he's so funny and witty and entertaining - he could be that proverbial entertaining phone-book- reader. but the thing about this movie that is really so great and wonderful is not the \"insider's look into the fashion world\" or the \"glimpses of stunning supermodels\" or whatever - but rather the fact that this movie documents something rarely shown: how the creative process works, from the initial idea or spark, where it comes from and how it's developed (for Isaac - from movies and music - anything in the culture - and then he starts drawing and chatting about his ideas with family, friends and colleagues to develop it), all the way to making that idea into something tangible and concrete (and really, what i appreciate about what the movie shows, is how such a seemingly abstract or novel \"idea\" can be developed into an entire fashion collection). i study architecture, and the parallels are absolutely there for anyone in any creative or design field. i gave it a 9 out of 10 only because i wish it had been longer. PLUS another benefit of the movie: you get to see/hear Isaac play the piano. so fun. and his mother is a hoot! plus i really loved seeing a few of the really great style arbiters - Polly Mellen, Candy Pratts, Ingrid Sischy - on film. wish Andre Leon Talley had said more. and it was so fun to see mark morris and Sandra Bernhardt too! all in all a fabulous film for anyone in or interested in the creative and design fields.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0114805/"
}