{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Redford",
            "url": "/name/nm0000602/"
        },
        {
            "@type": "Person",
            "name": "Michelle Pfeiffer",
            "url": "/name/nm0000201/"
        },
        {
            "@type": "Person",
            "name": "Stockard Channing",
            "url": "/name/nm0000330/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 14881,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049348/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0094483/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006702/"
        },
        {
            "@type": "Person",
            "name": "Joan Didion",
            "url": "/name/nm0225820/"
        },
        {
            "@type": "Person",
            "name": "John Gregory Dunne",
            "url": "/name/nm0242869/"
        },
        {
            "@type": "Person",
            "name": "Alanna Nash",
            "url": "/name/nm1086191/"
        }
    ],
    "datePublished": "1996-03-01",
    "description": "An ambitious young woman, determined to build a career in television journalism, gets good advice from her first boss, and they fall in love.",
    "director": [
        {
            "@type": "Person",
            "name": "Jon Avnet",
            "url": "/name/nm0000816/"
        }
    ],
    "duration": "PT2H4M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTZjYmNkZTYtOTA0Zi00NDcyLWI2YzQtOTgyZjQ2YzM5Y2E2XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "mentor protege relationship,journalism,tv news,television broadcast,television network",
    "name": "Up Close & Personal",
    "original_info": {
        "id": "Up Close & Personal_1996",
        "name": "Up Close & Personal",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Movie-12"
        },
        "dateCreated": "1999-12-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118055/"
        },
        "name": "Great romantic chemistry between Robert Redford and Michelle Pfeiffer. *** out of ****",
        "reviewBody": "Director: Jon Avnet Running Time: 124 minutes Rated PG-13 (for some sensuality, language, and brief violence)\n\n\"Up Close & Personal\" is one hundred percent a chick flick-but it is an effective one. With his new romantic drama director Jon Avnet has created a relevant, realistic, interesting behind-the-scenes look at news broadcasting, relationships, and journalism.\n\nThe story centers on a young energetic woman, named Sally Atwater, who, in desperation to find the job of her dreams, sends an application to be a television newscaster and work with the biggest names in the business. One of them is Warren Justice, played cleverly by Robert Redford, who lives an opposite life from the clumsy, tactless, and silly Sally. Of course she gets the job, falls in love with Warren, and experiences difficulties with her occupation as well as romance.\n\nThe film's first act is near perfect: it introduces the characters and guidelines, exactly what a good first act is supposed to do. We initially meet an opportunity starving underdog, the external conflict, then move on the romantic complications in the second act, the internal conflict. The second act also provides the gradual increase in romantic chemistry; for once we don't have a typical love at first sight story. Both problems are eventually resolved efficiently, but getting there is what contains the original felling.\n\nWhat makes the characters so relateable in \"Up Close & Personal\" is the people who they are. Sally is a down-to-earth human being, blooming with cute charm and amiable qualities. She isn't presented as a glamorous, high stakes, important individual, but completely the opposite--perhaps a little too underdogish at times. Warren provides us with a stern opposite to Sally, forming tension. Their slow character development is totally appropriate, as well as effective, here.\n\nThe leading characters are played delicately by Robert Redford and Michelle Pfeiffer; the right choice for each. Both pay special attention to the nitty gritty details within the characters. They are very careful not too overdue their characters and subdue the audience. This is not a deep picture, although the closing may catch a few unexpected viewers weeping, it's a light hearted, evenly presented, well-plotted romantic comedy-the filmmakers don't often pretend otherwise.\n\n\"Up Close & Personal\" is not your typical love story. It is not slow moving, but full of colorful characters, interesting situations, focused point of views, and a suave atmosphere. It is a romantic comedy worth the watch time and your money.\n\nBrought to you by Touchstone Pictures.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "An ambitious young woman, determined to build a career in television journalism, gets good advice from her first boss, and they fall in love.",
        "duration": "PT2M37S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi217629465",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzk4ZmIxNzgtNjgyMy00ZDBlLThjNWMtN2IwNjAzODA2OTAwXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzk4ZmIxNzgtNjgyMy00ZDBlLThjNWMtN2IwNjAzODA2OTAwXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-11-04T16:22:52.921Z",
        "url": "https://www.imdb.com/video/vi217629465/"
    },
    "url": "/title/tt0118055/"
}