{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fumi Hirano",
            "url": "/name/nm0386249/"
        },
        {
            "@type": "Person",
            "name": "Toshio Furukawa",
            "url": "/name/nm0299192/"
        },
        {
            "@type": "Person",
            "name": "Akira Kamiya",
            "url": "/name/nm0436776/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2071,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "Urusei Yatsura 2: Beautiful Dreamer",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0067065/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0106793/"
        },
        {
            "@type": "Person",
            "name": "Mamoru Oshii",
            "url": "/name/nm0651900/"
        },
        {
            "@type": "Person",
            "name": "Rumiko Takahashi",
            "url": "/name/nm0847186/"
        }
    ],
    "datePublished": "1984-02-11",
    "description": "The night before the school festival, things seem to be repeating themselves. Gradually, all the world functions come to a stop, the only ones that are not affected are a select group of student friends.",
    "director": [
        {
            "@type": "Person",
            "name": "Mamoru Oshii",
            "url": "/name/nm0651900/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Animation",
        "Adventure",
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDZmZWQ3NmEtZTJhZi00NDdkLWJhNzktZjU1NjRlMDQzODdlXkEyXkFqcGdeQXVyMTA3OTEyODI1._V1_.jpg",
    "keywords": "nazi,swastika,dreams vs reality,teacher,philosophical conversation",
    "name": "Urusei Yatsura 2: Byûtifuru dorîmâ",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Aaron1375"
        },
        "dateCreated": "2010-04-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0088334/"
        },
        "name": "Kind of a strange comedy anime with odd twists here and there.",
        "reviewBody": "There are apparently other movies in this series as this is the second. However, I never saw the one that came before this one or any of those that may have come after. So I have to say right off the bat a lot of the story was kind of left off when I watched this one on the syfy channel when it did not have the stupid name. In spite of the fact I did miss a few things by not seeing the first one I still rather enjoyed this one. The main things I was missing was most likely an introduction to the characters, but this did not deter from this movie all that much. I mean it would have been nice to see how the characters got to know each other and it would have been nice to see the strange girl's origin story, but I rolled with it and enjoyed the film. It reminded me a bit of Tenchi Muyo, only it was less strange than that show in some areas and actually more strange in other areas. The story has these kids at a high school getting ready for some sort of school festival in which they decorate a room in some sort of theme. The main group that is followed in this one has a room that is sort of a café with a twist in that a tank is in the room. No one seems to know how the tank got there though and that is your first clue that all is not as it appears. Like I said one of the girls is an alien who is infatuated with this boy and she refers to him as Darling. She has bizarre powers, but they are not really all that important to this particular story. I am guessing she played more of an important role in the first movie in the series. Well it is not to long before stuff gets stranger and stranger and you soon find out why things are a bit strange. Along the way you get a lot of humor as the film is mostly a comedy with some mystery thrown in to keep you guessing. The characters were fun and colorful and I liked the school setting, I am a bit surprised by how old this one is as when I first saw it I would have guessed it was most likely a 1992 or later released film. The film though is not perfect, part of it is that one is a tad lost if you had not seen the previous movie, which they for some reason never showed on syfy, and the ending is a bit anti-climatic, I was expecting something more for the ending. Still, overall it was really enjoyable and funny thanks mainly to the colorful characters.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0088334/"
}