{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fumi Hirano",
            "url": "/name/nm0386249/"
        },
        {
            "@type": "Person",
            "name": "Toshio Furukawa",
            "url": "/name/nm0299192/"
        },
        {
            "@type": "Person",
            "name": "Akira Kamiya",
            "url": "/name/nm0436776/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 375,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "alternateName": "Urusei Yatsura 3: Remember My Love",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0067065/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0036168/"
        },
        {
            "@type": "Person",
            "name": "Rumiko Takahashi",
            "url": "/name/nm0847186/"
        },
        {
            "@type": "Person",
            "name": "Tomoko Konparu",
            "url": "/name/nm0437498/"
        }
    ],
    "datePublished": "1985-01-26",
    "description": "A curse placed on Lum as an infant manifests itself in the present day, causing her to be taken to another dimension. Lum's husband, Ataru Moroboshi is turned into a hippo, and attempts to find Lum with the help of her friends.",
    "director": [
        {
            "@type": "Person",
            "name": "Kazuo Yamazaki",
            "url": "/name/nm0945703/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Animation",
        "Comedy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGU2Y2M1MWItZWZiMS00NGY3LTljYzctYWJjYmJmZWJhODNkXkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg",
    "keywords": "string,rabbit,slapstick comedy,1980s,anime animation",
    "name": "Urusei Yatsura 3: Rimenbâ mai rabu",
    "original_info": {
        "id": "Urusei Yatsura Movie 3: Remember My Love_1985",
        "name": "Urusei Yatsura Movie 3: Remember My Love",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrianDanaCamp"
        },
        "dateCreated": "2010-12-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0090244/"
        },
        "name": "3rd Urusei Yatsura movie has its charmsand flaws",
        "reviewBody": "Urusei Yatsura Movie 3: \"Remember My Love\" (1985) is the third movie spun off from the popular animated series, \"Urusei Yatsura\" (Those Obnoxious Aliens), which premiered in Japan in 1981 and was based on a manga by Rumiko Takahashi (Ranma ½). The first two UY movies were directed by Mamoru Oshii and were classics in their own right. Directed by Kazuo Yamazaki, \"Remember My Love\" aims for the dreamlike, otherworldly feel of UY Movie 2: \"Beautiful Dreamer,\" and achieves it for roughly the first hour, but then narrative problems undermine the carefully created atmosphere. Important characters are ignored for too long and the story loses steam before the end. Still, there is much for anime fans to savor in it.\n\nThe plot is rather complicated to explain. It all has to do with a glass orb containing a curse meant for Lum, the tiger-skin-bikini'd alien \"wife\" of high school boy Ataru, that was sent in the mail sometime in the past and received far in the future by a lonely soul who then embarks on some time traveling into Lum's past and becomes obsessed with her. To make a long, convoluted story short, the jealous time traveler turns Ataru into a pink hippo and lures Lum into another dimension, trapping her there. Lum's alien friends go on the hunt and comb the galaxy for clues but give up when the trail gets cold.\n\nThere are some poignant dramatic moments on Earth as we see Lum's high school friends abandon their normal lunatic antics and find themselves sitting around listlessly after Lum has vanished. Their affection for her is sweet and their feelings of emptiness after she's gone lend an air of melancholy to the proceedings. Unfortunately, Ataru's situation is resolved—off-screen--without warning or explanation, making the rest of the story almost anti-climactic. The time traveler himself is not a terribly interesting antagonist and a new character, Miss Lahla, is contrived near the end to help set things right. The whole thing would have been much more compelling if more of the main cast had been involved in the final stages of the action. There's a sappy love montage that tries our patience as it shows Lum and Ataru through the ages—as butterflies, dinosaurs and seabirds going through an awkward mating process—accompanied by the insipid English-language title song, recorded by someone identified as Steffanie Borges. Ten minutes later, the same song is played over the closing credits as well. (The opening song, \"Born to Be Free\" is also in English and also sung by Miss Borges.) \n\nThere are still plenty of reasons for fans of anime in general and UY in particular to seek this out. The opening scenes offer a host of imaginative fantasy imagery as a mysterious theme park, Tomobiki Fairyland, opens in town and attracts the entire cast. Weird creatures abound, prompting Ataru's apprehensive classmate Chibi to reassure himself, \"They're just robotsaren't they?!\" The time traveler, Ruu, appears first as a creepy clown and then as a masked magician (looking forward to Sailor Moon's Tuxedo Mask), before we see his true form midway through the film. The major characters all get play during the early stages of the story. Sakura, the school nurse/resident shaman, has some good scenes, including one where she and Uncle Cherry make repeated attempts to enter Fairyland, but are blocked in a clever way by a barrier keeping out the supernaturally sensitive. We get to see Lum's attractive alien friends, Ran, Benten, and Oyuki, participate in the action, all with their own spaceships. More importantly, we get some very cute flashbacks of Lum as an infant and a little girl.\n\nI had a good time watching it but was disappointed by the way it dragged in parts and the weak resolution. It's not nearly as good as \"Only You\" (1983) or \"Beautiful Dreamer\" (1984), the first two UY movies, but those were directed by Oshii, one of anime's acknowledged geniuses (best known for the Patlabor and Ghost In The Shell movies), while this movie's director, Kazuo Yamazaki (Slayers: The Motion Picture, A Wind Named Amnesia), is more of a competent, though talented, workhorse."
    },
    "url": "/title/tt0090244/"
}