{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Denise Richards",
            "url": "/name/nm0000612/"
        },
        {
            "@type": "Person",
            "name": "David Boreanaz",
            "url": "/name/nm0004770/"
        },
        {
            "@type": "Person",
            "name": "Marley Shelton",
            "url": "/name/nm0005420/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 29136,
        "ratingValue": 4.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0108864/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0024939/"
        },
        {
            "@type": "Person",
            "name": "Tom Savage",
            "url": "/name/nm0767393/"
        },
        {
            "@type": "Person",
            "name": "Donna Powers",
            "url": "/name/nm0694526/"
        },
        {
            "@type": "Person",
            "name": "Wayne Powers",
            "url": "/name/nm0694638/"
        }
    ],
    "datePublished": "2001-02-02",
    "description": "Five women are stalked by an unknown assailant while preparing for Valentine's Day.",
    "director": [
        {
            "@type": "Person",
            "name": "Jamie Blanks",
            "url": "/name/nm0087595/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWQxM2JjNTktYWE4Ni00YmZiLWFlNDEtMWYzMmI4N2NhYjk4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "valentine's day,revenge,nosebleed,valentine,public humiliation",
    "name": "Valentine",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "baumer"
        },
        "dateCreated": "2001-02-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0242998/"
        },
        "name": "almost good.... naaa, still quite bad",
        "reviewBody": "Valentine has a great premise. It takes all that Halloween stood for and tries to update it. It fails of course, but you have to give it full marks for trying. Where as a lot of films try to be original and fail at that as well, at least you can say that there is a masked killer in this film, he is incredibly strong, he walks and still catches his victims as they run and he finds original and quite disgusting ways of disposing of his victims. So I give the film credit for trying. But like most other films that have tried to follow in Screams footsteps, it does fail quite miserably.\n\nValentine is a story about a geeky kid that just wants to be accepted in the sixth grade. He is at a dance and asks all the pretty girls to dance and they all say no. Some of them are disgustingly mean to him and tell him that they would rather be boiled alive than to dance with him ( guess how that character dies? ). Then one heavy set girl decides she will make out with him and then when all the popular guys catch her doing it, she says that he forced himself on her and they beat the tar out of him and he is sent to reform school. That is the beginning and it is well done. It sets up the killer on the loose with a revenge plot quite nicely. We of course skip ahead about 15 years and we have beautiful women in college lined up to be slaughtered. The opening death is extremely laughable but has its moments of nice touches and subtle homages to films like Halloween. It is worth mentioning how the first woman is killed because it is a lesson in horror mythology of all the wrong things to do to attract a killer on the loose on a college campus.\n\nA young woman just comes back from a disasterous date and decides that she is going to go do an autopsy at 11 o clock at night. Then to top it off, she is wearing a flimsy tank top, has large breasts and she decides to keep the lights off in the autopsy room, because, well you know, you don't need light to disect a human being. I started to ask myself why she was allowed to disect a corpse with no supervision this late and with no lights on seeing as she was only a med student. Horror movies are always filled with silly situations ( Friday the 13th's, no one wipes after they are finished in the bathroom, people always go to investigate noises and so on ) but this is one of the sillier ones. Then when she is grabbed by the corpse, instead of leaving, she stays in the room to see who it is. And then when the things chases her, she doesn't go for the door, she tries to hide in the other rooms. DUMB! DUMB! DUMB!\n\nFiguring out who the killer is is fun, I must admit and they do a good job of concealing his identity until the end so you have to give it credit for that as well. But this is not really a scary film and it is not even a well done film. It had it's moments but when it leaves the theater, no one will really remember anything about it. Nothing really jumps out at you. I think Jamie Blanks has an idea of what it takes to scare an audience, he has probably tried to emulate many of the greats like Raimi, Hitchcock and Carpenter, but he can't quite seem to hit the perfect note. Maybe if he keeps trying he will get it because there are scenes in here that are close to perfection but then they end too abruptly or without the proper pay off. That is what made Halloween so elusive in it's brilliance. The pay off was so horrific and so perfect that to try to duplicate it is almost unfathomable. Valentine comes close but ultimately fails.\n\nThis is not as bad as some horror out there but it is not in the same league as some of the new horror films that have made audiences embrace horror again. Sixth Sense, Blair Witch, Stir Of Echoes, The Gift are all pretty good films. Valentine is on the brink.\n\n6 out of 10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Warner Bros. Pictures",
        "duration": "PT44S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3254386969",
        "name": "Valentine",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2QzNWMwZWQtMWRlZi00ZjU0LTlkNTQtZWQxZmRmMGM4ZTU4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2QzNWMwZWQtMWRlZi00ZjU0LTlkNTQtZWQxZmRmMGM4ZTU4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:13:33Z",
        "url": "https://www.imdb.com/video/vi3254386969/"
    },
    "url": "/title/tt0242998/"
}