{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Colin Firth",
            "url": "/name/nm0000147/"
        },
        {
            "@type": "Person",
            "name": "Annette Bening",
            "url": "/name/nm0000906/"
        },
        {
            "@type": "Person",
            "name": "Meg Tilly",
            "url": "/name/nm0000672/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 13826,
        "ratingValue": 7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0067540/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0039678/"
        },
        {
            "@type": "Person",
            "name": "Choderlos de Laclos",
            "url": "/name/nm0480166/"
        },
        {
            "@type": "Person",
            "name": "Jean-Claude Carrière",
            "url": "/name/nm0140643/"
        },
        {
            "@type": "Person",
            "name": "Milos Forman",
            "url": "/name/nm0001232/"
        }
    ],
    "datePublished": "1989-11-17",
    "description": "France before 1789: When a widow hears that her lover is to marry her cousin's daughter, she asks the playboy Valmont to take the girl's virginity. But first she bets him, with her body as prize, to seduce a virtuous, young, marri...",
    "director": [
        {
            "@type": "Person",
            "name": "Milos Forman",
            "url": "/name/nm0001232/"
        }
    ],
    "duration": "PT2H17M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjU3Nzk0NTAyNl5BMl5BanBnXkFtZTcwMzIwMzc3NA@@._V1_.jpg",
    "keywords": "virgin,sex scene,corruption,pretending to drown,manipulative woman",
    "name": "Valmont",
    "original_info": {
        "id": "Valmont_1989",
        "name": "Valmont",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Chrysanthepop"
        },
        "dateCreated": "2010-05-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0098575/"
        },
        "name": "'You are confusing bets and marriages, madame. One must always honor a bet'",
        "reviewBody": "'Valmont' was overshadowed by the popularity of 'Dangerous Liaisons' which released just about a year before. Both movies were based on the same novel. It has been too long since I last watched 'Dangerous Liaisons'. I remember the ending being slightly different and the acting a little more dramatic.\n\n'Valmont' solidly makes its own stand. Milos Forman gives it a slightly larger than life look with the colourful lavish sets and exquisite costumes but he balances it wonderfully with the actors' subtle performances, a beautiful soundtrack and stunning cinematography.\n\nForman tells the story very well. Even though I had a vague idea of what it was about, I liked Forman's presentation and he still managed to surprise me a few times. 'Valmont' brings forth some strong themes, such as that of love, seduction, lust, sexuality, marriage, chastity, monogamy and envy. All themes are brilliantly incorporated into the story and characters. Additionally , the viewer delightfully benefits from some splendid lines, especially the dialogue delivered between Annette Bening and Colin Firth. Their sequences along with the one where a soaking wet Meg Tilly asks Valmont to love her and a dance number where Valmont dances with four women are some of the most memorable movie moments.\n\nNeedless to say, each and every one of the performances are first rate. I couldn't picture anyone else other than Colin Firth in Valmont's shoes. He plays the part naturally, fitting it like a comfortable glove. Annette Bening is delightful as the playfully wicked baroness. Meg Tilly is wonderful as Tourvel. Fairuza Balk is a great choice as she possesses the innocence, naivety and youthfulness of Cecile.\n\nValmont is definitely not your average costume drama. While it tells an engaging story on human relationships, it raises some interesting questions on the aforementioned themes, questions that hold strongly relevant for today's world too. It's a stunning cinematic piece."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4294574361",
        "name": "Valmont",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmMwOGFmZWEtY2YwZS00MTEwLWE5YzUtMjYxNWUxMjA3M2VmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmMwOGFmZWEtY2YwZS00MTEwLWE5YzUtMjYxNWUxMjA3M2VmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:13:45Z",
        "url": "https://www.imdb.com/video/vi4294574361/"
    },
    "url": "/title/tt0098575/"
}