{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Frank González",
            "url": "/name/nm1565160/"
        },
        {
            "@type": "Person",
            "name": "Manuel Marín",
            "url": "/name/nm1565197/"
        },
        {
            "@type": "Person",
            "name": "Irela Bravo",
            "url": "/name/nm0106083/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1395,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "Vampires in Havana",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0577936/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0006369/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0064682/"
        },
        {
            "@type": "Person",
            "name": "Ernesto Padrón",
            "url": "/name/nm0655867/"
        },
        {
            "@type": "Person",
            "name": "Juan Padrón",
            "url": "/name/nm0655870/"
        }
    ],
    "description": "A vampire family from Cuba is preparing for a showdown between the USA vampires and the Eastern European vampires. But with the aid of a scientist, they need a type of vaccination where they can live in daylight.",
    "director": [
        {
            "@type": "Person",
            "name": "Juan Padrón",
            "url": "/name/nm0655870/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Animation",
        "Comedy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYxMzcxODYzM15BMl5BanBnXkFtZTgwODI0NjIzMTE@._V1_.jpg",
    "keywords": "seduction,panties,negligee,bra removing,nudity",
    "name": "¡Vampiros en La Habana!",
    "original_info": {
        "id": "Vampires in Havana_1987",
        "name": "Vampires in Havana",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mathfreak87"
        },
        "dateCreated": "2006-11-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0090249/"
        },
        "name": "Good Movie",
        "reviewBody": "Vampiros en la Habana is a film directed by Juan Padron. Padron was born on January 29th, 1947 in Matanzas, Cuba. He studied art history in the University of Havana, and started working as a photographer for FAR (Fuerzas Aereas Revolucionarias). He also worked with the worldwide known Argentinean writer Quino. But it wasn't until 1985 that he made his most famous work: Vampires in Havana. This movie entails a story of vampires caught up in the Cuban revolution of the 1930's. Von Dracula, a mad scientist residing in Havana, Cuba, found a cure for vampires and enabled them to be under the sunlight with no worries of diminishing into the atmosphere. This new formula was later called Vampisol. When vampire leaders from Europe, with primary location in Düsseldorf, heard the news, they wanted to get a hold of the formula so they could sell it and make profit out of it, as opposed to Von Dracula, who wanted to announce how to make the drink, free of charge, through radio vampire. Vampires from United States, with Johnny Terrori as leader, had a business of making underground beaches for vampires all over the United States, and wanted to extend their empire to Düsseldorf. The problem laid in the fact that Johnny Terrori could not let vampires from Europe to get a hold of the formula, or else he and his group would go bankrupt. Von Dracula's nephew Joseph, also known as Pepito (the movie's protagonist), was found fighting in the battle between vampires from Europe and United States. He was also complotting against the governmental procedures of General Machado. Pepito's heart belonged to Lola's hands, who helped Pepito and his friends by spying inside the house of the Captain, which worked for General Machado and made sure that everything went with the flow of democracy. This movie reflects, in specific scenes, how Padron felt about the democratic oppression on the Cuban citizens from the government. By watching the movie, it can be deduced that Padron was against the tyranny and for the revolution. He showed his biased preference over political ideas. Throughout the film, cops and, basically anything that has to do with the government, is depicted as negative. The vulgarity of the Captain; he, as a leader, should have portrayed himself as an educated individual who respects everyone. On the other hand, the Captain treated his subordinates like the inside of an empty cup; the detective who was spying for him (the little guy with the mustache), was blamed by the Captain to have been plotting against democracy along with Pepito, when the only thing he did was work diligently on catching revolutionists. When the Captain caught his wife cheating on him with Pepito, his first reaction was to hit her and tell her that he hated her, and one should never lay a finger on a woman no matter what. Another scene in the movie, was at the bar, after Pepito and his friends had stolen the papers from the Captain's house. The Captain' wife smiled at him and he put his arm up as if he was going to hit her. Padron also showed a really strong comment about the way he felt towards the cops back then; he shows a scene where Pepito comes out of the bar and asks a cop on a motorcycle to get up and leave and, without hesitation, the cop runs scared from him saying \"arriba la revolucion, abajo con el tirano.\" I believe that Padron tried to emphasize that even Machado's own military and cops were tired of him and were also scared for their life. Padron's concept of revolution against Machado was also represented with Pepito's friends. Even though their names are not revealed throughout the whole movie, they play a very important part in the movie, literally and symbolically. Literally, they aid Pepito by protecting him from the police and by taking care of Lola; they also are the ones that planned the robbery of the safe. Within the movie, they are just Pepito's friends, but symbolically they represent something far deeper. The three friends come from the three socio-economic levels: lower, middle and high class. I think Padron emphasized the fact that everyone in the country, not just the poor, was against democracy. \n\nDario Zambrano",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0090249/"
}