{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Carroll Jr.",
            "url": "/name/nm1667106/"
        },
        {
            "@type": "Person",
            "name": "Malik Burke",
            "url": "/name/nm1665064/"
        },
        {
            "@type": "Person",
            "name": "Lila Blake Palmer",
            "url": "/name/nm1665790/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 286,
        "ratingValue": 1.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0134227/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0129219/"
        },
        {
            "@type": "Person",
            "name": "Zachary Snygg",
            "url": "/name/nm0045256/"
        }
    ],
    "datePublished": "2004-09-21",
    "description": "A hip-hop, ex-con returns to his former neighborhood and must team up with a group of vampire hunter-killers to rid the area of vampires whom have taken over the area.",
    "director": [
        {
            "@type": "Person",
            "name": "Zachary Snygg",
            "url": "/name/nm0045256/"
        }
    ],
    "duration": "PT1H23M",
    "genre": [
        "Crime",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2I2MjNiN2UtZWJlZC00ODA2LWIyNDQtNzY1MmFiODMxZDE2XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "new york city,vampire,one word title,new york,gangster",
    "name": "Vampiyaz",
    "original_info": {
        "id": "Vampiyaz_2004",
        "name": "Vampiyaz",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "stufff11"
        },
        "dateCreated": "2004-10-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0415348/"
        },
        "name": "One of the worst movies I have ever seen",
        "reviewBody": "I rented this because the title and box art just screamed \"bad movie\" and I was not disappointed. \n\nFor blood effects, I noticed a wide variety of food products, including strawberry jam, red kool aid, and katsup. Gun shot effects, as the previous user put it, look as though they were made by poking holes through the film. Vampire are people with plastic vampire teeth. This movie looks like it was made with a camcorder, they can't keep the camera from wobbling and it's enough to make you feel sick.\n\nActing is absolutely horrible. Dialogue probably wasn't scripted, but improved... badly. People screw up their lines and the camera keeps rolling as they repeat them two or three times until they get it right. In dialogue scenes outside where they cut back and forth between two people's faces while they talk, the background noise is different each time and there is a delay before each person talks so you can tell the conversation is segmented.\n\nThere is a lot of completely random crap throw in, a guy eating a fly, a guy stirring up a bowl of blood (katsup) with a rubber severed hand and licking the blood (katsup) off the rubber fingers. \n\nThere is a Deus ex machina every five minutes. Amulet that makes vampires invincible. Vampire killing task force. The main character is really good at cracking safes, and it just so happens that everyone in town uses the same exact safe. \n\nI can't list everything that was wrong with this film, because the entire film was just a complete disaster. If you love the art of bad film as much as I do, you'll love this one; rent it with friends. No nudity though, which is a shame because there were a couple really cute girls. This was in my top 5 list of the worst movies I've ever seen. I hope they make a sequel.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "url": "/title/tt0415348/"
}