{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kaneto Shiozawa",
            "url": "/name/nm0794060/"
        },
        {
            "@type": "Person",
            "name": "Michie Tomizawa",
            "url": "/name/nm0593911/"
        },
        {
            "@type": "Person",
            "name": "Seizô Katô",
            "url": "/name/nm0441975/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 16404,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "alternateName": "Vampire Hunter D",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0059143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0064922/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0088857/"
        },
        {
            "@type": "Person",
            "name": "Hideyuki Kikuchi",
            "url": "/name/nm0452837/"
        },
        {
            "@type": "Person",
            "name": "Yasushi Hirano",
            "url": "/name/nm0386259/"
        }
    ],
    "datePublished": "1993-03-26",
    "description": "When Doris Lang is chosen as the next bride for the vampire Count Magnus Lee, she will hire a mysterious vampire hunter known only as D in an attempt to escape her ill-gotten fate.",
    "director": [
        {
            "@type": "Person",
            "name": "Toyoo Ashida",
            "url": "/name/nm0038953/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Animation",
        "Action",
        "Fantasy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDk3ZDEzYTQtZjg1NC00NTkwLTkyZWQtNDg1NDRlYWRhMmI3XkEyXkFqcGdeQXVyMTA0MTM5NjI2._V1_.jpg",
    "keywords": "vampire,vampire hunter,dark hero,half human,male dhampir",
    "name": "Kyûketsuki hantâ D",
    "original_info": {
        "id": "Vampire Hunter D_1985",
        "name": "Vampire Hunter D",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "madhater_da_killa"
        },
        "dateCreated": "2004-03-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0090248/"
        },
        "name": "Vampire Hunter D is a classic beyond even Akira.",
        "reviewBody": "Vampire Hunter D, a man torn by his own nature, at war with himself must defeat the evil vampires that plague the desolate earth which he roams. D is a dumpheil (a Whampyr- half-vampire spawned by the womb of a living women pregnant and bitten by a vampire.) so he feels that he must undo the evil that his ancestors have wrought on the earth. though their numbers dwindle, vampires still rule the night and humanity must live in fear of these monstrous creatures. Hired by Dorris, a young woman 'kissed' by Count Magnus Lee; Lee being one of the oldest and most powerful of the remaining vampires. When the town finds out that she is bitten Dorris and her brother find themselves the target of mistrust and simple minded hatred, much like D himself. Involving a few rather confusing trips to the Counts' castle D really ticks him off so Lee sends his mutants and daughter to deal with him. As the climax draws nearer you are given a closer look at the honor bound life which D forces himself to live by, however you learn precious little more about his actual history or personality - if he has one. Drawn in a stunning anime style based on some extraordinarily beautiful original concept artwork by the same guy who did final fantasy 8 and 9, plus he did Sandman's ENDLESS NIGHTS. The characters are a little but hard to deal with, any fan of DBZ should find themselves quite at home with Dorris' little brother, but the artwork is original and creative enough to keep you very visually entertained. The dialogue, or what little there is too speak of is terrible just like the toss away paper tissue characters, but this like many other 80's animes' holds a special place in my heart. It's graphic violence and stupid use of gratuitous nudity (only in 1 spot but still it was really useless)and usual objectification of woman as eye candy it opened the door for a lot of stuff that we see today and is a god quality anime. Usually when you say Anime or Manga to someone they think of either Akira or Vampire Hunter D; however until two years ago when the subsequent sequel, \"Bloodlust\", came out few people answered 'D'. Released a few years before Akira, Hunter D missed out on the explosion of Anime films in America during the later nineteen-eighties and early-nineties. It sat on video shelves for two or three years in the states before its' popularity exploded, and for a time it flourished. All good things end however and so did it's popularity escaping quickly into the realm of obscurity. Recently it was re-mastered (questionably) by the original releasers in preparation for \"Bloodlust\" and is now widely available on both VHS and DVD."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "When Doris Lang is chosen as the next bride for the vampire Count Magnus Lee, she will hire a mysterious vampire hunter known only as D in an attempt to escape her ill-gotten fate.",
        "duration": "PT1M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3963339545",
        "name": "Trailer [OV]",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDJkZjdkYTAtNzhlNS00MDkxLThkNjMtMzQzZjIzMGJhYTA0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDJkZjdkYTAtNzhlNS00MDkxLThkNjMtMzQzZjIzMGJhYTA0XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2022-01-06T15:42:56.585Z",
        "url": "https://www.imdb.com/video/vi3963339545/"
    },
    "url": "/title/tt0090248/"
}