{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mohanlal",
            "url": "/name/nm0482320/"
        },
        {
            "@type": "Person",
            "name": "Suhasini",
            "url": "/name/nm0007124/"
        },
        {
            "@type": "Person",
            "name": "Mattanoor Shankara Marar",
            "url": "/name/nm0544891/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1853,
        "ratingValue": 8.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0024170/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0347435/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0113994/"
        },
        {
            "@type": "Person",
            "name": "Pierre Assouline",
            "url": "/name/nm0039896/"
        },
        {
            "@type": "Person",
            "name": "Shaji N. Karun",
            "url": "/name/nm0440267/"
        },
        {
            "@type": "Person",
            "name": "Reghunath Paleri",
            "url": "/name/nm0657532/"
        }
    ],
    "datePublished": "1999-10-13",
    "description": "An illicit relationship between a Kathakali dancer and a young woman from an upper caste family results in an illegitimate child. He faces hardships when she refuses to let him see their child.",
    "director": [
        {
            "@type": "Person",
            "name": "Shaji N. Karun",
            "url": "/name/nm0440267/"
        }
    ],
    "duration": "PT1H59M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzI1Y2ZhZTEtNzYwMC00YTc0LWE3NWYtMmJlN2VmY2RiYTlkXkEyXkFqcGdeQXVyNTI0NzU5ODc@._V1_.jpg",
    "keywords": "dancer",
    "name": "Vanaprastham",
    "original_info": {
        "id": "Vanaprastham_1999",
        "name": "Vanaprastham",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "maheshmanutd"
        },
        "dateCreated": "2011-11-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0202055/"
        },
        "name": "Vanaprastham",
        "reviewBody": "About a week ago I saw the movie \"Vanaprastham\"...........\n\nThe movie has been with me for over a year now.....but I did not watch it because I thought it to be a slow movie depicting the poverty of Kathakali artists..........and I could not find the mood to watch that film............\n\nBut somehow one week ago I watched it...........and oh God, what a movie it was.............one of the best movies ever in Malayalam........actually in my opinion, one of the best movies I have ever seen in any language..........it stands a class apart from an average Indian movie..................hats off to Shaji N Karun, Mohanlal and Zakeer Hussain for his soothing background score...................\n\nFrom what I knew, even some of the serious movie watchers have failed to watch this movie.......may be because of the similar attitude, I do not know......I seriously urge anyone who wants to see a good movie to see this movie if you have not yet............\n\nThe movie is about a Kathakali artist Kunjikkuttan portrayed by Mohanlal.........but the director is showing the life of an artist in that movie, be it a Kathakali artist or a painter or a movie artist, whatever........Kathakali is just a setting...............The name itself speaks about the movie........\"Vanaprastham\"............it is one of the four ashrams of life.........\"Brahmacharya\" \"Grihasthasram\" \"Vanaprastham\" and \"Sanyasam\".............the movie portrays the different stages of an artist........................evolution of an artist, may be you can call it that way................\n\nTo me the stand out performances have been from the director Shaji N Karun himself, the great tabala maestro Zakkeer Hussain who composed the background score and the acting legend Mohanlal..............hats off to the director for making a complex storyline such as this into a movie which never bores the viewer...........not even for a second..........that is the main success of this movie.........It grips you from the start to the very end like in another world..........a world of Kathakali.........a world of art.......................and when the movie finishes, it haunts you....................the characters never fade..........they are still with me, every scene is being replayed over and over again in my head..........\n\nThe background score by Zakkeer Hussain plays a big part in setting the mood..............the music is really gentle and soothing..............what should I say........heavenly, may be\n\nThe supporting artists are also good......................the likes of Suhasini and Mattannur Sankarankutty Marar have done a great job........................but the real star of the show is Mohanlal himself................he made the character \"Kunjikkuttan\" alive....................I could feel him walking, breathing..........I did not at any time feel that there was any sort of acting going on...................there are some instances in the film when Mohanlal, being in the Kathakali Chutti makeup had to act with his eyes only................and oh, my God.........that was simply amazing...................Mohanlal is surely one of the greatest if not the greatest actors ever to have walked our planet earth............\n\nThe movie did win many awards including the best picture and best actor award and best editing award also in the national film awards....................the movie was greatly critically acclaimed but I do not think it was that much appreciated by the common folk, ie, us..........It is really sad actually...........................It is actually movies like Vanaprastham that should get popular acclaim instead of the unrealistic movies that we all love because we want to enjoy rather than appreciating reality.............................Really sad, really.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0202055/"
}