{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Peppino De Filippo",
            "url": "/name/nm0208375/"
        },
        {
            "@type": "Person",
            "name": "Carla Del Poggio",
            "url": "/name/nm0215744/"
        },
        {
            "@type": "Person",
            "name": "Giulietta Masina",
            "url": "/name/nm0556399/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3595,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "alternateName": "Variety Lights",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0066777/"
        },
        {
            "@type": "Person",
            "name": "Federico Fellini",
            "url": "/name/nm0000019/"
        },
        {
            "@type": "Person",
            "name": "Ennio Flaiano",
            "url": "/name/nm0280919/"
        },
        {
            "@type": "Person",
            "name": "Alberto Lattuada",
            "url": "/name/nm0490444/"
        }
    ],
    "datePublished": "1953-12-17",
    "description": "A beautiful, ambitious young woman joins a traveling troupe of third-rate vaudevillians and inadvertently causes jealousy and emotional crises.",
    "director": [
        {
            "@type": "Person",
            "name": "Federico Fellini",
            "url": "/name/nm0000019/"
        },
        {
            "@type": "Person",
            "name": "Alberto Lattuada",
            "url": "/name/nm0490444/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Drama",
        "Music",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjAxNDhhOGQtODk4OC00ODQxLWE4ZWMtMDY1NzBjZGU5OWQ5XkEyXkFqcGdeQXVyMzcwMDAzMzk@._V1_.jpg",
    "keywords": "italy,male police officer,police,police officer,travel",
    "name": "Luci del varietà",
    "original_info": {
        "id": "Variety Lights_1950",
        "name": "Variety Lights",
        "year": "1950"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ElMaruecan82"
        },
        "dateCreated": "2021-08-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0042692/"
        },
        "name": "Glory dreaming, show performing... and rude awakenings... Fellini's debut is Fellini in a nutschell... almost...",
        "reviewBody": "I started my review of Fellini's \"White Sheikh\" by correcting the personal assumption that he debuted with neo-realism but after experiencing \"Variety Lights\" his first directorial and producing debut with the collaboration of Alberto Lattuada, it's like the titular light hitting me. I realized these terms of reference don't amount to a hill of 'penne' when it came to the story's hidden depths covered by the flashy apparatus of the music-hall world.\n\nI think Fellini has never been 'realistic' in the strict sense of the term and was closer in spirit to the French poetic realism of the 30s where stories' real backdrops unearthed a certain poetry about life, a capability to sublimate humans' flaws for the sake of art. Fellini and Lattuada's exposition of the struggles of a third-rate Vaudevillian troop might shed a spotlight on the difficult life of mountebanks but it says much more about ambition, love, passion jealousy, forgiveness and ultimately human nature.\n\nBut the show must go on so let's get back to the film.\n\nFirst of all, I want to say that I thoroughly enjoyed \"Variety Lights\" and if I have one piece of advice, it's this: don't let yourself get fooled by the term 'debut', the film is a complete and well-done achievement that wouldn't make you suspect this is a first film, maybe because Lattuada was already an experienced film-maker... still, I was hooked from the start and I suspect that several viewings would convince anyone that this has the makings of a classic masterpiece. I mean it.\n\nThere's another advice, it's very tempting to look for signs of Fellini's usual trademarks, the first glaring one is the little troop of performers, going from town to town, foreshadowing \"La Strada\", the pivotal use of music (except for the absence of Nino Rota) and the overarching effects on lust and passion. We can also see the obligatory deserted areas, the streets at night and a gallery of 'faces' craving for fun or providing it... but these considerations are rather superficial and might even cloud your appreciation on a pure storytelling level.\n\nThe film opens with a show, as flashy, catchy and enrapturing as one would expect, Peppino de Filippo is Checco de la Monte, singer and head of the troop and among the dancers, there's a young Giuletta Masina as Mellina Amour, his mistress, also the voluptuous Gina Masceti (she was the jealous abusive wife in \"The White Sheikh\") and a few other colorful characters. The shows ends on a spectacular finale only spoiled by the disappearance of the money that contained the troop's wages.\n\nThe merit of this opening sequence is to set the tone by showing the show through the mesmerized eyes of Liliana, played by Carla Del Poggio, who was Lattuada's wife. She's so hooked that she embodies the effect the music-hall has on people, making it as pivotal as art or food, something that pleases the eyes, soothes the soul and exorcise the devil of boredome. That was the early 50s, where entertainment consisted of American exports: jazz music, mambo and frivolity. But there's more in Lilian's look.\n\nAfter the show, she joins the troop and asks if they need another dancer. The artists are so busy and desperate about the money they don't even care about her credentials. She boards the same train that take them to the next town (some hide in the toilet to avoid paying the fare) and asks Checco to give him a job. He's first titillated by the beauty and the nerve of the young lady and try some moves she immediately dismisses wishing she could be taken seriously, Checco falls immediately in love.\n\nThe following show meets a more hostile crowd where audience members spare no effort to heckle every single number. Then it all changes when Liliana accidentally lets her skirt slip during a Hula dance and the public -mainly masculine- goes all bananas about it, the sleazy manager knows what the audience wants: naked women and sensual dances. The performances are repeated and Lilianna's career takes off until the whole troop is invited to the mansion of a wealthy man named Duke (Giacomo Furio).\n\nWhat goes during the dinner is perhaps a masterpiece of 'silent' comedy: without words, we can only heard the slurping and chewing sounds of the guests gluttonously eating chicken while the women try to maintain their composure. That scene says a lot about how 'hungry' they are, literally and figuratively, symbolizing the tacit hunger for fame and glory. The evening is ruined when Checco prevents the man from taking advantage from Liliana and at that point he decides to form his own troop with her and abandon the poor Amelia, Masina plays once again a strong character whose life seems destined for chagrin.\n\nThe journey goes on with its shares of ups and downs and encounters in the middle of the night and some that can make or break an artist's career. It is a wonderful tribute to the peculiar laws of entertainment by Fellini and Lattuada, two artists who cast their own wives to minimize the costs, embodying the travelling-troop mentality. Their depiction is so bold and sincere, especially men's less-than-honorable motives it's as if Fellini was also foreshadowing his own infidelities, suffered by Masina all through her life..\n\nIt's a comment on talent, luck, and a sort of faith in success that is drawn here by two maestri, the film didn't work at the box-office but it set Fellini's first foot behind the camera after his screenwriting collaboration with Roberto Rossellini, little did he know that 3 years after, he would meet success with \"I Vitelloni\" and the face of Italian cinema would never be the same.\n\nFellini's career mirrors the fate of Liliana in \"Luce del Varieta\", proving once again that reality can be as strange -and poetic- as fiction.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0042692/"
}