{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Van Der Beek",
            "url": "/name/nm0004735/"
        },
        {
            "@type": "Person",
            "name": "Jon Voight",
            "url": "/name/nm0000685/"
        },
        {
            "@type": "Person",
            "name": "Paul Walker",
            "url": "/name/nm0908094/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 47219,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0034438/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0079596/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Person",
            "name": "W. Peter Iliff",
            "url": "/name/nm0407717/"
        }
    ],
    "datePublished": "1999-01-15",
    "description": "A back-up quarterback is chosen to lead a Texas football team to victory after the star quarterback is injured.",
    "director": [
        {
            "@type": "Person",
            "name": "Brian Robbins",
            "url": "/name/nm0005367/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGVlYjRmYTUtNTRiYS00ODNmLThlNDQtNzc3OWJmYTlkMzM0L2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "small town,football stadium,football practice,scholarship,coming of age",
    "name": "Varsity Blues",
    "original_info": {
        "id": "Varsity Blues_1999",
        "name": "Varsity Blues",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jmworacle-99025"
        },
        "dateCreated": "2020-05-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0139699/"
        },
        "name": "In Texas it's God, Family, Country, and Football,.... maybe.",
        "reviewBody": "To me high school football is Texas football. I'm from South Florida and currently live in Southern Alabama as good as their programs are, they don't hold a candle to Texas football. I was lucky to play one year of J.V. football where I kept the bench nice and warm for the starters until in order to prevent the opponent from taking things out against the varsity team the next evening. The night of the homecoming bonfire there were more people at the J.V. game than at the event. Our opponent the Barbers Hill Eagles had already won the Varsity and Middle School Championship for the District and our game would cap off the hat trick. Going into the game we were confident of a victory because earlier in the year as a filler game we played and had easily won. No such luck. Suddenly the opponent suddenly gained twenty pounds of muscle and it was different. Thankfully due to two missed two point conversions and with a little over three minutes to go our star running ripped of a ninety three yard touchdown run to win the game. The Eagles coaches were so angry they made the team run back to the locker room ( they were bused in). Enough of memory lane.\n\nBud Kilmer legendary coach runs his team with an iron fist. Nothing will get in his way in order to win a district title. When his All-State quarterback suffers a career ending injury (in which he claims the extent was 'never brought to his attention') it is up to the backup to save the day. Turns out the back up was just as talented maybe even more so than the starter. A small act of rebellion has the coach threatening to sabotage his academic scholarship. It is then learned that the only reason why the team's star running only had three touchdowns were due to the fact he broke for runs over twenty yards. Now given when this movie was made I find it highly unlikely a coach would have that attitude maybe in the seventies or early eighties but no way a coach could last with that attitude. In a final act of defiance to preventing the ruin of an injured player well watch the movie.\n\nOne other thing, if Bud Kilmer was such a great coach, why did he only win two state championships?",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Paramount Home Entertainment",
        "duration": "PT2M29S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3144725529",
        "name": "Varsity Blues",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BODgzMGZkNzgtNzhjZi00ZGQzLWI3ZGUtMmI0ZjgxZGFlOWNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODgzMGZkNzgtNzhjZi00ZGQzLWI3ZGUtMmI0ZjgxZGFlOWNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2016-06-03T22:18:51Z",
        "url": "https://www.imdb.com/video/vi3144725529/"
    },
    "url": "/title/tt0139699/"
}