{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Chevy Chase",
            "url": "/name/nm0000331/"
        },
        {
            "@type": "Person",
            "name": "Beverly D'Angelo",
            "url": "/name/nm0000350/"
        },
        {
            "@type": "Person",
            "name": "Randy Quaid",
            "url": "/name/nm0001642/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 51166,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0024560/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0102282/"
        },
        {
            "@type": "Person",
            "name": "Elisa Bell",
            "url": "/name/nm0068183/"
        },
        {
            "@type": "Person",
            "name": "Bob Ducsay",
            "url": "/name/nm0003032/"
        }
    ],
    "datePublished": "1997-02-14",
    "description": "In the fourth outing for the vacation franchise, the Griswolds have to survive Vegas fever when they go to Las Vegas for a fun family vacation.",
    "director": [
        {
            "@type": "Person",
            "name": "Stephen Kessler",
            "url": "/name/nm0450387/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZTIwMWEwZmQtMjI1ZS00NDdmLTgwMGItNmFiOTk1ZWQ5NGZiXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "wedding anniversary,slapstick comedy,airplane,singing in a car,reference to the beach boys",
    "name": "Vegas Vacation",
    "original_info": {
        "id": "Vegas Vacation_1997",
        "name": "Vegas Vacation",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "MovieAddict2016"
        },
        "dateCreated": "2003-02-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120434/"
        },
        "name": "\"All in all, I feel that 'Vegas Vacation' is a very underrated comedy.\"",
        "reviewBody": "`Vegas Vacation' - 1997 - 3.5/5 stars\n\nIn 1989, audiences were introduced to `Christmas Vacation,' which turned out to be more than a pleasant surprise. Then, in 1997, almost a decade later, another `Vacation' film churned out. The fourth in the series.\n\n `Vegas Vacation.'\n\n Clark Griswold has finally gotten his break. His food preservatives have been approved, and he has gotten a bonus. Now, what to do with the money? He has an idea. Take the wife and kids to.(big surprise) Vegas! But soon after the ordeal of arriving in Vegas is over, Clark finds himself wasting away his money gambling; especially playing craps! Now, with the help of Uncle> Eddie, he must regain his money, and regain his wife from the grasp of Wayne Newton!\n\n Chevy Chase returns to the role of Clark Griswold, he gets these crazy notions and perfect ideas built up in his head, and as we have learned in the other films, they always disintegrate one at a time until he blows his top.\n\n Beverly D'Angelo returns to the character of Ellen Griswold, she pulls off the housewife/mother role quite believably; she is not nearly as bad as anyone would expect. Many people say she was in the first movie just to flash the screen a few times, but that's just from the mouths of people who dislike the movies; I think her role is important, and D'Angelo carries it well. The only other person I can think of that fits the Ellen character is Goldie Hawn, but that's probably because she acts a bit like D'Angelo so it is easier to imagine her as Ellen.\n\n The kids in this `Vacation' film are (finally!) older; Rusty is on the verge of manhood, and Audrey has matured as well. The things they get themselves into during the film are quite funny. Audrey becomes a Vegas dancer, and Rusty becomes a rich tycoon with the help from some `friends.' We splice back and forth to their predicaments during the film.\n\n One hilarious segment includes a bit where the Griswold family visits Uncle Eddie (a returning Randy Quaid) out in the middle of nowhere; he says that he got his land for free from the government because it used to be a nuclear test site (`I got tomatoes growing this big!'). Uncle Eddie is more disgusting than ever; he lives in a small trailer with about forty-something kids, all of which have strange deformations.\n\n In `Vegas Vacation,' Randy Quaid has the longest screen time that Eddie's ever had before, and I think this is a good thing. Perhaps some people thought it went a bit over the top with Eddie, but I say, `The more Eddie, the better!'\n\n Wallace Shawn makes a rather long cameo as the craps dealer; Clark has a vengeance built up against Shawn's character. He MUST beat him. However, Clark always loses and that is how he loses all his money.\n\n Wayne Newton takes a rather big role as well. He pretends to be in love with Ellen Griswold (`It's a lock of my hair.') in the film; he tries to steal her from Clark, who forgets to pay attention to his wife while he blows his money away like it's just paper and nothing more.\n\n John Hughes, writer of `Vacation' and `Christmas Vacation,' did NOT return to the keyboard for this one; someone else wrote it. I think, however, that the writer of `Vegas Vacation' wrote the script well; the jokes are plentiful and enjoyable. It's nowhere near as bad as some comedy sequels get (i.e. `Police Academy' sequels).\n\nMany people really hated `Vegas Vacation,' saying that is was just not funny. But no one can tell me they didn't laugh - or even chuckle - at this film. I understand that it is not as good as the first film, but to tell you the truth, I used to have a hard time choosing a favorite - the three films (`Vegas,' `Christmas,' and the original - NOT counting the `European' sequel) are so different and funny that it really is hard to choose. However, `Vegas' is more familiar to the first film than the sequel(s), and it's a bit easier to compare. When I look closely at them, I decide (a) the first film was a first, and no one had ever experienced Clark Griswold before; (b) the jokes are a bit better and (c) the cast was a bit younger back then and could go for more physical gags. In the new film, Clark swings over the Hoover Dam, and it looks like Chevy really strained himself doing some of the physical stuff (even if it means dangling over a green screen).\n\n All in all, I feel that `Vegas Vacation' is a very underrated comedy. I really, really enjoyed it, and had a fun time watching it. It's always nice to take another visit to the Griswold family, and I'm up for another sequel (perhaps John Hughes should write the next one?).\n\n 3.5/5 stars -"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M12S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3484335641",
        "name": "Vegas Vacation",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTU2ODk1ZTQtNGUxMy00ZTlhLTgzNmQtODk4Mjc4YzQ0M2Q3XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTU2ODk1ZTQtNGUxMy00ZTlhLTgzNmQtODk4Mjc4YzQ0M2Q3XkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-03-14T17:04:27.610Z",
        "url": "https://www.imdb.com/video/vi3484335641/"
    },
    "url": "/title/tt0120434/"
}