{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "James Darren",
            "url": "/name/nm0201626/"
        },
        {
            "@type": "Person",
            "name": "Barbara McNair",
            "url": "/name/nm0573552/"
        },
        {
            "@type": "Person",
            "name": "Maria Rohm",
            "url": "/name/nm0737538/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2079,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "alternateName": "Venus in Furs",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0055009/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0034385/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103262/"
        },
        {
            "@type": "Person",
            "name": "Jesús Franco",
            "url": "/name/nm0001238/"
        },
        {
            "@type": "Person",
            "name": "Malvin Wald",
            "url": "/name/nm0907013/"
        },
        {
            "@type": "Person",
            "name": "Milo G. Cuccia",
            "url": "/name/nm0190965/"
        }
    ],
    "datePublished": "1969-08-19",
    "description": "After musician finds the corpse of a beautiful woman on the beach, the woman returns from the dead to take revenge on those responsible for her death.",
    "director": [
        {
            "@type": "Person",
            "name": "Jesús Franco",
            "url": "/name/nm0001238/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzQ4NTY0YTAtYzFmMi00N2EzLTk3YWEtMTE1NDE5YmNhNzE2XkEyXkFqcGdeQXVyMjIyNjE2NA@@._V1_.jpg",
    "keywords": "rape,lingerie,surrealism,woman in jeopardy,woman on top",
    "name": "Paroxismus",
    "original_info": {
        "id": "Venus in Furs_1970",
        "name": "Venus in Furs",
        "year": "1970"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Witchfinder-General-666"
        },
        "dateCreated": "2009-03-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0064789/"
        },
        "name": "Venus In Furs Will Be Smiling... Sharkishly!",
        "reviewBody": "Super-prolific Spanish exploitation director Jess Franco is often bashed as being merely a creator of cheap trash - which is a preconception that only people who are not familiar with all of his work can take. Sure, the man's impressive repertoire of more than 180 films includes more than a few stinkers, but Franco also made several films that are downright brilliant, especially in his earlier years. \"The Awful Dr. Orloff\" (1962) and \"The Diabolical Dr. Z\" (1966) are two of these films, and \"Paroxismus\" aka. \"Venus In Furs\" of 1969 definitely also belongs in this category. \"Venus In Furs\" is a bizarre, sleazy and amazingly artistic Exploitation gem that mixes Horror, Mystery, sexual perversion and great music in an obscure and highly memorable manner. The casting of Klaus Kinski in a typically demented role and sexy Maria Rohm as the eponymous Venus are by far not the only aspects that make \"Venus In Furs\" a must for cult-cinema lovers.\n\nWhen walking along the beach in Isanbul, a Jazz trumpeter (James Darren) stumbles across the body of a young woman. He recognizes her as a girl who was assaulted by a rich playboy (Klaus Kinski) and two others. He travels to Rio, where he meets Rita (Barbara McNair) a foxy black bar singer who becomes his girlfriend. In Rio, he also runs into a young woman (beautiful Maria Rohm) who is the spitting image of the dead girl from the Istanbul beach.... I do not want to give away too much of the, sometimes confusing, plot, but I can assure that it is highly obscure and very interesting throughout. The English title, \"Venus In Furs\", is also the title of a novel by Leopold Sacher-Masoch. The film has nothing to do with the novel, however, the title refers to the character played by Maria Rohm. Rohm is incredibly sexy and mysterious at the same time. Barbara McNair, who is also responsible for the best parts of the great score, makes another great female character. The female cast members are all beautiful, and, as in is the case with most of Franco's later films, the film provides sleaze, female nudity, lesbianism and perversions, though not as explicitly as many of his later films. It also provides ingenious surrealism, obscure mystery, psychedelic imagery and delightful weirdness of all sorts. The great Klaus Kinski (one of my all-time favorite actors) is once again brilliantly demented in his role, and James Darren fits well in the lead. One of the greatest aspects of the film is the great score, especially memorable is the 'Venus in Furs' sung by Barbara McNair herself. \"Venus In Furs\" is an obscure and bizarre gem that is ingenious in many aspects and should disabuse all the Jess Franco-haters out there. To some people, this is Franco's best film. I would still give that title to either \"The Awful Dr. Orloff\" or \"The Diabolical Dr. Z\", but this film is doubtlessly also a must-see for everyone interested in cult cinema, and an absolute proof for what a great filmmaker Franco is. 8.5/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0064789/"
}