{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Julia Ann",
            "url": "/name/nm0030214/"
        },
        {
            "@type": "Person",
            "name": "Joseph Roth",
            "url": "/name/nm1027271/"
        },
        {
            "@type": "Person",
            "name": "Everett Rodd",
            "url": "/name/nm0734452/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 526,
        "ratingValue": 3.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0086485/"
        },
        {
            "@type": "Person",
            "name": "Earl Kenton",
            "url": "/name/nm0448912/"
        },
        {
            "@type": "Person",
            "name": "C. Courtney Joyner",
            "url": "/name/nm0003676/"
        }
    ],
    "datePublished": "1999-02-02",
    "description": "Built for pleasure, Veronica 2030 is a love android from the future - but there's a problem with the programming... The robot has discovered the delicious sensation of human passion. The insatiable android must be stopped before s...",
    "director": [
        {
            "@type": "Person",
            "name": "Gary Graver",
            "url": "/name/nm0004372/"
        }
    ],
    "duration": "PT1H10M",
    "genre": [
        "Romance",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmRhMjJjZGYtZmY1OC00ODBlLTk5MGYtNWQ2OGE4NjgwZDM4XkEyXkFqcGdeQXVyMTUzMTUxMzk1._V1_.jpg",
    "keywords": "2030s,love,fetish,android,lingerie",
    "name": "Veronica 2030",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "monsters from the id"
        },
        "dateCreated": "2000-01-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0189184/"
        },
        "name": "This Ain't Veronica and Archie",
        "reviewBody": "As Freud once said, sometimes a cigar is just a cigar. And sometimes that \"R\" rating is really an accurate appraisal from the MPAA. At an hour nineteen, this movie clearly weighed in light on the scales, which was not a good sign.\n\nThe story centers around Julia (skip the last name.it worked for Cher and Madonna, right?) playing a pleasure model named Veronica from the year 2030, who, after some unauthorized late-night tests, is catapulted back into the past. Options being limited for pleasure 'droids from the future, Veronica gets a job modeling for a lingerie catalogue. Not exactly a Pulitzer Prize winning plot, but enough of a premise to satisfy late night cable audiences. That is, it would be if there were any stuffing inside this doughy, inedible confection.\n\nWe do have a few glimpses of Julia, who is admittedly luscious, with her off-the-shelf breasts, her two charming little tattoos, and false eyelashes that look like twin tarantulas crawling on her eyes. But inevitably the camera gets coy at crucial moments. Exhibit A is a torrid dance scene with Julia, wearing only a net body stocking and a pair of high heels. But even if she proves that The Girl Can Dance, the scene is over in the blink of a voyeur's eye. Exhibits B and C are the few heated moments as the girls model some fetish fashions. But the leather and chains are strictly for a niche market and fail to meet even the Minimum Daily Requirements.\n\nThe pneumatic Nikki Fritz plays a ruthless businesswoman doing business from the back seat of her limo: barking out orders on her cell phone; being worshipped by muscular stallions; appearing in an Academy Award parade of designer gowns. Everything, in fact, except what she does best.which is get naked and heat up the screen. There is one feeble attempt at a love scene, where Nikki appears naked for a nanosecond before the screen fades to a prim and proper black.\n\nIn fact, as the Bruce Willis talking action-figure on my desk says, \"This movie has more blackouts than London during the war\". Every time the on-screen thermometer begins to rise above tepid, the scene fades to black.\n\nThe third time I fished this undernourished specimen out of the late-night cable waters, I decided to rent the unrated version. It immediately added the heft of about fifteen minutes, correcting the single most important deficiency of the \"R\" version.nudity. We have boy meets girl, girl meets girl, boy meets two girls and so on - with all of the scenes providing copious amounts of naked flesh and cheap thrills. Fashions shows begin in lingerie and end in nothing but skin. (And for some odd reason, there is also a lot of licking in this film; I haven't seen that much tongue since my last trip to my local deli.) There is even an interlude where Julia and Nikki get a chance to bump bodies. Watching these two works of art roll around in a four-poster bed, I am mystified that anyone could bear to edit out that scene.\n\nAll of which reminds me of the time, a few years back, when a video rental mega-store was in a quandary about a recent release. On the one hand, they couldn't ignore a new release from a major studio; but they also couldn't risk offended the Family Values crowd by renting out an \"NC-17\" movie. So they compromised and put an \"R\" version on the shelves. \"Showgirls\" without the nudity? Why bother?\n\nSame deal here."
    },
    "url": "/title/tt0189184/"
}