{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Whitney Houston",
            "url": "/name/nm0001365/"
        },
        {
            "@type": "Person",
            "name": "Tina Turner",
            "url": "/name/nm0877913/"
        },
        {
            "@type": "Person",
            "name": "Cher",
            "url": "/name/nm0000333/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 201,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Person",
            "name": "Eugene Pack",
            "url": "/name/nm0655438/"
        }
    ],
    "datePublished": "2000-07-20",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Simon",
            "url": "/name/nm0800301/"
        }
    ],
    "duration": "PT1H13M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDg3ZDc3N2ItNGI3Yi00ZmEwLWJhMTYtZTUzMTYzM2YyMzEwXkEyXkFqcGdeQXVyMTk4MDY5Nw@@._V1_.jpg",
    "keywords": "tv special,concert film,pop music",
    "name": "VH1 Divas Live 2",
    "original_info": {
        "id": "VH1 Divas Live '99_1999",
        "name": "VH1 Divas Live '99",
        "year": "1999"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Aussie Stud"
        },
        "dateCreated": "2002-01-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0265970/"
        },
        "name": "How exactly is Elton John a diva?",
        "reviewBody": "The second installment in VH1's successful \"Diva's Live\" series featured Elton John, Tina Turner, Whitney Houston and Cher as the 'big name line-up' with special guests Brandy, Faith Hill, LeAnn Rimes and 'surprise guest' Chaka Khan performing individual sets in between to keep the ball rolling. Unfortunately, with troubles plaguing the stage and production of this elaborate set-up, \"VH1 DIVAS LIVE 1999\" was more of a fizzler than anything.\n\nRumors broke out that Tina Turner and Elton John were having it out with each other over who should get the spotlight in a duet performance during rehearsals. That nasty spat lead to Tina Turner pulling out of the duet (but later rejoining him in a last-minute decision), \"The Bitch Is Back\" with Elton John which has resulted in the two of them currently refusing to talk to each other! Unfortunately, they were about the only sparks that were ignited throughout this limp affair that also featured Faith Hill warbling her haunting rendition of \"Everything I Do (I Do It For You)\" and LeAnn Rimes doing a duet with Elton on \"Written In The Stars\", from their \"AIDA\" production.\n\nSome positive high-lights of the show would include Tina Turner singing \"The Best\" and \"Let's Stay Together\" and Cher doing \"If I Could Turn Back Time\". Unfortunately, by the end of the night, Elton, Tina and Cher had all fled the concert hall and were absent from the grand finale, \"I'm Every Woman\" that was lead by Chaka Khan and the 'bit players' who were probably shaking their heads in puzzlement at why this production was still going on. The sickest thing here though is that all the proceeds are supposedly going to charitable causes and Elton and Tina couldn't get past their prior spat to overcome their petty in-differences.\n\nWhat a shame - this production had so much potential. It didn't help matters either that TLC also pulled out of performing on the show at the last minute. So to wrap up my review, I think this was the worst edition of the \"DIVAS LIVE\" specials to be produced.\n\nShame on you Tina and Elton!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 1,
            "worstRating": 1
        }
    },
    "url": "/title/tt0265970/"
}