{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paula Abdul",
            "url": "/name/nm0000716/"
        },
        {
            "@type": "Person",
            "name": "Adele",
            "url": "/name/nm2233157/"
        },
        {
            "@type": "Person",
            "name": "Harry L. Seddon",
            "url": "/name/nm2780564/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 24,
        "ratingValue": 5.4,
        "worstRating": 1
    },
    "datePublished": "2009-09-17",
    "director": [
        {
            "@type": "Person",
            "name": "Louis J. Horvitz",
            "url": "/name/nm0395776/"
        }
    ],
    "genre": [
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWJkMDhjYWQtOTNmNi00M2IwLTk5M2QtNDE5OTFhMTdhMTQ2XkEyXkFqcGdeQXVyMTM4NTY4MDY@._V1_.jpg",
    "keywords": "tv special",
    "name": "VH1 Divas Live 2009",
    "original_info": {
        "id": "VH1 Divas Live_1998",
        "name": "VH1 Divas Live",
        "year": "1998"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rael1983"
        },
        "dateCreated": "2009-10-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt1513931/"
        },
        "name": "A show where the true Divas were guests",
        "reviewBody": "This show was damned from its early stages. I mean, why did VH1 need to know who the Divas are? We all know who they are, it was not necessary to open a message board for fans to submit their choices. Especially because the people who use the Internet are mostly young, and as it happened, they got many suggestions of female performers who are hot at the moment but not necessarily true Divas. I remember reading stupid choices such as Lady GaGa, Ashanti, Ciara, Britney Spears, Pussycat Dolls, Disney stars, etc.\n\nSilly me, I thought the producers at VH1 would have enough criteria to select real Divas for their revamped show. But then that bad day came when VH1 announced their first performers, among them one of the most wrong choices VH1 has ever made for a Diva show: Miley Cyrus. When I first read it I thought it was a joke. A very bad joke. It took me time to realize it was real. The rest of the performers were not that bad, in fact they would have made great guests in separate Divas concerts, the mistake was to have them as headliners on the same show. Leona Lewis, Jennifer Hudson, Adele and Kelly Clarkson all have great voices and stage presence, but the show lacked true legends as headliners.\n\nAnother awful choice came with the selection of Paula Abdul as the host of the concert. I still don't understand why VH1 needs to book a host for the Divas concert. The first shows didn't have one and they still are the best Divas shows there have been. I don't mean that I didn't enjoy previous hosts, Ellen was fun and Queen Latifah was great singing in 2003. But Paula Abdul was horrible. Not only she lip-synched her full performance, doing it horribly by the way, but she also kept making stupid jokes about \"American Idol\" and Simon Cowell. \"This is not American Idol\", she said at the beginning. Well, it wasn't but it seemed as if it was. Constant references to the show were made throughout the concert, a show that has never needed other shows to be successful.\n\nNow let's talk about the guests. If VH1 is able to get for their Divas show people like Sheryl Crow, Cyndi Lauper, Toni Braxton and Liza Minnelli, why not making a true Divas show by having them as the headliners? But no, they were there either as musical guests or guest presenters. Stevie Wonder was also there. Nothing against him, he is in fact one of my all time favorite artists, but this show was called \"Divas\" and it should have only featured women. Women to perform and women to present (what the hell were Corbin Bleu and the men of \"True Blood\" doing there?). I remember when the first concerts had Hollywood stars like Susan Sarandon and Hilary Swank as presenters instead of people that are only famous in US television.\n\nAbout the performances, there were pretty good ones: Kelly Clarkson was stunning on \"Already Gone\", Jennifer Hudson did pretty well on \"Spotlight\", Adele was flawless on \"Hometown Glory\", Martina McBride sung like a bird on \"A Broken Wing\" and Leona Lewis' duet with Cyndi Lauper was simply beautiful. But the sad thing was the fact that they didn't get more time to perform another song. The Divas show is famous for having Divas singing not only her new songs, but also her hits. Were was \"Bleeding Love\" by Leona Lewis, \"Battlefield\" by Jordin Sparks or \"Chasing Pavements\" by Adele? VH1 decided to include videos to present each headliner and that cut time to have more performances. Sad.\n\nSpeaking of the crowded performers list, this year VH1 had to include veterans as guests because they were fearing the show would suffer for having only newbies as headliners. This time it was a good idea. But I really don't get why VH1 keeps insisting on having too many guests on the Divas show. The first one had only Carole King and it is still the best Divas show to date. I would have preferred to see, for example, Jennifer Hudson singing with Leona Lewis, or Kelly Clarkson with Adele. Another missed opportunity like the one in 2003 when they had Celine Dion and Whitney Houston, two of the most famous and best Divas of the last 15 years, on the same show but did not perform together. That could have been memorable.\n\nOne of the few successes of this year's show was the decision to get it back to New York city. In the past I really missed the first shows where the Divas got close to the audience in a more intimate venue. But this year I missed the Divas interacting with the public, like they did in 1998, 1999 and 2000. And I also missed greatly the finale performance where all the performers get to sing together the same song. Where was that this year? Instead they showed a fat man dressed as a female viking or something playing the fool on a balcony. Yes, I know what you are thinking so I'm not even going to comment that.\n\nI hope the people at VH1 learn from their mistakes and make a Divas show worth watching in 2010 with true Divas like Anita Baker, Toni Braxton, Dolly Parton, Barbra Streisand, Annie Lennox, Carly Simon, Natalie Cole, Bette Midler, Vanessa Williams, Trisha Yearwood, Roberta Flack, Sheryl Crow, Linda Ronstadt, Bonnie Tyler... I don't hold my breath though, as I have read that for 2009 they made a list of new female singers and that this year they have only scratched the surface. So we should not panic if in next concerts we see people like Fergie, Rihanna, Lady GaGa, Taylor Swift or Katy Perry headlining the show. Nothing against them, but they are not Divas."
    },
    "url": "/title/tt1513931/"
}