{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Tom Savini",
            "url": "/name/nm0767741/"
        },
        {
            "@type": "Person",
            "name": "Brian Bremer",
            "url": "/name/nm0107068/"
        },
        {
            "@type": "Person",
            "name": "Melanie Parker",
            "url": "/name/nm1813965/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 253,
        "ratingValue": 2.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0059715/"
        },
        {
            "@type": "Person",
            "name": "Matt Green",
            "url": "/name/nm0337564/"
        },
        {
            "@type": "Person",
            "name": "Martin L. Kelley",
            "url": "/name/nm1126367/"
        }
    ],
    "datePublished": "2003-12-30",
    "description": "A group of campers encounter a brutal government agent whom uses them as bait to capture a vicious creature, a failed government experiment, loose in the woods.",
    "director": [
        {
            "@type": "Person",
            "name": "Matt Green",
            "url": "/name/nm0337564/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Action",
        "Horror",
        "Sci-Fi"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOWRmNGE5OTktNjQxYy00Y2U5LTkzYmYtMTRiYzVlZjM0MDYxXkEyXkFqcGdeQXVyNjgwNTk4Mg@@._V1_.jpg",
    "keywords": "brinke stevens barefoot,soldier,monster,lost in woods,lizard monster",
    "name": "Vicious",
    "original_info": {
        "id": "Vicious_2003",
        "name": "Vicious",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "brainspoon"
        },
        "dateCreated": "2002-11-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0309039/"
        },
        "name": "MONSTER MAYHEM!!!",
        "reviewBody": "Holy Rabid Land Shark! This flick rocks! The first good horror film I've seen since The Sadist, and that was a good fifty horror films ago. I am a junkie for this sort of film, and my appetite is insatiable. I will watch horror flick after horror flick, indiscriminate of plot, budget, cast, or credentials, just to get my fix. I've seen many a bad, bad, BAD horror film, but I tally forth in the hope of finding that really cool one to tell my friends about.\n\nAnd finally, after a long dry spell I have found one that is pretty darn entertaining. Sort of Friday the 13th meets Jaws meets Army Thriller of the Week, this monster flick has a lot going for it. For one thing, you got Tom Savini as a wild-eyed mad scientist, and he's his groovy charismatic Savini self in this. We also get the one and only Bill \"CHOP-TOP\" Moseley as a simmering military guy (only a cameo), and the red headed inbreed kid from Pumpkin Head is the film's hero! We get to see Tom Savini beat up Pumpkin Head Boy! All right!\n\nThe plot isn't very original (forest monster eats people), but while most film's of this type wallow in unnecessary subplots (Monopoly in Friday 13th anyone?) keeping the horror in the background, this one sticks to the point, has some pretty good action, and ACTUALLY SHOWS THE MONSTER!! How many films have I seen where it's supposed to be about a monster eating people, but nothing happens, in this film, HORRIBLE THINGS HAPPEN!, people are munched and mauled and the gore flies, leaving the Gore Hound in you feeling satisfied. And dare I say, it has some suspense to boot, dare i say it? I DARE SAY IT! what more can you ask for in this type of film! Blood and death and unnerving coolness.\n\nRent this flick! a great B-MOVIE MONSTER MASH to enjoy with friends and flick brews.\n\nFIGHT EVIL!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0309039/"
}