{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mark W. Hardin",
            "url": "/name/nm1082954/"
        },
        {
            "@type": "Person",
            "name": "Edward J. Fasulo",
            "url": "/name/nm1081167/"
        },
        {
            "@type": "Person",
            "name": "MaryJean Feton",
            "url": "/name/nm0275331/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 177,
        "ratingValue": 2.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0015604/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0040597/"
        },
        {
            "@type": "Person",
            "name": "Anthony Bruce",
            "url": "/name/nm1084019/"
        }
    ],
    "datePublished": "2001-11-30",
    "description": "A confused young man, just out of the proverbial gay closet, must choose between his lover of nine months and his ultra-religious parents on Christmas Eve.",
    "director": [
        {
            "@type": "Person",
            "name": "Edward J. Fasulo",
            "url": "/name/nm1081167/"
        }
    ],
    "duration": "PT1H18M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI4NjA4MjAxOV5BMl5BanBnXkFtZTcwNDU3NTkxMQ@@._V1_.jpg",
    "keywords": "christmas,gay interest",
    "name": "Visions of Sugarplums",
    "original_info": {
        "id": "Visions of Sugarplums_2001",
        "name": "Visions of Sugarplums",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "RicanRic"
        },
        "dateCreated": "2003-03-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0301254/"
        },
        "name": "It Figures!",
        "reviewBody": "Well Folks, this is another stereotypic portrayla of Gay life however, the additional downside includes poor acting, horrible script, no budget, terrible sound and let us not forget the impossible storyline.\n\nIt is Christmas in New York City and our story immediatly \"focuses\" on two male individuals, apparently lovers for some time. One of them has not let his parents (the right wing, religious zealot types) know that he is gay (adding to the impluasability of the story 'cause this guy is as efeminant as gay guys come these days) and his parents are coming to viusit him. They will stay in his New York apartment where he and his lover have just decorated for Christmas.\n\nThe story continues to develop around the arrival of the parents, who noone will like anyway and - how through only obvious and predictable ways - they come to learn there son is gay. Tears are shed as was my interest in this movie.\n\nThe cast of charecters, seemed like an intro acting course at the local community theatre. The lovers in this film are mismatched, and there does not appear to be any cohesion to their union.\n\nThe landlord is flat and her attempt to be humanistic in the situation are undercooked and certainly didnt help move the plot any further.\n\n The dragqueen friend who steps to the aid of one of the lovers in his \"time of need\" is stereotypic and gives a bad name to the unique art of drag.\n\nAlthough some guys night find one of the lovers to have a nice body (again, stereotypic imagery) it does not help this story.\n\nStay away from this film, especially if you are considering a purchase. You'll shoot yourself if you do!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "url": "/title/tt0301254/"
}