{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "People of Iraq",
            "url": "/name/nm1747652/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 390,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0137418/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0137419/"
        }
    ],
    "datePublished": "2004-10-29",
    "description": "150 digital videos are distributed to everyday Iraqis, who are encouraged to record their feelings about their lives. They are also encouraged to pass the cameras along to get as many Iraqis across the country to participate in th...",
    "director": [
        {
            "@type": "Person",
            "name": "People of Iraq",
            "url": "/name/nm1747652/"
        },
        {
            "@type": "Person",
            "name": "Martin Kunert",
            "url": "/name/nm0003209/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Documentary",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI3OTU1MTY0OV5BMl5BanBnXkFtZTcwNzQwMDUzMQ@@._V1_.jpg",
    "keywords": "iraq,iraq war",
    "name": "Voices of Iraq",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "canadamelody"
        },
        "dateCreated": "2007-02-19",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0430745/"
        },
        "name": "Whitewash of Western crimes",
        "reviewBody": "REVISION:\n\nI wish to stress that I do not have a problem with the Iraqi people in this documentary they are delightful and fascinating, a few are not so but most are. My complaint is with the documentary exterior editorial elements.\n\nMy original posting as follows:\n\nThis documentary pretends neutrality but in fact there are so many glaring omissions that in the political sense it cannot be taken seriously. Furthermore the questions asked of people are so bland and even to highly educated people the questions being bland assure bland answers. All the major elements of US/UK harm done to the country is omitted. The more than a decade long of US/UK bombing of the country and the even more devastating genocidal economic sanctions that cost 1 million Iraqi lives and cemented Saddam's power and provided the regime with an assurance of a people too ill and hungry to do the over-throwing themselves. In the section on the North Kurdish region there is no mention of the rewards given to Saddam by Thatcher and Bush senior after the chemical genocide nor any recognition that on the other side of the boarder in Turkey throughout the 90's Kurds were being slaughtered and ethnic cleansed by a NATO nation with the full backing of Clinton/Major/Blair and an endless flow of arms from the USA/UK/Israel to Turkey. Do the Iraqi Kurds feel nothing for Turkish Kurds ? Watching this documentary you would think so. I don't believe it however. In regard to the uprisings in the South in 1991 there is no mention of the US forces blocking anti-Saddam rebels from ammunition storehouses or US helicopters flying over and simply watching Saddam's helicopters and ground forces slaughtering people or that Bush senior told the Pentagon to let Saddam's Republican guard pass through coalition lines on their way to putting down the anti-Saddam rebellion. No mention of the origins of the Baathist regime and Saddam's history with the CIA. And why does the documentary say 24 years for the period of time lacking free speech. Is it not more? Saddam took control without the title of President in 1968 and the Baathists were installed into power by the Kennedy administration in 1963. Then Saddam had his power made formal with the Presidency in 1979. The documentary shows very real footage of barbaric crimes of the Saddam regime but shows nothing to counter one man's foolish idea that the victims of American torture are all evil, when in fact we know that it has been quite the opposite, countless innocent people rounded up by both American troops and government security forces and Blackwater thugs and thrown into prisons and tortured.\n\nWho directed this....Condi Rice ?\n\nPS. See the documentary PAYING THE PRICE: KILLING THE CHILDREN OF IRAQ which is part of the JOHN PILGER: DOCUMENTARIES THAT CHANGED THE WORLD 4 disc REGION 2 DVD box set. \n\nAs journalist Robert Fisk always says if the primary export of Iraq were fruit and veg, Saddam would still be in power. The occupation authority was set up as a system of economic colonial rape. Only so far its not exactly working out as they planned. The idea that the Neo-Cons or the Clintonites were going to provide for the Iraqi people when neither provided for the people of New Orleans is simply a deluded farce.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0430745/"
}