{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "W.C. Fields",
            "url": "/name/nm0001211/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 101,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "description": "W. C. Fields's six gems that feature the comic genius at his peak: The Golf Specialist, Pool Sharks (silent), The Pharmacist, The Fatal Glass of Beer, The Barber Shop, and The Dentist.",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWQxZjE3OTAtNGNlMi00YWM4LWE4NGUtZDgyNWNhMjhhOGU5XkEyXkFqcGdeQXVyNjUwMTQ4NjE@._V1_.jpg",
    "keywords": "compilation,comedian,actor",
    "name": "W.C. Fields: 6 Short Films",
    "original_info": {
        "id": "W.C. Fields: Six Short Films_1933",
        "name": "W.C. Fields: Six Short Films",
        "year": "1933"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nena_switch"
        },
        "dateCreated": "2006-12-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0327230/"
        },
        "name": "6 Short Films",
        "reviewBody": "This Collection shows some of WC's early works... it was aeon's before i was born in 1969 and i have to say, from my early childhood memory's... Fiels was one of those who will always last.... This short clips are simply terrible, even if those clips would have been just silent, they're made a huge impact 4 me.... Think he was what the Nasa was for Science, he was much faster than all others.. getting comedy at another level and the things he made where that small but with a huge impact.. this is a must seen collection, so take a look and let the good times roll.. \n\nA Comment bye Phil : \" I really do not understand the charges of \"corny\" and \"cornball\" being leveled at this short. Fatal Glass of Beer parodies the \"cornball,\" this is a source of many of its jokes. Literally everything in this short is a joke. Made just a few years out of the silent era and it's already parodying many of the story elements from that era - the simple, moralistic stories, the stiffness, the preaching, even the technical side of the silents (specifically, the flashback scene where the \"fatal glass\" is imbibed, the action is sped up and the movements exaggerated) is parodied, which for the time this was made was quite sophisticated. Myself, I try to evaluate things for the era they hail from, in context, rather than completely from my own era (which will appear silly one day soon itself). In actual fact, this happens to be perhaps the most perfect of Fields' shorts. Of course, the Gold Specialist and The Dentist both have great bits, but the gags dominated, while Fatal Glass of Beer has more of a sense of structure. I see a lot of the key elements of 20th century humor in this short. It's not mere jokes, it makes fun of speaking patterns, language, technical elements, society, is absurd, and so on. I think you can go back to this one short and almost pinpoint it as one of the pivotal points in the history of comedy in the last century. And the bit with the snow (which Fields brings to our attention is just painted cornflakes) in his face and that classic line - \"T'aint a fit night out for man nor beast\" - is just great. It's crazy, it's inventive, it brings to our attention the fakeness of everything at the same time as it parodies the stiff language often found in types of fiction the short plays off of. And that last little bit - did anyone catch that subtle bit of comedy? After going to the door, saying that line, and getting a handful of cornflakes thrown in his face (obviously by someone just off stage, which again illustrates how this short parodies cheap, stilted stage tricks) throughout the entire short, Fields says it one last time, waits a second for the inevitable handful of flakes, but it never comes. However, he still expects it to come and just before the picture fades he flinches. HE FLINCHES! It's just so, so tiny a gesture, so small and seemingly insignificant a joke, yet it's also hilarious and something I believe only a comedic genius would come up with. What do you want, pies? What do you want, cartoony bouncing off of walls? What do you want, erudite, sophisticated comedy done in a foreign language? No, that final, tiny moment IS comedy. And who can resist some of those great lines (I recall no great lines in an y other Fields short), like \"The city ain't no place for women, gal, but pretty men go thar\" and \"Once the cihity gets in a bhoy's shystem, he lhoses his hankerin' for the chountry\"? And that absurd, insane song! Were you listening? Again, technical methods are parodied. The actor is not playing the instrument for real - it's fake - so it doesn't matter that he plays with his \"mits\" on, the sound still comes out. And the way they speak in that, and all other, scenes, I do not recall ANY earlier example of comedy where they so thoroughly parody and utilize speech patterns and acting styles. Fatal Glass of Beer is not only a parody of the silent era's stiff tendency (watch any moralistic film starring Lilian Gish for reference, where all manner of absurd tragedies befall the hapless heroine) it is also a homage, in part, to the silent Sennet comedies, in that it was made in the sound era but uses elements of the silent. W.C. Fields was a comedic genius, but most, if not all, of his films - both short and long - were disappointing overall, a showcase for a few hilarious bits, but suffering the same thing that a lot of comedies from the era (and all subsequent eras) suffer from - namely, the problem of how to be both a funny comedy and a genuine film that tells an actual story with characters who are not merely mouth-pieces for jokes. Fatal Glass of Beer, in that it is a short film, is relieved of that burden for the most part, so the \"flaws\" it may have are inconsequential, in fact, they are totally understandable. This short stands with Fields best features for this fact alone.\"",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0327230/"
}