{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Laurence Harvey",
            "url": "/name/nm0002131/"
        },
        {
            "@type": "Person",
            "name": "Capucine",
            "url": "/name/nm0001010/"
        },
        {
            "@type": "Person",
            "name": "Jane Fonda",
            "url": "/name/nm0000404/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2673,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0077420/"
        },
        {
            "@type": "Person",
            "name": "Nelson Algren",
            "url": "/name/nm0019346/"
        },
        {
            "@type": "Person",
            "name": "John Fante",
            "url": "/name/nm0266899/"
        },
        {
            "@type": "Person",
            "name": "Edmund Morris",
            "url": "/name/nm0606510/"
        }
    ],
    "datePublished": "1962-03-23",
    "description": "A man arrives in New Orleans searching for his former girlfriend, an artist who now works in a bordello.",
    "director": [
        {
            "@type": "Person",
            "name": "Edward Dmytryk",
            "url": "/name/nm0229424/"
        }
    ],
    "duration": "PT1H54M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI4YzI0NDQtMzU1NS00MzU2LTg1OWMtMDUwMWRhNDc2ZGVkL2ltYWdlXkEyXkFqcGdeQXVyMjI4MjA5MzA@._V1_.jpg",
    "keywords": "1930s,great depression,prostitution,brothel,based on novel",
    "name": "Walk on the Wild Side",
    "original_info": {
        "id": "Walk on the Wild Side_1962",
        "name": "Walk on the Wild Side",
        "year": "1962"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Boomer-51"
        },
        "dateCreated": "2007-06-29",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0056671/"
        },
        "name": "Old style meller trying to bust out of its Production Code corset.",
        "reviewBody": "This film is strangely reminiscent of Pre-Code Barbara Stanwyck pictures like 'Baby Face' or 'Women They Talk About.' But, what makes the film so much fun is its marvelously fractured casting. It's rumored that the film owes its existence to Capucine. Charles Feldman, the talent agent, mounted the production to showcase his protégée and (some say) girlfriend. She's quite a beauty, but what makes her performance so remarkable is that she's totally oblivious to the fact that she doesn't belong in this film.\n\nLaurence Harvey has the Southern accent down. And, as for Jane Fonda, this was the one break in her endless string of coy sex kitten roles from the sixties where she proves she can act. Some say she overdoes it, but I think she provides the real spice in this film.\n\nIn the midst of this batch of newcomers hobbled together from around the world (although they're all playing indigenous Southerners) are two pros trained in the old Hollywood studios. This is hardly a high point for Barbara Stanwyck. But, she proves that you can put her down anywhere - in a screwball comedy, a tearjerker, a hard-boiled film noir, or a TV western - and she can hold her own.\n\nAnne Baxter acquits herself well in the thankless task of playing a humble Mexican. Probably less well known for her accomplishments than Stanwyck, she won an Oscar for playing one of the greatest dramatic arcs given to an actress in the forties in \"The Razor's Edge.\" These two pros give some dignity to a film that easily could have degenerated in to laughable kitsch.\n\nThis film is notorious for its overt portrayal of a lesbian character. But, it actually has a more interesting gay connection. Fonda, against the prohibition of director Edward Dymyrik, was secretly being coached in her dressing room by her 'secretary' and live-in boyfriend Andreas Voutsinas. Six years later, he would set a new benchmark for outrageous mincing queens as Carmen Ghia in Mel Brooks' \"The Producers.\"",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0056671/"
}