{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Catherine Keener",
            "url": "/name/nm0001416/"
        },
        {
            "@type": "Person",
            "name": "Anne Heche",
            "url": "/name/nm0000162/"
        },
        {
            "@type": "Person",
            "name": "Amy Braverman",
            "url": "/name/nm0106010/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3744,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028557/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0090290/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103532/"
        },
        {
            "@type": "Person",
            "name": "Nicole Holofcener",
            "url": "/name/nm0392237/"
        }
    ],
    "datePublished": "1996-07-17",
    "description": "Just as Amelia thinks she's over her anxiety and insecurity, her best friend announces her engagement, bringing her anxiety and insecurity right back.",
    "director": [
        {
            "@type": "Person",
            "name": "Nicole Holofcener",
            "url": "/name/nm0392237/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODVjODIyNDYtZTU2Ny00MDIxLTg1ZTEtYjJlNDkyNDEzNDcwXkEyXkFqcGdeQXVyMTMxMTY0OTQ@._V1_.jpg",
    "keywords": "wedding day,garden party,lack of money,ex boyfriend ex girlfriend sex,female friendship",
    "name": "Walking and Talking",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jotix100"
        },
        "dateCreated": "2005-12-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118113/"
        },
        "name": "Friends",
        "reviewBody": "Some relationships between childhood friends endure the passage of time, as it's the case with Laura and Amelia, who as the film opens are seen as young girls. After some years they have met again as adults and their friendship has a different kind of meaning to both, if anything it is stronger than before. Whereas Amelia has found love and is graduating for a professional career as a therapist, Laura, on the oder hand, has found a job in a newspaper, but her love life leaves a lot to be desired.\n\nNicole Holofcener, the director, takes us to meet these two women as they go through their lives in present day Manhattan. Having seen this film when it made its commercial debut, we decided to take another look after almost ten years of being released and we can report the film is still fresh and quirky as when we first saw it. The director, whose \"Lovely and Amazing\" was also a worthy successor, treats her subjects with a light touch and the result is a film that gives the viewer a good insight about human relations in a cinematic form.\n\nThe best thing going for the film is lovely Catherine Keener, who is an asset no matter what she is playing. Ms. Keener seems to be a natural for the movies. The camera loves this actress who has a style of her own and who, in comedies such as this, makes perfect sense as her directors clearly capitalize on her uncanny sense of how to play the quirky characters in which she has excelled.\n\nAnne Heche, on the other hand, makes a perfect Amelia come true. Ms. Heche is a good actress that always brings something to the roles she plays. Amelia, the young woman in this film, is at a point in her life where she has to make decisions about her relationship with Frank, who clearly adores her, and her own career as a therapist.\n\nThe supporting roles are basically the men in the two friends' lives. There is Frank, who is living with Amelia. He wants her to commit and marry him, but she has doubts before she says yes. Todd Field makes a good impression as Frank. Bill, the video store clerk likes Laura, but feels betrayed when he hears a message Amelia has left on the answering machine where she calls him ugly; he takes offense and decides to drop Laura. Kevin Corrigan is perfect playing this man. Finally there is Andrew, an old flame of Laura's who has broken up with her some time ago, but has remained friends. Liev Schreiber is good in this part.\n\n\"Walking and Talking\" shows a talented Nicole Holofcener at her best. The film shows us a director who knows a lot about the complicated balance of the relationship between two caring friends.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0118113/"
}