{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Christopher Lloyd",
            "url": "/name/nm0000502/"
        },
        {
            "@type": "Person",
            "name": "Howie Mandel",
            "url": "/name/nm0005177/"
        },
        {
            "@type": "Person",
            "name": "Cloris Leachman",
            "url": "/name/nm0001458/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1522,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "Robert Klane",
            "url": "/name/nm0458228/"
        }
    ],
    "datePublished": "1987-04-17",
    "description": "A boy raised by wolves is reunited as an adult with his real family.",
    "director": [
        {
            "@type": "Person",
            "name": "Melvin Frank",
            "url": "/name/nm0291035/"
        }
    ],
    "duration": "PT1H26M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYwNjk4NjI1NV5BMl5BanBnXkFtZTcwNzU1Nzg0NQ@@._V1_.jpg",
    "keywords": "feral man,cat,fish out of water,mall,wolf",
    "name": "Walk Like a Man",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FiendishDramaturgy"
        },
        "dateCreated": "2007-06-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094288/"
        },
        "name": "Sentimental Contrived Schlock Fails On All Levels, Though It Has Heart",
        "reviewBody": "Most movie goers who have bothered to rate this, express their chronic dislike of this work due to Howie Mandell's presence herein; however, I must say that he is no more a harbinger of death to this film than anyone else.\n\nThe performances found within this film are all adequate, with some better than others, but none were lacking such as to lessen the worth of this production. The dialog delivery was also adequate, but the dialog itself was trite, contrived, and slapstick in its execution. Mandell suffers more from poor direction than a lack of talent. Yes, he was an annoying element of his hey day, but he never outright bombed until this work. Christopher Lloyd is better than adequate, but his usual curmudgeonly charm is lost here. Cloris Leachman's performance is the only contributing factor which elevates this work, but she could not save it, alone.\n\nThe story had a good basis which could have netted a great film, but the National Lampoonesque take on the whole premise is the leading contributing factor to this film's demise. The story was watered down and sentimentalized to the point of generating schlock instead of entertainment. There isn't one aspect herein which isn't contrived to suit the story line, including the domestication of the lead character and the time line wherein said domestication takes place.\n\nA young boy is abandoned by his bratling brother and left alone in the wilderness to be raised by wolves. After his rescue, his brother (still a brat) decides Bobo must learn to read and write...immediately! Intrigue ensues.\n\nHad this been treated with more care and a bit more seriously in the right places, this could have been a great comedy, but as is, this one fails on all levels: It does not teach, it does not ponder, and it does not entertain. As it stands, this work does show some serious moments, but they are in the wrong places; the timing is all wrong, and even those with no sense of cinematic timing can feel that the pace is out of step.\n\nAll in all? This is nothing but sentimental, contrived schlock, which fails on all levels...though it DOES have heart.\n\nIt rates a 3.8/10 from...\n\nthe Fiend :.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "As a baby, Bobo gets separated from his family during a camping trip. After being raised by wild dogs for twenty years, Bobo is discovered by animal researcher Penny, who brings him back to his family and attempts to teach Bobo how to readjust to life with humans. While his mother is overjoyed to see him again, Bobo's older brother Henry is more worried about losing his share of the inheritance. As Bobo progresses with Penny's lessons, Henry plots to have him eliminated.",
        "duration": "PT1M49S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi533971737",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmQxZDk5MWItOTk4MC00YmJjLWIyYWItNjMxODdlOWEwMTQwXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmQxZDk5MWItOTk4MC00YmJjLWIyYWItNjMxODdlOWEwMTQwXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-11-24T19:57:26.854Z",
        "url": "https://www.imdb.com/video/vi533971737/"
    },
    "url": "/title/tt0094288/"
}