{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Charlie Sheen",
            "url": "/name/nm0000221/"
        },
        {
            "@type": "Person",
            "name": "Michael Douglas",
            "url": "/name/nm0000140/"
        },
        {
            "@type": "Person",
            "name": "Tamara Tunie",
            "url": "/name/nm0876645/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 159105,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022392/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0065783/"
        },
        {
            "@type": "Person",
            "name": "Stanley Weiser",
            "url": "/name/nm0007140/"
        },
        {
            "@type": "Person",
            "name": "Oliver Stone",
            "url": "/name/nm0000231/"
        }
    ],
    "datePublished": "1987-12-11",
    "description": "An impatient young stockbroker is willing to do anything to get to the top, including trading on illegal inside information taken through a ruthless, greedy corporate raider who takes the youth under his wing.",
    "director": [
        {
            "@type": "Person",
            "name": "Oliver Stone",
            "url": "/name/nm0000231/"
        }
    ],
    "duration": "PT2H6M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNmEyZGQ4NDQtNTEzZC00MDczLWE4ZTEtYTg0ODg2NTkyMWM3XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
    "keywords": "1980s,capitalism,stockbroker,stocktrader,boiler room",
    "name": "Wall Street",
    "original_info": {
        "id": "Wall Street_1987",
        "name": "Wall Street",
        "year": "1987"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Clive-Silas"
        },
        "dateCreated": "2004-01-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094291/"
        },
        "name": "This is Douglas's movie until the Sheens take it over.",
        "reviewBody": "First of all, it's amazing now to see how young, baby-faced and gauche Charlie Sheen looks from this distance in time, particularly when he's trying to hit on Daryl Hannah.\n\nIn today's dumbed down movie world, Gordon Gekko could have been scripted and played exactly the same except for one thing: you'd never see the scene when he suddenly stops to admire the ocean at dawn. Fortunately Michael Douglas clearly added his own dimensions to the character whom, if left to Stone, would have been a cardboard money-grabber. As far as Stone is concerned Gekko wants money for its own sake, but Michael Douglas manages to evince a man who revels in the power and influence that money gets him. Stone's dialogue actually undercuts this perception on occasion, as when Bud Fox yells at Gekko, \"How many yachts can you sail!?\", and when Gekko, enticing Fox by outlining how rich he could be, says, \"Rich enough to have your own jet\" - as if owning a jet wasn't the minimum accoutrement you'd expect from the least successful company director or minor pop star. Other infelicities in the script include the moment when Stone wanted to signal that Bud Fox has reached the peak of success and found it empty: following the montage of the condo purchase and decoration, the perfect meal for two, culminating in making love to Daryl Hannah, Stone has Fox standing on his balcony, and apropos of nothing at all, he just says, \"Who am I?\" It has to be said that Sheen wasn't really up to the task of delivering this atrocious line.\n\nI've rarely seen a film in which the female lead was so comprehensively abandoned by the director. Stone clearly wanted to focus all his attention on Sheen and crucially on Douglas, leaving Hannah floundering and unable to clearly express just how much into Bud Fox her character is at any one time. At the final break-up you almost hear Stone's sigh of relief at being able to get rid of the irrelevant female (probably forced on him by the studio) and concentrate on the man's world of stockbroking.\n\nI seem to be finding a lot of flaws in what is basically a most compelling and watchable film. Despite the complex jargon-riddled technicalities of the subject matter, the movie's plot grabs hold of the viewer from the first scene and never lets go. Of course Douglas dominates most of the movie, until Fox sr. (Sheen sr.) throws the spanner in the works of his son's airline deal. Thank heavens Charlie Sheen took the unbelievably courageous decision to have his own father (instead of Jack Lemmon) play his character's father because the two of them perform an absolute barnstormer of a scene in which every word, inflexion and facial expression is repleat with absolute truth; and it's all the more poignant considering Charlie Sheen's own personal difficulties which faced him in later years, and the well-publicised ups and downs of his relationship with Martin as a result. Had those troubled times preceded this movie, it's hard to imagine the performances could have been any different - that's how good they are.\n\nFantastic character support comes from Hal Holbrook, the always reliable Saul Rubinek and John C. McGinley (who does not seem to have changed at all in the intervening years!), a young James Spader and the magisterial Terence Stamp who understands the unutterable menace with which it is possible to lace the single word \"Mate\"."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from 20th Century Fox Home Entertainment",
        "duration": "PT30S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3554738457",
        "name": "Wall Street",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGU4ZDc2Y2QtMTg3Ny00NzM4LWIyOTMtODU0N2Y3YzMyNTkzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGU4ZDc2Y2QtMTg3Ny00NzM4LWIyOTMtODU0N2Y3YzMyNTkzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-18T12:00:39Z",
        "url": "https://www.imdb.com/video/vi3554738457/"
    },
    "url": "/title/tt0094291/"
}