{
    "@context": "https://schema.org",
    "@type": "TVEpisode",
    "actor": [
        {
            "@type": "Person",
            "name": "Dick Van Dyke",
            "url": "/name/nm0001813/"
        },
        {
            "@type": "Person",
            "name": "Walt Disney",
            "url": "/name/nm0000370/"
        },
        {
            "@type": "Person",
            "name": "Diane Disney",
            "url": "/name/nm0228391/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 812,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "TV-G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0068176/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060584/"
        },
        {
            "@type": "Person",
            "name": "Katherine Greene",
            "url": "/name/nm1093502/"
        },
        {
            "@type": "Person",
            "name": "Richard Greene",
            "url": "/name/nm1088856/"
        },
        {
            "@type": "Person",
            "name": "Jean-Pierre Isbouts",
            "url": "/name/nm1090080/"
        }
    ],
    "datePublished": "2001-09-16",
    "description": "Walt Disney was a great person and he created Disneyland and other things for people all over the world and they are so proud of his great work and Mickey Mouse and Mary Poppins.",
    "director": [
        {
            "@type": "Person",
            "name": "Jean-Pierre Isbouts",
            "url": "/name/nm1090080/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI2NDM4NTY4M15BMl5BanBnXkFtZTcwMzgxMjUyMQ@@._V1_.jpg",
    "keywords": "disneyland,disney,reference to the disney corporation,mouseketeers,walt disney world",
    "name": "Walt: The Man Behind the Myth",
    "original_info": {
        "id": "Walt: The Man Behind the Myth_2001",
        "name": "Walt: The Man Behind the Myth",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Ed-Shullivan"
        },
        "dateCreated": "2017-10-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0296273/"
        },
        "name": "Walt, what a wonderful world you created for so many generations of families",
        "reviewBody": "I have always been interested in the story behind great industries, and/or persons who devoted their lives to make the world a better place. This documentary which provides great insight into both Walt Disney's early life before he created \"The Wonderful World of Disney\" and his latter life when he and his brother Roy (who handled the financing end of the Disney empire) created and then every year grew the Disney brand name to become synonymous with family values and highly entertaining animated and adventure cinema.\n\nI was fully engulfed in learning from this documentary all I could about the history of Walt Disney and the film proved to be worth every minute of film time. Walt passed away at a relatively young age of 65 from lung cancer but his Disney production company was the recipient of 26 Academy Awards, which is a record he holds all by himself.\n\nI laughed, I listened in awe, and I cried in some scenes as Walt's life was not without his own personal tragedies. Although some viewers may see this Disney produced documentary as self promoting the Disney brand, I for one would have loved to have been involved in producing this documentary as in my personal opinion, there are far and few in between who had to overcome so much adversity and with so many financial constraints, but yet Walt persevered and he created an empire with the Walt Disney brand that will eventually go down as one of the most influential companies that denotes family values and a quality of cinema that is unsurpassed by even the big box office CGI (Computer Generated Imagery) films of this century.\n\nMy hat is off to this documentary and I thank the producers for providing a well crafted documentary that explains in some detail (without going into the nitty gritty of the financial deals) the life and the family man, Walt Disney, who loved trains.\n\nI give the documentary a perfect 10 out of 10! Thank you Walt for providing myself and my family so many decades of wonderful entertainment. Ms. Shullivan and I also recently visited Disneyland in California and although we are well past our mid life point we had a hoot!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "timeRequired": "PT1H27M",
    "url": "/title/tt0296273/"
}