{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Peter Sellers",
            "url": "/name/nm0000634/"
        },
        {
            "@type": "Person",
            "name": "Dany Robin",
            "url": "/name/nm0732184/"
        },
        {
            "@type": "Person",
            "name": "Margaret Leighton",
            "url": "/name/nm0500364/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 717,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103193/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0051990/"
        },
        {
            "@type": "Person",
            "name": "Jean Anouilh",
            "url": "/name/nm0030478/"
        },
        {
            "@type": "Person",
            "name": "Wolf Mankowitz",
            "url": "/name/nm0542554/"
        },
        {
            "@type": "Person",
            "name": "Lucienne Hill",
            "url": "/name/nm0384488/"
        }
    ],
    "datePublished": "1962-09-19",
    "description": "This is the end of a glorious military career: General Leo Fitzjohn retires to his Sussex manor where he will write his memoirs. Unfortunately, his private life is a disaster: a confirmed womanizer, Leo has infuriated his wife Emi...",
    "director": [
        {
            "@type": "Person",
            "name": "John Guillermin",
            "url": "/name/nm0347086/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BN2M3ZTEyZmItZmMzNC00YWUxLWI3YzItMjJjNzZmY2ExMDAwXkEyXkFqcGdeQXVyMTQ3Njg3MQ@@._V1_.jpg",
    "keywords": "foreign language adaptation,based on play,independent film",
    "name": "Waltz of the Toreadors",
    "original_info": {
        "id": "Waltz of the Toreadors_1962",
        "name": "Waltz of the Toreadors",
        "year": "1962"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Brevity"
        },
        "dateCreated": "2005-07-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0056673/"
        },
        "name": "Remarks random and relevant",
        "reviewBody": "Forgive me again for being very uninformative and nitpicky. I'm unfamiliar with the play (\"disastrously translated into English setting and characters\" - Halliwell's) and I sure as hell can't discuss the author's oeuvre.\n\n\n* The photography is beautiful, if not entirely consistently so. I especially liked it during one of the heavier scenes involving Sellers and \"wife\".\n\n\n\n* There are some ugly flashback transitions.\n\n\n\n* \"Fawlty\"-heads will see a pre-Sybil Scales, if paying enough attention...\n\n\n\n* ... which can be relatively hard at times.\n\n\n\n* One notices how the actor who plays the innkeeper (John Glyn-Jones, further investigation shows) carries an enormous resemblance to the fine actor Richard Jenkins of \"Six Feet Under\" fame (or of \"The Man Who Wasn't There\" fame). Then, in his second and final scene, what is called out through some galloping if not \"Mr. Jenkins!\" Bizarre.\n\n\n\n* John Le Mesurier seems to have been always reliable (by which I mean the few of his I've seen).\n\n\n\n* Sellers's \"old man\" voice arouses in me questions as to why he was constantly cast in these senior roles (here, flashbacks, yes). Don't get me wrong, though. His performance is as great as you can expect from him.\n\n\n\n* \"I'm old enough to be your aunt.\" Well, you don't look like it.\n\n\n\n* The titular sequence is actually memorable.\n\n\n\n* The ending I liked, which seems to be a common thing with viewers.\n\n\n\n* I have trouble understanding what this eventually is. One minute, there's some silly umbrella fencing, and the next, grave discussion about things marital in nature. I can't really grasp the whole film. That's right, blame my age. But it is all over the place.\n\n\n\n* At any rate, the film is worth a go. I didn't get these \"masterpiece\" vibes that others have gotten out of it, but if not for anything else, it's worth seeing for Sellers doing his thing.\n"
    },
    "url": "/title/tt0056673/"
}