{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eric Portman",
            "url": "/name/nm0692439/"
        },
        {
            "@type": "Person",
            "name": "Dulcie Gray",
            "url": "/name/nm0336588/"
        },
        {
            "@type": "Person",
            "name": "Derek Farr",
            "url": "/name/nm0268006/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 684,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0181667/"
        },
        {
            "@type": "Person",
            "name": "Percy Robinson",
            "url": "/name/nm0732972/"
        },
        {
            "@type": "Person",
            "name": "Terence de Marney",
            "url": "/name/nm0210117/"
        },
        {
            "@type": "Person",
            "name": "Emeric Pressburger",
            "url": "/name/nm0696247/"
        }
    ],
    "datePublished": "1946-11-02",
    "description": "A woman becomes the target of a man who is gradually becoming insane, unable to resist his urge to strangle women to death, but who appears to be purposely leaving pieces of evidence behind.",
    "director": [
        {
            "@type": "Person",
            "name": "Lawrence Huntington",
            "url": "/name/nm0403126/"
        }
    ],
    "duration": "PT1H43M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWJmNzcwYjAtNTNjMS00ZGM1LTk2NjEtM2Y0ZDQ1NWY0MzMzXkEyXkFqcGdeQXVyMzg1ODEwNQ@@._V1_.jpg",
    "keywords": "male female relationship,female female relationship,sister sister relationship,aunt nephew relationship,mother son relationship",
    "name": "Wanted for Murder",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hitchcockthelegend"
        },
        "dateCreated": "2014-01-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0039095/"
        },
        "name": "Just Call Whitehall 1212",
        "reviewBody": "Wanted for Murder is directed by Lawrence Huntington and adapted to screenplay by Emeric Pressburger, Rodney Ackland, Barbara Everest and Maurice Cowan from the play by Terence De Marney and Percy Robinson. It stars Eric Portman, Dulcie Gray, Derek Farr, Roland Culver and Stanley Holloway. Music is by Mischa Spoliansky and cinematography by Mutz Greenbaum.\n\nNifty little thriller noir this, basically it finds Portman as the sinister Victor James Colebrook, a man with murderous instincts born out by bad seed lineage in his family tree. Can intrepid Chief Inspector Conway (Culver) nail his man before he kills yet again? Imperative since Victor has latched onto Anne Fielding (Gray), and although he is in love with her, he doesn't know how long he can contain his blood lust.\n\nThought to be influenced by a real life serial killer, Huntington's movie is very Hitchcockian in tone. Story unfolds by night in a London of dimly lighted foggy streets and dense shadowed parks, and by day it's the hustle and bustle of the city that provides a backdrop of false normalcy. As the tormented Victor goes about his way, leading his double life as a cunning member of society who dotes on his mother – and that of a strangler of women – the makers ensure the surroundings suit the persona.\n\nA chapter of the story set at a carnival pulses with unease, a visit to a wax museum really gets to the heart of the evil, a murder sequence that is off camera strikes all the right terrifying notes, and a quite brilliant passage that sees witnesses come face to face with the killer in Conway's office is superbly performed by all involved. Then there is the finale that plays out at night (naturally) at the Serpentine Lake in Hyde Park. Wonderful!\n\nPortman (A Canterbury Tale/Dear Murderer) was a British treasure, an actor whose career begs for reappraisal by classic film fans. Here he is right on the money as the complex sociopath who detests what he has become and even dangles clues for the police to follow. Yet he also slips easily into society with a measured calmness that is rather chilling. Portman quite simply is excellent. As are Culver and Holloway as the sort of coppers Britain could do with having more of these days!\n\nWith Pressburger as part of the writing team it's no surprise to find the script tight and the dialogue snappy, Huntington (The Upturned Glass) and Greenbaum (Night and the City) never miss the chance to accentuate the psychological tremors by way of smart visuals, and Spoliansky's music is devilishly spectral like. It probably could have been shorn of ten minutes and the Dulcie Gray/Derek Farr romance gets a little twee at times, but this is well worth checking out and deserves to be better known. 8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A woman becomes the target of a man who is gradually becoming insane, unable to resist his urge to strangle women to death, but who appears to be purposely leaving pieces of evidence behind.",
        "duration": "PT1M8S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3382690329",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmYzNzcxN2ItMTAzOC00YmVkLTkzNjgtMWE1MWJkZDdhM2EyXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmYzNzcxN2ItMTAzOC00YmVkLTkzNjgtMWE1MWJkZDdhM2EyXkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-05-05T21:20:54.654Z",
        "url": "https://www.imdb.com/video/vi3382690329/"
    },
    "url": "/title/tt0039095/"
}