{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kenneth Branagh",
            "url": "/name/nm0000110/"
        },
        {
            "@type": "Person",
            "name": "Cynthia Nixon",
            "url": "/name/nm0633223/"
        },
        {
            "@type": "Person",
            "name": "David Paymer",
            "url": "/name/nm0001601/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3162,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005861/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0021243/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0085751/"
        },
        {
            "@type": "Person",
            "name": "Margaret Nagle",
            "url": "/name/nm0619361/"
        }
    ],
    "datePublished": "2005-04-30",
    "description": "The stirring true story of Franklin D. Roosevelt's battle with polio in 1921.",
    "director": [
        {
            "@type": "Person",
            "name": "Joseph Sargent",
            "url": "/name/nm0765121/"
        }
    ],
    "duration": "PT2H1M",
    "genre": [
        "Biography",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjNiNjk3NjYtYTAyZS00ZTQ0LWI4MTQtYjcxNDlkMDExMWUxXkEyXkFqcGdeQXVyNTAyODkwOQ@@._V1_.jpg",
    "keywords": "polio,spa,paralysis,politics,children's hour",
    "name": "Warm Springs",
    "original_info": {
        "id": "Warm Springs_2005",
        "name": "Warm Springs",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "trotter-3"
        },
        "dateCreated": "2005-10-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0423510/"
        },
        "name": "Realistic up to a point",
        "reviewBody": "Having been a a patient at Warm Springs for many years during the 1930s and late 1940s, I feel qualified to critique the HBO movie, Warm Springs. The feel of the period and the scenes of the Warm Springs area were fairly realistic. The Meriwether Inn and the surrounding grounds were located on top of a hill, and not on flat ground. The pool where everyone swam was the authentic pool that FDR asked his friend Edsel Ford to build for him, after he acquired the property. I have swum in the pool many times. FDR was a man of great humor, and this is what is lacking in Kenneth Branagh's portrayal. Branagh completely missed the essence of the man, but so would any actor who attempted to portray FDR. Fred Botts was a great friend of mine, and when he arrived in Warm Springs, it was in the baggage car of the train. His brother accompanied him, and had modified a packing crate for him to rest in. He couldn't sit up for very long without experiencing great discomfort. He could stand up, or he could lie down, so he asked his brother to build him the crate so he could ride in comfort from Pittsburgh to Warm Springs. FDR's first words to him upon Fred's arrival were, \"You must be the skeleton from Pennsylvania.\" Fred was tall and very thin. In 1916, Fred was working toward his debut with the Metropolitan Opera in New York City. Among his admirers and supporters was Enrico Caruso. When polio struck him, his singing career ended, and he returned home to Pennsylvania, where he remained a prisoner in his family home for 10 years. When he arrived at Warm Springs, he and FDR immediately became great friends, and he remained as the registrar of the hospital until his death in the 1950s. He was FDR's favorite singer, and he used his great bass voice to lead the Companions (the term for the first patients of Dr. Roosevelt) in singing at the many picnics that FDR had up on Pine Mountain. He was not the callow youth portrayed in the movie. Tom Loyless was, in fact, the co-owner of the Columbus, GA Ledger, and not a failed newspaperman as portrayed in the movie. Doctor Lovett was the first doctor at the hospital, and he did much good work among the patients. The report he supposedly wrote about FDR's condition is a fiction, as far as I know. The trip to the medical convention in Atlanta was mostly Hollywood propaganda. The pushboys were FDR's invention, and not Helena Mahoney's. FDR's appearance at the Democratic Convention in Houston happened much the way it was portrayed in the movie. Overall, the movie portrayed FDR's family situation fairly accurately. He experienced great pressure from his mother to come to Hyde Park and hide in the family home. It is to his great credit that he did not do this. A final note, it's a pity that FDR's law partner in New York, Basil O'Conner, was left out of the film. FDR persuaded O'Conner to become the Chairman of the National Foundation for Infantile Paralysis. It wasn't long until the March of Dimes became the major funding effort for the National foundation, and Warm Springs was on solid financial ground. Comedian Eddie Cantor came up with the March of Dimes idea.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "url": "/title/tt0423510/"
}