{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Susannah York",
            "url": "/name/nm0948772/"
        },
        {
            "@type": "Person",
            "name": "Michael Shannon",
            "url": "/name/nm0788332/"
        },
        {
            "@type": "Person",
            "name": "Patrick O'Connell",
            "url": "/name/nm0640147/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 182,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017529/"
        },
        {
            "@type": "Person",
            "name": "David Butler",
            "url": "/name/nm0124878/"
        }
    ],
    "datePublished": "1982-02-19",
    "description": "It's 1943 and the American Air Force has come to Market Weatherby, a small East Anglian town. The war weary British and the brash American GIs sometimes clash, but friendships are also forged.",
    "genre": [
        "Drama",
        "Romance",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMzk4MzRlNGUtMzA0Zi00ZmJmLTgzYzItZTBmZGYxYzIzNzY0XkEyXkFqcGdeQXVyMzYyMzU2OA@@._V1_.jpg",
    "keywords": "claim in title,female doctor,timeframe 1940s,world war two in britain,rural setting",
    "name": "We'll Meet Again",
    "original_info": {
        "id": "We'll Meet Again_1982",
        "name": "We'll Meet Again",
        "year": "1982"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dsebbit"
        },
        "dateCreated": "2017-01-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0083501/"
        },
        "name": "The lives of the inhabitants of a small village in WWII are changed forever when a squadron of the American Air force arrives",
        "reviewBody": "I liked the series. I have it on DVD & watch it from time to time. I agree some of the characters are a bit of a caricature and some of the American accents are appalling, but it's worth watching it just for Michael J Shannon who is completely believable as a USAF Major and the chemistry between his character Maj. Kiley and Dr Dereham.\n\nIn response to \"jehaccess6\"'s review - Susannah York was just over 40 when making this (not 50) - 3 or so years older than Michael J Shannon - and I think we're supposed to assume that Maj. Kiley was attracted to and by her character because she was more sophisticated, or perhaps more aloof, or just unavailable? I don't see him falling for her daughter who was frankly too young for him as well as the fact that she rather flung herself at him and followed him around like a lost puppy. We all go for the unattainable, don't we? Furthermore we can't help who we're attracted by can we? \n\nAlthough the quality of the recording isn't brilliant, the series isn't dated because it's set in 1943.\n\nI quite liked the addition of real footage of B-17s and airmen - gave it more authenticity.\n\nIncidentally for those who are wondering, according to the book \"We'll meet Again - the end of an era\" which was a sort of sequel, Maj. Dereham dies so Helen marries Jim Kiley, they go to the USA and he becomes a politician, Vi & Chuck also go to the USA, have a couple of kids and Chuck becomes a dentist, Rosie Blair marries Peter Mundy & they take over the shop when Albert Mundy has a stroke, Hymie marries a friend of Rosie's and Lettie becomes a famous actress via rather dubious methods. Lettie's daughter grows up with the Mundys unaware who her real mother is.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0083501/"
}