{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mohamad Ali El Akili",
            "url": "/name/nm0252581/"
        },
        {
            "@type": "Person",
            "name": "Bushra Karaman",
            "url": "/name/nm0438849/"
        },
        {
            "@type": "Person",
            "name": "Makram Khoury",
            "url": "/name/nm0403374/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 495,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "Wedding in Galilee",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0072662/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0166995/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0078814/"
        },
        {
            "@type": "Person",
            "name": "Michel Khleifi",
            "url": "/name/nm0451674/"
        }
    ],
    "description": "A Palestinian seeks Israeli permission to waive curfew to give his son a fine wedding. The military governor's condition is that he and his officers attend. The groom berates his father for agreeing. Women ritually prepare the bri...",
    "director": [
        {
            "@type": "Person",
            "name": "Michel Khleifi",
            "url": "/name/nm0451674/"
        }
    ],
    "duration": "PT1H53M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOTgzMTc1MTYwMV5BMl5BanBnXkFtZTcwODUyMDUyMQ@@._V1_.jpg",
    "keywords": "female nudity,female frontal nudity,bride and groom,dizziness,arab",
    "name": "Urs al-jalil",
    "original_info": {
        "id": "Wedding in Galilee_1988",
        "name": "Wedding in Galilee",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "msultan"
        },
        "dateCreated": "2003-06-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0094229/"
        },
        "name": "Amazing, but...",
        "reviewBody": "Although I found this moving extremely moving and interesting, I was really aggravated by the useless scenes of nudity and eroticism. It seemed as though it were there only to sell better. Why would an Israeli soldier on duty not be wearing a bra? Why would the Palestinian woman's first impulse be to massage the fainted woman soldier's breast? Why does the younger sister be topless trying her father's kafya on? \"Do women wear bras in the Middle East?\" seems to be the appropriate question to ask after watching this movie. And why the insinuated lesbianism? All this sex is irrelevant to the plot and insulting to the culture, yet it got its point across: on the video cover I rented, 'erotic' was one of the praises by critics. Is it to sell better to a Western audience? This is crowned by the way Samiya decides to honor the tradition. Why not prick her finger the way most women in this situation do? That was too much, because this is definitely something that would not happen, but again, I'm sure it appealed dramatically to those who only look for exoticism and eroticism in the east. Yes, Arabs are repressed, and yes, they are frustrated--for a number of reasons. But that's not what these scenes represented. Apart from that, I did find the movie extremely touching. It's a very charged movie that deals with a lot of important issues. It's also an interesting look into a traditional village's customs -preparing the bride, the 'dokhla', the food, etc. The Arab-Israeli tension is also very well portrayed, as the code of hospitality and the code of honor almost clash. The episode with the horse is highly symbolic and beautiful -I thought I'd find it cliché, but it turned out amazing. Technically, it gets too dark at the end. I wasn't able to tell what happened. This said, I liked the fact that night was night, it adds reality. If it weren't for the useless naked girls, I would give this a 9.5.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0094229/"
}