{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mireille Darc",
            "url": "/name/nm0014800/"
        },
        {
            "@type": "Person",
            "name": "Jean Yanne",
            "url": "/name/nm0946179/"
        },
        {
            "@type": "Person",
            "name": "Jean-Pierre Kalfon",
            "url": "/name/nm0435726/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 15020,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "Weekend",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0039267/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0032877/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0012275/"
        },
        {
            "@type": "Person",
            "name": "Julio Cortázar",
            "url": "/name/nm0181497/"
        },
        {
            "@type": "Person",
            "name": "Jean-Luc Godard",
            "url": "/name/nm0000419/"
        }
    ],
    "datePublished": "1968-09-27",
    "description": "A surreal tale of a married couple going on a road trip to visit the wife's parents with the intention of killing them for the inheritance.",
    "director": [
        {
            "@type": "Person",
            "name": "Jean-Luc Godard",
            "url": "/name/nm0000419/"
        }
    ],
    "duration": "PT1H45M",
    "genre": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjUyMzMwZjctN2ZmOS00NTFlLWI0ZTktZWJhOTI3NjNkOGI0XkEyXkFqcGdeQXVyMjQzMzQzODY@._V1_.jpg",
    "keywords": "cannibalism,setting someone on fire,killing a pig,violence,surrealism",
    "name": "Week End",
    "original_info": {
        "id": "Weekend_1967",
        "name": "Weekend",
        "year": "1967"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "R. J."
        },
        "dateCreated": "2003-02-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0062480/"
        },
        "name": "A surrealist, comic nightmare of roadkill, class struggle, murder and politics",
        "reviewBody": "Jean-Luc Godard's cruelly ironic portrayal of the apocalypse of Western civilization through automobile accidents and petty greed effectively marked the breaking point in his career; after this, he retreated into an overtly political militant cinema for most of the late sixties/early seventies, following some of the leads here first introduced. Whatever plot there is is slowly deconstructed and disassembled throughout the film's length, as a weekend drive by cynical bourgeois couple Mireille Darc and Jean Yanne turns into a surrealist, comic nightmare of roadkill, class struggle, murder and politics as they have to face the progressively more chaotic consequences of their blind ambition and desire for power. Strikingly photographed in long one-take tracking shots, the most celebrated of which showing an apparently endless traffic jam, the film seems to defend the revolt of the proletariat until, by the end, the bourgeois wife is down with the revolutionary Liberation Front of the Seine and Oise, in a cruelly ironic plot twist that literally underlines the cannibal side of politics. With hindsight, many say that \"Week End\", released in 1967, effectively announced the May '68 urban uprisings in Paris and marked the beginning of Godard's politically active phase; personally, I think that Godard sensed the winds of change and jumped on the political bandwagon as a means to find the drive for his cinema to grow. And the cool, cruel detachment he bestows on the politics on display is enough to prove that his irony has seldom been more incisive than when he's being revolutionary."
    },
    "url": "/title/tt0062480/"
}