{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Heather Matarazzo",
            "url": "/name/nm0000525/"
        },
        {
            "@type": "Person",
            "name": "Christina Brucato",
            "url": "/name/nm0115402/"
        },
        {
            "@type": "Person",
            "name": "Victoria Davis",
            "url": "/name/nm1592211/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 35591,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049556/"
        },
        {
            "@type": "Person",
            "name": "Todd Solondz",
            "url": "/name/nm0001754/"
        }
    ],
    "datePublished": "1996-05-24",
    "description": "An awkward seventh-grader struggles to cope with inattentive parents, snobbish class-mates, a smart older brother, an attractive younger sister and her own insecurities in suburban New Jersey.",
    "director": [
        {
            "@type": "Person",
            "name": "Todd Solondz",
            "url": "/name/nm0001754/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGE0N2U2YzItM2NmNy00YTE1LWE1ZjktNWRlMWFhYTQzNzgzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "social outcast,first crush,bully,junior high school,sibling rivalry",
    "name": "Welcome to the Dollhouse",
    "original_info": {
        "id": "Welcome to the Dollhouse_1996",
        "name": "Welcome to the Dollhouse",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "AlsExGal"
        },
        "dateCreated": "2021-09-13",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0114906/"
        },
        "name": "Like a 90 minute punch to the throat...",
        "reviewBody": "... and I somewhat agree with another reviewer who said Dawn's teacher should be euthanized. Except euthanasia is a final release for animals to end their suffering. I expect better from grown women who should have more empathy, if not why are they in teaching? And Dawn's parents - they have no respect or regard for her as a human being whatsoever. She is just a disappointing outgrowth of themselves while they pay attention to Dawn's older brother Mark, who is somewhat like a teenage Bill Gates - an intellectual looking for activities to put on a college application to an Ivy League school, but with zero consideration for anybody but himself. They also dote on Dawn's younger daughter, who although she is only about eight knows she is beautiful and liked and uses it as a weapon against her older sister Dawn. She'll no doubt grow up to be married to a Wall Streeter and be president of her HOA, spending her days measuring the height of other peoples' lawns. So as for the parents AND her teacher - stake them out to an ant hill covered in honey. They deserve it.\n\nDawn Weiner is a 13 year old girl bullied by the entire junior high school, who write obscene things on her locker due to her unfortunate last name, throw spitballs in her hair, question her sexual identity to embarrass her, and even the tough girls confront her and assault her in the bathroom. She is safe nowhere. Nobody has her back and she only exists to be a source of mirth or scorn to everybody else. A less than. She talks to whoever will talk to her, including a boy who introduces himself by threatening sexual assault. I've heard some people say they \"want to shake some sense into her\". But she is 13. What do you expect of somebody who has her life as an experience of what the human race is like?\n\nAnd then she strikes back, in what appears to be a small but passive aggressive way, and suddenly the film segues into an episode of Law & Order SVU, something Dawn was not intending. I'll let you watch and see how this all works out.\n\nDawn is a young girl who is bullied. Of course she is is clueless. She'll arrive at college clueless because she'll never have the confidence building experiences that would cure her cluelessness. This film is essential viewing but be warned it is an exhausting tragedy.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Sony Pictures Classics",
        "duration": "PT1M48S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3556507929",
        "name": "Welcome to the Dollhouse",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTkwNjBhNzMtMGYwZS00ZTNmLTg4YWQtNWE2ODg4NmZhYzYzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTkwNjBhNzMtMGYwZS00ZTNmLTg4YWQtNWE2ODg4NmZhYzYzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:21:53Z",
        "url": "https://www.imdb.com/video/vi3556507929/"
    },
    "url": "/title/tt0114906/"
}