{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Vanessa Redgrave",
            "url": "/name/nm0000603/"
        },
        {
            "@type": "Person",
            "name": "Ian Holm",
            "url": "/name/nm0000453/"
        },
        {
            "@type": "Person",
            "name": "Judi Dench",
            "url": "/name/nm0001132/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1662,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000063/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0103556/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0041491/"
        },
        {
            "@type": "Person",
            "name": "David Hare",
            "url": "/name/nm0002376/"
        }
    ],
    "datePublished": "1985-07-19",
    "description": "The mysterious death of an enigmatic young man newly arrived in the suburb of Wetherby releases the long-repressed, dark passions of some of its residents.",
    "director": [
        {
            "@type": "Person",
            "name": "David Hare",
            "url": "/name/nm0002376/"
        }
    ],
    "duration": "PT1H42M",
    "genre": [
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmFlY2EyZWYtZjllYi00ZmFlLTgyNjUtYTI2ZTFkYTc3NDVkXkEyXkFqcGdeQXVyNjMwMjk0MTQ@._V1_.jpg",
    "keywords": "female police officer,death,british renaissance,blood splatter,shot through the mouth",
    "name": "Wetherby",
    "original_info": {
        "id": "Wetherby_1985",
        "name": "Wetherby",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "trpdean"
        },
        "dateCreated": "2005-05-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0090310/"
        },
        "name": "Heartbreaking",
        "reviewBody": "I've always loved this movie deeply. I just watched it again for perhaps the sixth or seventh time. I fully agree with the Japanese reviewer that the mention of Nixon is in sympathy, not ridicule. His yearning to be loved by another, is very much meant as a parallel to the young and older Redgrave character - as well as to the young man at the dinner party.\n\nDavid Hare has a wonderful scene here that is very similar to the very end of Plenty - when we see Joely Richardson writing in her diary in 1947 or so (think of Plenty's flashback to Meryl Streep in 1944 or 1945 speaking to the French farmer). The scenes might be full of bathos - but gee, I was overwhelmed both times. \n\nThis movie has much in common with other Hare ventures - movies like Strapless and Plenty, plays like Skylight and \"Amy's View\". \n\nHare's deep sympathies are with the romantic, the compassionate, the sensitive, the foolhardy, the collective-minded and the lost. He is antipathetic toward the self-sufficient, the ambitious, the laconic, the individualistic, the successful. I only partly share his sympathy and his antipathy but he makes me appreciate his attitudes through dramas he creates with real living characters. \n\nHare is sentimental in a nostalgic way, and can write wonderfully vivid, intelligent and lost protagonists. I think him a far more intelligent and better dramatist than such left-wingers as Mike Leigh or Ken Loach. \n\nMany of us will see much of ourselves in his protagonists' loneliness, our wonder at mistaken hopes from our past, and sense of our own frailties and faults as we grow older.\n\nOthers speak of similarities to Pinter - I don't see them. Hare is more essentially romantic - even if he doesn't want to be - and I'd place him more with a Jacques Demy than with a Pinter-Mamet and their cold keen patterns of speech and behavior - though granted, he's more concerned with social and political background than Demy.\n\nThis is essentially a sad movie about one who was once happy - and her wonder and self-realization about another sadder than she. \n\nThis movie also started me off on two decades of strongly favoring Joely Richardson in any role - as I had always loved Ian Holm and Vanessa Redgrave. (I realized recently that among my several dozen favorite movies since the mid-1960s, about one quarter seem to have Ian Holm in them!). \n\nIf you like movies like Sunday Bloody Sunday, Butley, Plenty, A Kind of Loving, Quartermaine's Terms - and I do - you'll love Wetherby. I love this movie.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The mysterious death of an enigmatic young man newly arrived in the suburb of Wetherby releases the long-repressed, dark passions of some of its residents.",
        "duration": "PT1M43S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3869098521",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjNmOWY5ZGEtYzY4MS00OGQ3LTlhMzMtNjQ5MmFiNWQyZjA4XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjNmOWY5ZGEtYzY4MS00OGQ3LTlhMzMtNjQ5MmFiNWQyZjA4XkEyXkFqcGdeQWRpZWdtb25n._V1_.jpg",
        "uploadDate": "2022-05-04T19:54:25.885Z",
        "url": "https://www.imdb.com/video/vi3869098521/"
    },
    "url": "/title/tt0090310/"
}