{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Joan Chen",
            "url": "/name/nm0001040/"
        },
        {
            "@type": "Person",
            "name": "Julianna Margulies",
            "url": "/name/nm0000523/"
        },
        {
            "@type": "Person",
            "name": "Mercedes Ruehl",
            "url": "/name/nm0001689/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2823,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0047391/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0015207/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0138032/"
        },
        {
            "@type": "Person",
            "name": "Gurinder Chadha",
            "url": "/name/nm0149446/"
        },
        {
            "@type": "Person",
            "name": "Paul Mayeda Berges",
            "url": "/name/nm0074488/"
        }
    ],
    "datePublished": "2000-12-01",
    "description": "Four families in LA of different ethnicity (Latino, Asian/Vietnamese, African and Jewish) gather together for Thanksgiving dinner.",
    "director": [
        {
            "@type": "Person",
            "name": "Gurinder Chadha",
            "url": "/name/nm0149446/"
        }
    ],
    "duration": "PT1H49M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTgxMDY5MDMwMF5BMl5BanBnXkFtZTYwOTY0ODc5._V1_.jpg",
    "keywords": "dachshund,boxer,nudity,male rear nudity,making tamales",
    "name": "What's Cooking?",
    "original_info": {
        "id": "What's Cooking?_2000",
        "name": "What's Cooking?",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Shiva-11"
        },
        "dateCreated": "2001-02-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0197096/"
        },
        "name": "You'll be craving seconds.",
        "reviewBody": "Holidays are a time for families to come together. More often than not, these little \"reunions\" manage to bring out the worst in people and unpleasant episodes from the past get dredged up and brutally dissected for the thousandth time. Or your parents may take turns pushing your buttons (which of course they programmed in the first place) and endlessly aggravating you with a never-ending barrage of life questions. \"When are you getting married?\" \"When are we getting grandchildren?\" \"What do you intend to do with your life?\" Small wonder that the suicide rate increases exponentially around these times of joy.\n\nRather than limit herself to one family's deluge of dysfunctional dialogue at Thanksgiving, writer/director Gurminder Chadha, zooms in on a multi-family multicultural view of the holiday. We are introduced to the Jewish family with the lesbian daughter and her lover, the Hispanic family with the philandering husband and newly liberated wife, the cross-generational Vietnamese family's struggle with old traditions vs. new realities, and the successful yet fractured African American family. Happy holidays!\n\nUnlike \"The Big Night\" where food is intended to inspire pure sensory decadence, or \"Like Water for Chocolate\" in which it takes on a mystical, magical quality, Chadha's uses food to illuminate the contrasts between the families in the piece. While turkey is served as the main course at every dinner table, it is prepared, cooked and presented very differently by each family. The roasted polenta, fajitas, spring rolls and homemade macaroni and cheese that supplant the side dishes typically associated with Thanksgiving - corn, cranberry sauce and mashed potatoes - further enhance the feeling (and reminded me that I had missed dinner). But movies do not live by food alone.\n\nWhat sets this film apart from its contemporaries is not its parallel, intertwining plots, or the setting, but its execution. Any of the plots could easily provide enough fodder for a full-length movie, which makes their skillful amalgamation in 106 minutes that much more impressive. This is more remarkable when one takes into account that no one in the voluminous (there are dozens of speaking parts) and talented ensemble cast is there as window dressing - every character is solid and has a clearly defined purpose. Rarer still is the fact that the lion's share of screen time is devoted to the development of strong female characters, which might explain what drew Mercedes Ruehl, Julianna Marguelies and Joan Chen to the project. My praise has not yet ended.\n\nThe dialogue is realistic and well written, and the situations, though sometimes tongue-in-cheek, familiar and believable. The pacing is quick, slowing down to take a breather only when the audience needs it, but never leaves the viewer behind. The editing is tight and clean, rarely allowing any one scene to run too long. Finally, the cinematographer deserves congratulations for the exceptionally sumptuous food shots, I swear I could smell the turkey. In movies, as in life however, nothing is perfect.\n\nThe movie does lapse into stereotypes in several instances, for example, could anyone be as truly annoying and clueless as the character of Aunt Bea (played to wonderful excess by Estelle Harris)? I hope not. The film also goes to the sentimentality well a little too often and the ending, while clever, is contrived. While noticeable, these flaws are merely mildly distracting, and do not overwhelm the film.\n\nAs the saying goes, I laughed, I cried, I cringed, it was an experience. * Make reservations to catch this delectable dish as soon as it's served up at your local theater.\n\n*I didn't actually cry, I just got a little something in my eye."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Four families in LA of different ethnicity (Latino, Asian/Vietnamese, African and Jewish) gather together for Thanksgiving dinner.",
        "duration": "PT2M28S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi523813145",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGMwNzkyZWUtNTJiYy00MTI3LWE1ZWQtNTJjODJlNTQ4NDQxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGMwNzkyZWUtNTJiYy00MTI3LWE1ZWQtNTJjODJlNTQ4NDQxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-11-30T10:39:50.560Z",
        "url": "https://www.imdb.com/video/vi523813145/"
    },
    "url": "/title/tt0197096/"
}