{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mel Gibson",
            "url": "/name/nm0000154/"
        },
        {
            "@type": "Person",
            "name": "Helen Hunt",
            "url": "/name/nm0000166/"
        },
        {
            "@type": "Person",
            "name": "Marisa Tomei",
            "url": "/name/nm0000673/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 212615,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0023400/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000700/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028602/"
        },
        {
            "@type": "Person",
            "name": "Josh Goldsmith",
            "url": "/name/nm0326092/"
        },
        {
            "@type": "Person",
            "name": "Cathy Yuspa",
            "url": "/name/nm0951135/"
        },
        {
            "@type": "Person",
            "name": "Diane Drake",
            "url": "/name/nm0236884/"
        }
    ],
    "datePublished": "2000-12-15",
    "description": "A cocky, chauvinistic advertising executive magically acquires the ability to hear what women are thinking.",
    "director": [
        {
            "@type": "Person",
            "name": "Nancy Meyers",
            "url": "/name/nm0583600/"
        }
    ],
    "duration": "PT2H7M",
    "genre": [
        "Comedy",
        "Fantasy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjUyZWE5YmMtNDA2ZC00NzFlLTg0MzktOTgzYjA2ZWE3NmIwXkEyXkFqcGdeQXVyNDk3NzU2MTQ@._V1_.jpg",
    "keywords": "advertising,telepathy,bare foot woman,heterosexuality,f rated",
    "name": "What Women Want",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "meadowlark"
        },
        "dateCreated": "2001-10-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0207201/"
        },
        "name": "It reminded me of one of those late 50's early 60's romantic comedies.",
        "reviewBody": "A new creative director (Helen Hunt) is hired by an ad agency (run by Alan Alda) to bring it up to date by appealing to the women's market. Mel Gibson, an account executive and a real man's man, was slated for that position, and he wants to get rid of Hunt. At her first staff meeting, Hunt gives each person a package of various women's products, and each must come up with a campaign for at least one of the items. \n\nAt home, Gibson tries out the products in a tour de force of cross-dressing. Funny, if not roll on the floor hilarious, and he does it with an aplomb that makes it look so easy that you at the very least have to admire his skill. In the process, Gibson falls into a tub, followed by a live hair dryer, and receives a shock that alters his brain so that he can hear the thoughts of women. As a result, he bowls everyone over, especially Hunt, with his creative insight into the women's market. Now he's got her right where he wants her...or so he thinks. But creative insight turns out to be a two-edged sword.\n\nI liked this one a lot more than I thought I would. It reminded me of one of those late 50's early 60's romantic comedies, at least in its earlier scenes. In fact, I liked it so much that it made me feel sorry for Woody Allen. His \"Curse of the Jade Dragon\" suffers by comparison. I mention it, because Allen's film also stars Helen Hunt and, interestingly, has a similar situationa woman is hired on to bring a company up to date, and she threatens to disrupt the man's career. Even mind-alteration is involved, although of a different kind.\n\nI think the mind-reading premise is brilliant and is set in just the right context, and Hunt and Gibson played off each other very well. I've seen Mel Gibson on a couple of Jay Leno shows, and he seemed ill-at-ease and sometimes a little abrupt, as though he were either very shy, not too bright, or for some reason just didn't want to be there. But what a difference when he's on screen and playing a role that in bygone days would have been filled by Jack Lemmon or Tony Randall or Rock Hudson. Ok, maybe he's not the all-round actor that Lemmon was, but he fit that particular role perfectly. And he even does a bit of a Gene Kelly routine!"
    },
    "url": "/title/tt0207201/"
}