{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kang-sheng Lee",
            "url": "/name/nm0497642/"
        },
        {
            "@type": "Person",
            "name": "Shiang-chyi Chen",
            "url": "/name/nm0155365/"
        },
        {
            "@type": "Person",
            "name": "Yi-Ching Lu",
            "url": "/name/nm0523717/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5126,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "What Time Is It There?",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0032394/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0063768/"
        },
        {
            "@type": "Person",
            "name": "Ming-liang Tsai",
            "url": "/name/nm0158857/"
        },
        {
            "@type": "Person",
            "name": "Pi-ying Yang",
            "url": "/name/nm0946040/"
        }
    ],
    "datePublished": "2001-09-26",
    "description": "A watch salesman meets a young woman soon leaving for Paris and becomes infatuated, so he begins to change all the clocks in Taipei to Paris time.",
    "director": [
        {
            "@type": "Person",
            "name": "Ming-liang Tsai",
            "url": "/name/nm0158857/"
        }
    ],
    "duration": "PT1H56M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTMzNDIzNjYyOF5BMl5BanBnXkFtZTcwODE4OTQyMQ@@._V1_.jpg",
    "keywords": "taipei taiwan,urinating into a bottle,watching tv,payphone,pill",
    "name": "Ni na bian ji dian",
    "original_info": {
        "id": "What Time is It There?_2001",
        "name": "What Time is It There?",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "pjrdct"
        },
        "dateCreated": "2002-02-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0269746/"
        },
        "name": "Understanding WHAT TIME IS IT THERE? (Part1)",
        "reviewBody": "As the credits began to roll after the screening of Tsai Ming-Liang's latest movie What Time is it There? a crowd quickly assembled in front of an enlarged NYT review thoughtfully set up in the lobby. There was a palpable hunger to understand this enigmatic film. Their frustration no doubt was compounded by the feeling that this movie was not just an exercise in absurdity but that something significant was going on. My companion and I left the theater in a similar frame of mind. Being admirers of Tsai and familiar with all his major cinematic works we knew that this one was successful and we marveled at his unbroken string of remarkable films. But this one seemed more of a puzzle than the others and we had to figure it out.\n\nThe story is deceptively simple. A man dies alone in his small apartment he shares with his son (Xiao Kang) and wife. After the interment of his remains and a simple religious ceremony the son returns to his work selling watches on the sidewalk. There he meets an attractive young woman who after examining his merchandise insists on purchasing the very watch Xiao Kang is wearing. He politely refuses but she is adamant and finally persuades him to part with it. He learns she is flying to Paris the next day. Meanwhile his mother is preoccupied with the reincarnation of her husband and dutifully carries out religious practices to ensure his reincarnation is successful. It appears she expects him to return to life or at least attempt to communicate with her. She is devastated by the sudden loss and becomes increasingly unhappy and her efforts at communication border on the hysterical. Xiao Kang is newly fascinated with all things French and inexplicably begins turning all clocks to Paris time. This increasingly becomes an obsession and he goes from changing his own timepieces to adjusting public clocks.\n\nThe scene then shifts to Paris where we follow the young woman through a rather non- descript area of Paris. She seems disoriented and sad, unable to properly communicate with busy Parisians. She occasionally tries to telephone someone but is frustrated in her efforts. Becoming ill in a restaurant she meets a kind fellow Chinese woman she can talk to, but after a thwarted romantic advance towards the woman she is left to wander the streets more miserable than ever. Falling asleep on a park bench, she is robbed of her suitcase by a group of boys who toss it in a lake. The suitcase drifts out of sight but is recovered from the edge by a man who is none other than the dead father. He is then seen slowly walking towards a large illuminated Ferris wheel slowly spinning in the distance. The movie end.\n\nOn the surface What Time is it There? looks a lot like his previous films. Tsai even used the same three actors portraying a family in two other movies, although one should not presume they are the same people. As in his other films, we find sad, alienated people doing strange obsessive things, characters unable to communicate with each other in a sterile, ugly urban milieu, all themes familiar to Tsai's admirers. But that stunning ending changed everything and called into question all that came before it. The questions piled up. Is he dead? Is he reincarnated? Why is he in Paris? What does the girl have to do with him? Is she dead? We looked for answers and as we talked a sort of poetic sense emerged and actions that seemed absurd suddenly became purposeful. Tsai was communicating to us in an indirect metaphorical language, one that had to be decoded, and not simply passively experienced. We were forced to look back for clues, for signs, much like the son and mother looked for signs from the dead father of his imminent reincarnation.\n\nWhat emerged from our discussion was that What Time is it There? is in its essence a spiritual film, a meditation on the meaning of death with conclusions drawn from traditional Buddhist belief and Tsai's own take on the subject. Buddhist symbols of reincarnation abound, though in modern form. The face of a clock, a waterwheel in an urban mall, the great Ferris wheel, are all reminiscent of the traditional Buddhist symbols of reincarnation. The act of turning back clocks may be a modern way Xiao Kang is trying to (consciously or not) manipulate the process, in contrast to the conventional religious methods his mother employs to the same end. Xiao Kang's existence becomes trance-like; he seems to have no customers, and the few encounters he does have take on mystical dimensions. The \"pervert\" who runs off with Xiao Kang's stolen clock may be warning him albeit humorously not to \"screw\" with time. Similarly the prostitute who steals his case of watches perhaps intends a punishment for his insistent interference in matters he does not truly understand. (continued in Part2... )",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Wellspring",
        "duration": "PT2M27S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1054998809",
        "name": "What Time Is It There?",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmUzM2Q5NzgtYTBkOS00MmM0LWExMTctYzgzNWZkNmE0YzZhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmUzM2Q5NzgtYTBkOS00MmM0LWExMTctYzgzNWZkNmE0YzZhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-18T12:04:56Z",
        "url": "https://www.imdb.com/video/vi1054998809/"
    },
    "url": "/title/tt0269746/"
}