{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Emily Grace",
            "url": "/name/nm1296751/"
        },
        {
            "@type": "Person",
            "name": "Judith Ivey",
            "url": "/name/nm0412382/"
        },
        {
            "@type": "Person",
            "name": "Bill Raymond",
            "url": "/name/nm0713209/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1028,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0005689/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0088478/"
        },
        {
            "@type": "Person",
            "name": "A. Dean Bell",
            "url": "/name/nm0067999/"
        }
    ],
    "datePublished": "2016-10-28",
    "description": "A young woman looking to escape her life is rescued on the highway by a friendly couple in an RV. But as the miles pass the couple's motives come into question and a strange mother/daughter relationship evolves.",
    "director": [
        {
            "@type": "Person",
            "name": "A. Dean Bell",
            "url": "/name/nm0067999/"
        }
    ],
    "duration": "PT1H36M",
    "genre": [
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZGU3NTUyNjAtMDhlMC00MzkzLTg4ZGUtMDE1ZTI4MmM4ZTYyXkEyXkFqcGdeQXVyMjM3NTU0NTQ@._V1_.jpg",
    "keywords": "female full frontal nudity,female pubic hair,sex scene,breasts,truck stop prostitute",
    "name": "What Alice Found",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "koolpopoki"
        },
        "dateCreated": "2004-05-16",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0343172/"
        },
        "name": "What Alice Found is a really good movie about growing up in America without the all too common clichés.",
        "reviewBody": "Until I did a Web search on \"What Alice Found\", I didn't realize that the name of the film is embedded in the title of one of Lewis Carroll's books. The book's complete title is \"Through the Looking-Glass (And What Alice Found There)\".\n\nThe Alice of the film comes from a background quite different from that of Lewis Carroll's Alice. Her fresh and assertive character, however, is similar. The movie Alice begins as a young woman in New Hampshire who steals money from her ass-patting boss and takes off for Miami, vaguely planning to study marine biology and play with dolphins. She encounters a middle-aged couple in a motor home (the husband's retired from the military) who rescue her from a strange man at a roadside stop and from her car's breakdown (perhaps caused by their mechanizations).\n\nAs it turns out, the couple is heavily involved in truck stop prostitution and see sweet, young Alice as a promising recruit. The wife (played by Judith Ivey in a performance worthy of some big award) buys Alice sexy clothing and shows her how to apply hot makeup. Initially, Alice passively accepts her ministrations and, with the couple's instructions, does several tricks. The encounter shown in the most detail is quite different from most cinematic sex but may be typical of what most often happens in real life. The man is shy and deferential and apologizes for \"finishing\" too fast.\n\nWhat's wonderful about Alice (and different from her prototypes from Clarissa to Sister Carrie) is that she learns from her experiences and asserts herself. This is how things really are. Prostitution is everywhere. People are neither all good or all bad. Alice leaves the motor home with her well-earned money and a feeling of mutual respect.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0343172/"
}