{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shane West",
            "url": "/name/nm0922342/"
        },
        {
            "@type": "Person",
            "name": "Marla Sokoloff",
            "url": "/name/nm0005448/"
        },
        {
            "@type": "Person",
            "name": "Jodi Lyn O'Keefe",
            "url": "/name/nm0005281/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11211,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029574/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0009767/"
        },
        {
            "@type": "Person",
            "name": "Mark Schwahn",
            "url": "/name/nm0777043/"
        }
    ],
    "datePublished": "2000-03-24",
    "description": "A modern-day remake of the Cyrano DeBergerac tale.",
    "director": [
        {
            "@type": "Person",
            "name": "David Raynr",
            "url": "/name/nm0713527/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BY2RhZWQyOTMtZjU1OC00YmYxLTg3MjUtNTU1ZDcyOTQ4ZDEwXkEyXkFqcGdeQXVyNjU0NTI0Nw@@._V1_.jpg",
    "keywords": "bare chested male,tank top,male partial nudity,male in a shower,male wears underwear",
    "name": "Whatever It Takes",
    "original_info": {
        "id": "Whatever It Takes_2000",
        "name": "Whatever It Takes",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "baumer"
        },
        "dateCreated": "2000-03-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0202402/"
        },
        "name": "Does realism count anymore?",
        "reviewBody": "I thought that the highschool theme died when the 80's became the 90's. I didn't think today's film makers knew who John Hughes was let alone could emulate even his subpar work. In the 80's, as I was growing up, you had sweet, funny, but honest comedies like Sixteen Candles, Breakfast Club, Pretty In Pink and then other hilarious films like Fasttimes at Ridgemont High. These films entertained you and kept you wanting more. They were honest with their humour. But then they just disappeared. Maybe it was that Hughes and Heckerling wanted to make adult comedies like Planes Trains... and Look Who's Talking. I'm not sure but somewhere along the way they became extinct. But then something magical happened last year. After the previous successes of okay films like Can't Harldy Wait and Ten Things I Hate About You, along comes American Pie. \n\nNow American Pie took all that was great about the 80's teen comedies and made it into one hell of a funny film that all generations could enjoy. It revitalized a somewhat stale market. And as great as that is, it is also not so great in the way that you have any idiot with a computer trying to cash in on that craze. Whatever It Takes, is one of those films. I'm not saying it is absolutely terrible, it's just simply not that great. But this film will probably go on to gross somewhere around 15 million and that will probably be a profit for the studio and then it will be considered a success. And then more sub-par films will get made and more teens will go see them and they will not realize that just one generation before them is a library full of the quintessential teen films that are funny, exciting, filled with bathroom humour, nudity, drugs, partying, puking, teens wearing bras on their heads, masturbation, voyeurism, sex sex and more sex. Films from the 80's were the pioneers of the teen genre and when I read comments in here that a film like this one is \" the best teen comedy around \" I feel sorry for the kids today if they feel that way because that obviously means that you have not seen some the great films from the 80's. What a shame!\n\nThe story is quite simple here. Maggie and Brian live next door to each other and both are just friends. Both are attractive people but they don't see the intrigue in one another. They both either want other gorgeous people in school or are coveted by someone else. And so when the school jock tells Brian that he can hook him up with Ashley, the schools ditziest, most self centered, conceited but most gorgeous girl, he jumps at the chance. There is only one catch. Brian has to help jocko get Maggie. \n\n Now Maggie is the best written character in the film. For the most part she seems genuine and honest. And she is beautiful. To put the two of them side by side ( Maggie and Ashley ) one wonders why Brian wouldn't have gone for his friend long ago. But that is besides the point. The point is, that this is where the film fails miserably. Maggie is too real of a character for this film. She actually looks like she was a substitute character for the film American Pie that was cut at the last minute and then drafted by the creator's of this film. Why she would fall for the school jock that has as much charm and wit as a doorknob is not fair to her character. She is better than that. And this is where the film falls. Too many situations are just flat and there are too many characters that are just caricatures of a comic book person. They do things that no other teen does, they act like no other teen does and they talk like no other teen does. It would have been nice if only once or maybe even twice the character did one thing that seemed real, not like it was written by four or five guys in a screenplay. That would have given the film a much more authentic quality to it.\n\nWhatever it Takes isn't all bad. It does have it's humourous moments but not enough of them to save a poor screenplay. There is a reason American Pie made $100 million at the box-office and why a film like this one won't. It's called honesty in your humour. Pie has it....Takes doesn't. Enough said.\n\n5 out of 10"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Sony Pictures Home Entertainment",
        "duration": "PT2M25S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi853672217",
        "name": "Whatever It Takes",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNThmM2QyOGUtYjgzYi00ZTA2LTkzMjYtMDBmYzY4ODI5YjdlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNThmM2QyOGUtYjgzYi00ZTA2LTkzMjYtMDBmYzY4ODI5YjdlXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-18T12:05:07Z",
        "url": "https://www.imdb.com/video/vi853672217/"
    },
    "url": "/title/tt0202402/"
}