{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        },
        {
            "@type": "Person",
            "name": "The Lovin' Spoonful",
            "url": "/name/nm0522722/"
        },
        {
            "@type": "Person",
            "name": "Frank Buxton",
            "url": "/name/nm0125518/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9757,
        "ratingValue": 5.9,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022781/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002219/"
        },
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        },
        {
            "@type": "Person",
            "name": "Frank Buxton",
            "url": "/name/nm0125518/"
        },
        {
            "@type": "Person",
            "name": "Louise Lasser",
            "url": "/name/nm0489837/"
        }
    ],
    "datePublished": "1966-11-02",
    "description": "A Japanese James Bond -esque spy flick reused and redubbed into the plot of a secret agent searching to uncover a recipe for the world's greatest egg salad in Woody Allen's directorial debut.",
    "director": [
        {
            "@type": "Person",
            "name": "Woody Allen",
            "url": "/name/nm0000095/"
        },
        {
            "@type": "Person",
            "name": "Senkichi Taniguchi",
            "url": "/name/nm0849474/"
        }
    ],
    "duration": "PT1H20M",
    "genre": [
        "Adventure",
        "Comedy",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWNhNjM2NzQtMzdlMi00MTZiLWJkYmEtZmYzMjFlMDk3Zjg5XkEyXkFqcGdeQXVyNjQ2MjQ5NzM@._V1_.jpg",
    "keywords": "spy spoof,farce,spy comedy,spy parody,parody",
    "name": "What's Up, Tiger Lily?",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BrandtSponseller"
        },
        "dateCreated": "2005-01-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0061177/"
        },
        "name": "One of the few Woody Allen films that doesn't work for me",
        "reviewBody": "Woody Allen gives a Japanese-directed James Bond-styled actioner a new soundtrack, including different dialogue telling a new story. Allen's changes turn the film into a spy versus spy quest for the recipe of the world's best egg salad.\n\nI'm a huge Woody Allen fan. The idea behind this film is promising and the basic premise of Allen's story, grafted on to a pre-existing film, International Secret Police: Key of Keys (Kokusai himitsu keisatsu: Kagi no kagi), from 1965, by Senkichi Taniguchi, is funny, if silly. However, this is one of the very few Allen films that just doesn't work for me. The Taniguchi film seems chopped up to a point of incoherence (maybe it's presented here in its entirety and in the same order, but that would mean that its running time is around 60 minutes or less), although that could be a factor of the changed dialogue. I found myself wishing there was an alternate soundtrack that was a legitimate dubbing of the original film.\n\nAlthough there are a few very funny scenes, one-liners and ideas in Allen's new story, most of it isn't very funny. Too many scenes seem like they may be serious translations of the Japanese dialogue. There are too many occurrences of silly vocal noises, but not enough to make that a motif so that it's funny. There are too many long sections where the film is mostly boring. The untranslated beginning goes on far too long. The mini-interview with Allen that explains the film's premise would only be funny if it weren't true. The Lovin' Spoonful scenes aren't funny, and perhaps weren't intended to be--they seem like a studio attempt to try to put more butts in theater seats upon the film's release by featuring a popular rock group. It doesn't seem like Allen spent much time on thisthe dialogue seems largely improvised and mostly disjointed. In short, the film is basically a mess, and only worth viewing for Woody Allen completist, and men with a serious Asian woman fetish (it's also worth noting that Taniguchi seems to share a foot fetish).\n\nWhat would have worked better, and probably would have made the film much funnier, is if Allen would have written and directed both the film that we're seeing visually and a completely different story for the soundtrack. Much more time would have to be spent crafting each component to make them seem unrelated but coherent and funny. That's an experiment that remains to be done, to my knowledge.\n\nThere are enough positive aspects that the film doesn't deserve a 1--as I noted, there are times that What's Up, Tiger Lily is funny--but the best I can do is a 5 out of 10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this Woody Allen comedy",
        "duration": "PT2M24S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1089536537",
        "name": "What's Up, Tiger Lily?",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjhmYzhiYjQtY2NiNy00ZDEwLTgxZTctOGJiODU5OGNlNjE2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjhmYzhiYjQtY2NiNy00ZDEwLTgxZTctOGJiODU5OGNlNjE2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-06-11T05:39:06Z",
        "url": "https://www.imdb.com/video/vi1089536537/"
    },
    "url": "/title/tt0061177/"
}