{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Harrison Ford",
            "url": "/name/nm0000148/"
        },
        {
            "@type": "Person",
            "name": "Michelle Pfeiffer",
            "url": "/name/nm0000201/"
        },
        {
            "@type": "Person",
            "name": "Katharine Towne",
            "url": "/name/nm0870007/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 129709,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0819670/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0038131/"
        },
        {
            "@type": "Person",
            "name": "Clark Gregg",
            "url": "/name/nm0163988/"
        },
        {
            "@type": "Person",
            "name": "Sarah Kernochan",
            "url": "/name/nm0449576/"
        }
    ],
    "datePublished": "2000-07-21",
    "description": "The wife of a university research scientist believes that her lakeside Vermont home is haunted by a ghost - or that she is losing her mind.",
    "director": [
        {
            "@type": "Person",
            "name": "Robert Zemeckis",
            "url": "/name/nm0000709/"
        }
    ],
    "duration": "PT2H10M",
    "genre": [
        "Drama",
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTY4NjNkMTMtNTEyOC00NDBiLWFkZjMtZDkwYzU3OTFjOTkzXkEyXkFqcGdeQXVyNTUyMzE4Mzg@._V1_.jpg",
    "keywords": "hitchcockian,death by drowning,secret,ghost,panic",
    "name": "What Lies Beneath",
    "original_info": {
        "id": "What Lies Beneath_2000",
        "name": "What Lies Beneath",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Rusty-61"
        },
        "dateCreated": "2000-07-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0161081/"
        },
        "name": "Don't Believe the (Bad) Hype!",
        "reviewBody": "I spent hours last week on the net, reading reviews, and boy, were they rough on this flick. Most reviewers went out of their way to say it was boring, stupid, unoriginal, a waste of time, how Harrison Ford looked so old he should retire (more on that later), and one critic even went so far as to compare it to \"Battlefield Earth\" for Godssake! Needless to say, I had such low expectations that I went to see it by myself (not wanting to subject friends or family members after hearing how awful it was). I even considered skipping the first half because I heard Harrison Ford wasn't on screen much for the first hour. While WLB was not the scariest or most exciting movie of all time, I left the theater glad I saw it. Unfortunately for me, a careless reviewer gave away 99% of the 'twists' in the story line, and the trailers already gave 75% of it away anyway, so there was only one real surprise.\n\nThe surprise turned out to be that I actually had fun. I think everyone already knows the set-up and plot by now, so I won't bother with a sypnosis. I will say that every seat was full (another surprise) and there were more screams from the audience than I've heard during a movie in years. We're talking over a dozen times where half the audience yelped/jumped in shock and a handful of moments where everyone screamed. Loudly. We are talking adults here too, not nervous little kids. In all fairness, many of the jumps are the 'fake' kind that you are all too familiar with if you've seen enough horror/suspense films, i.e. \"OH GOD! You almost scared me half to death sneaking up on me like that\". The movie also frequently employs the device where a character is in frame, the camera pans along with them out of frame for a second, then we pan back and someone/something has suddenly appeared in the frame behind them-cheap shot, but it works. Many reviewers complained that the score was overdone, with a loud blast of music in the scare scenes to ensure everyone jumped. Honestly, I couldn't tell whether or not this was the case, because the audience's yelling covered it up! There is one *very* big unexpected jump-trust me, you'll know it when you see it-that will probably end up on a lot of 'scariest moments' lists, I am ashamed to say I SCREAMED at the top of my lungs like a little girl, and so did everyone else in the theater, including grown men. (note: if you do decide to see this movie, see it with a group of friends or at least a significant other, because you will have much more fun (I found that it's pretty embarrassing sitting there all by yourself and suddenly yelling and spilling your candy).\n\nOn the negative side, there are many cliched horror movie moments, and the dialogue wasn't exactly brilliant. There were also parts where they over-did the foreshadowing to the point of insulting my intelligence. Example: \"Call on the cell phone, we're running late\" \"Oh, the cell phone doesn't work\" \"That's right, the cell phone won't work in the middle part of this bridge.\" \"Yes, I forgot about the fact that the cell ph--\" OKAY! WE'VE GOT IT NOW! THANK YOU! So, the script could have used a polish, but not enough to ruin the movie. Another complaint I've heard is that the movie \"rips off\" Hitchcock's films (a collapsing character pulls a shower curtain down off the hooks with her, a character is named Norman, etc) but I do know the difference between a ripoff and a loving tribute, and Zemeckis knows what he's doing, I highly doubt he was trying to trick the audience into thinking these were his original ideas. For the record, Harrison Ford still looks great with his shirt off, better than some actors in their 30's. He has recently reached the point where he can not pass for a man in his early 40's, but compared with other actors in their late 50's, he still looks mighty fine, especially without that unflattering \"angry brush\" spiky hair style he's had in his last couple of films. Let's just say there were plenty of women there with biiig smiles on their faces during the love scenes. When he gives that sexy crooked boyish grin, about 20 years instantly drop from his face.\n\nOK, enough rhapsodizing about Harrison Ford, back to the movie. Diana Scarwind as Claire's best friend is funny and lightens up the tone. Michelle Pfieffer is wonderful, making some of the corny dialogue sound genuine. Many less talented actresses would simply go into \"woman in peril\" mode, but her acting is very impressive, and even the critics who really hated the movie gave her credit for that. Oh, and speaking of aging well, there were plenty of males in the audience looking pretty happy during the love scenes too. So guys, if your date or wife votes to see this \"chick flick\", don't make her drag you- you'll have a much better time than you think. Sure, this movie is no all-time horror classic, but it is a fairly intelligent, entertaining, thrill ride of a movie that deserves a much better chance than the critics are giving it."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Dreamworks",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1004667161",
        "name": "What Lies Beneath",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmMxMzhiM2MtY2U4YS00NGVjLWI3YTYtYTgwODM2M2JhN2IzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmMxMzhiM2MtY2U4YS00NGVjLWI3YTYtYTgwODM2M2JhN2IzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-18T12:04:46Z",
        "url": "https://www.imdb.com/video/vi1004667161/"
    },
    "url": "/title/tt0161081/"
}