{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Moreno De Bartoli",
            "url": "/name/nm0195617/"
        },
        {
            "@type": "Person",
            "name": "Predrag 'Miki' Manojlovic",
            "url": "/name/nm0543547/"
        },
        {
            "@type": "Person",
            "name": "Mirjana Karanovic",
            "url": "/name/nm0438905/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9733,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "alternateName": "When Father Was Away on Business",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0049004/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0001263/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0057374/"
        },
        {
            "@type": "Person",
            "name": "Abdulah Sidran",
            "url": "/name/nm0796710/"
        }
    ],
    "datePublished": "1985-10-11",
    "description": "A family is deeply affected by the father's extramarital affairs and the turbulent consequences of the Tito-Stalin split.",
    "director": [
        {
            "@type": "Person",
            "name": "Emir Kusturica",
            "url": "/name/nm0001437/"
        }
    ],
    "duration": "PT2H16M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU5Nzk3NDEzMl5BMl5BanBnXkFtZTcwMTQzMDgyMQ@@._V1_.jpg",
    "keywords": "bosnia,male circumcision,male genital mutilation,politics,false accusation",
    "name": "Otac na sluzbenom putu",
    "original_info": {
        "id": "When Father Was Away on Business_1985",
        "name": "When Father Was Away on Business",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "howard.schumann"
        },
        "dateCreated": "2005-07-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0089748/"
        },
        "name": "Courageous, funny, and deeply moving",
        "reviewBody": "Winner of the award for Best Film at the 1985 Cannes Film Festival and Academy Award nominee for Best Foreign Film, Emir Kusturica's When Father Was Away on Business is a blend of comedy, family drama, and political realism that is courageous, funny, and deeply moving. The title of the film refers to the lie told to a six-year-old to cover up the fact that his father was serving time in a labor camp for making a thoughtless remark that offended the Communist apparatchiks. Set in Yugoslavia in 1950 after the break between Stalin and Tito, it was a time of confusion when people worshiped Stalin one week and despised him the next. The story is told from the perspective of six-year-old Malik (Moreno D'E Bartolli) and his performance is natural and convincing.\n\nHis father Mesa (Miki Manojlovic) is a low-level bureaucrat who spends more time womanizing and drinking than attending to his job. A casual remark filled with sarcasm about a political cartoon made to his wife Sena's (Mirjana Karanovic) sister-in-law Ankica (Mira Furlan), leads to his arrest and detention by Zijo (Mustafa Nadarevic), a Communist Party official who also happens to be his wife's brother. Mesa is sent to work in the mines while Sena becomes a seamstress to make ends meet and his sensitive son starts sleepwalking, perhaps a wry metaphor for the status of the people under Marshal Tito.\n\nThe family does reunite when Mesa is sent to a remote settlement for further re-socialization but he does not change his ways and visits prostitutes with the party official in charge of his rehabilitation, using Malik as his escort. In a sub-plot, Malik (who looks and acts more like ten or eleven than six) \"falls in love\" with a girl about his age who is suffering from a serious blood disorder and their inevitable separation is quite touching. Though family relations are strained, especially between Sena, Zijo, and Ankica, the family is very strong and we know that somehow they will endure. When Father Was Away on Business is perhaps the least daring cinematic ally of all of Kusturica's works but it is one of the most heartfelt and gained the director his first international success, paving the way for the full maturation of his vision in the brilliant and disturbing Underground.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0089748/"
}