{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hank Aaron",
            "url": "/name/nm0007459/"
        },
        {
            "@type": "Person",
            "name": "Mel Allen",
            "url": "/name/nm0020827/"
        },
        {
            "@type": "Person",
            "name": "Elden Auker",
            "url": "/name/nm0042005/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 186,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0030292/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0008693/"
        },
        {
            "@type": "Person",
            "name": "Steven Stern",
            "url": "/name/nm0827853/"
        }
    ],
    "datePublished": "1992-07-13",
    "description": "Film consists solely of 8mm and 16mm film taken by players and fans from 1925 to 1961. All but approximately 6 minutes of the film is in color. Also includes literary passages, remembrances from players, writers and broadcasters, ...",
    "duration": "PT58M",
    "genre": [
        "Documentary",
        "History",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTczNTQxNTk0NF5BMl5BanBnXkFtZTcwNTUxOTUxMQ@@._V1_.jpg",
    "keywords": "baseball,home movie",
    "name": "When It Was a Game 2",
    "original_info": {
        "id": "When It Was a Game 2_1992",
        "name": "When It Was a Game 2",
        "year": "1992"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2012-03-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0274213/"
        },
        "name": "Great Follow-up",
        "reviewBody": "When It Was a Game 2 (1992) \n\n*** 1/2 (out of 4) \n\nSequel to the 1991 HBO hit once again takes 8 and 16mm footage shot by MLB players and fans and present them for the first time. As with the first film, the footage here is certainly beautiful to look out and there's no question that we're lucky that the majority of this event exists for future generations to enjoy. I think the most interesting thing is just being able to see the uniforms, gloves, stadiums and of course the people who went to ballgames back in the day. Another major plus is that we get to see some famous faces including one bit where we see Tommy Lasorda when he was playing in the Minor Leagues. Some of the funniest footage comes when they talk about the cameras used at the time and how photographers for newspapers had to actually stand on the field while the game was going on to get the shots they wanted. There's a great clip of a batter swinging and behind him and on the side are four or five cameramen. Of course, the documentary also succeeds at just showing how different the game was back then in terms of how it was played but it also shows how they faced the same problems as teams today. There's a great bit about teams like the St. Louis Browns not having enough money to pay their bills so they'd have to sell players to the Yankees. We even get some nice stories and footage from the Pacific Coastal League. All of the footage is in color with the exception of about four minutes and this here is perhaps the most priceless footage because it shows Babe Ruth and Lou Gehrig in their Barnstorming days. There's also a lot of talk about the low wages paid back in the day (sometimes $850 a month) and how players really were connected to fans because a lot of times they were making the same amount of money. We even get a priceless shot of a retirement party where the player got a shotgun and two hunting dogs. The film closes with some great footage of Babe Ruth and we get a fitting tribute to the legend."
    },
    "url": "/title/tt0274213/"
}