{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Liev Schreiber",
            "url": "/name/nm0000630/"
        },
        {
            "@type": "Person",
            "name": "Andre Braugher",
            "url": "/name/nm0105672/"
        },
        {
            "@type": "Person",
            "name": "Kevin Costner",
            "url": "/name/nm0000126/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 184,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Person",
            "name": "Steven Stern",
            "url": "/name/nm0827853/"
        }
    ],
    "datePublished": "2000-07-17",
    "description": "The third part of the documentary series takes a look at the changing face of baseball in America during the 1960's.",
    "director": [
        {
            "@type": "Person",
            "name": "George Roy",
            "url": "/name/nm0747025/"
        }
    ],
    "genre": [
        "Documentary",
        "History",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzY2MGQwN2EtMzZkMi00NjdiLWFkZTgtYTVmZDBjMTU0ZmNiXkEyXkFqcGdeQXVyNzM5MzY2MDg@._V1_.jpg",
    "keywords": "retrospective,six word title,home movie,baseball",
    "name": "When It Was a Game 3",
    "original_info": {
        "id": "When It Was a Game 3_2000",
        "name": "When It Was a Game 3",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "planktonrules"
        },
        "dateCreated": "2013-12-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0283683/"
        },
        "name": "A better title might have been \"My, How Baseball Has Changed\".",
        "reviewBody": "This third installment of \"When It Was a Game\" is a rather sad and wistful one. Compared to the first two installments which focused a bit more on the 40s and 50s, this 60s edition spends most of its energy talking about how the game changed in the 60s--and much of it not, apparently, for the better.\n\nAmong the many topics covered are the amazingly great Yankees of the early to mid 60s and their rapid fall by the end of the decade, free agency, black players in the National League, shifts in the number and locations of teams as well as new (rather sterile) stadiums. Of these changes, the one that has affected the game most today seems to be free agency and how players now have rights to leave for teams offering the most money. I think the film said it best concerning this is \"What's bad for players is great for fans\". In other words, while the almost feudal approach to players in the old days wasn't fair--but it encouraged folks to care about teams and their players. Today, with so many lineup changes each season, loyalty is compromised. Overall, a neat film that recalls the 'good old days'--back when baseball was more important to Americans.\n\nSo is this a great film or what? Well, it depends on you to some extent. My wife is no sports fan and she laughed at the almost religious tone of the film when talking about what is a game! She's right but some folks would probably love this. As for me, a guy who used to love the game back in the 60s, I enjoyed it more but have a few quibbles. Like the other films, the players in the clips are often not identified--and never is their name shown on the screen. While this was not a huge problem for me since I recognized most of the players, it sure would make things easier for younger viewers. Also, like the other films there are just voice-overs--and I wanted to see the players TODAY as they look today talking about the game. A far from perfect but enjoyable ode to baseball of old.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0283683/"
}