{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Muhammad Ali",
            "url": "/name/nm0000738/"
        },
        {
            "@type": "Person",
            "name": "George Foreman",
            "url": "/name/nm0286040/"
        },
        {
            "@type": "Person",
            "name": "Don King",
            "url": "/name/nm0005091/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 18419,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0001152/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0031263/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0030612/"
        }
    ],
    "datePublished": "1997-02-14",
    "description": "Boxing documentary on the 1974 world heavyweight championship bout between defending champion, George Foreman, and the underdog challenger, Muhammad Ali.",
    "director": [
        {
            "@type": "Person",
            "name": "Leon Gast",
            "url": "/name/nm0309382/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Documentary",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ4NjU3MzI3NF5BMl5BanBnXkFtZTgwMjYyODU3MDI@._V1_.jpg",
    "keywords": "title fight,africa,fistfight,boxing sport,sweaty body",
    "name": "When We Were Kings",
    "original_info": {
        "id": "When We Were Kings_1996",
        "name": "When We Were Kings",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dtucker86"
        },
        "dateCreated": "2003-10-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118147/"
        },
        "name": "a great documentary",
        "reviewBody": "This film won a slew of critical praise (as well as quite a few awards) and it deserves all of them. Muhammad Ali is the most amazing athelete of the twentieth century and perhaps the most beloved boxer of all time. A public poll once showed that people all over the world recognized him more then the President of the United States. Maybe its because he is such an ill, tragic figure today that this film is so important because it shows him in all his glory when he was not just a magnificent boxer but a ringing voice of social conscience as well. This film shows him again in all his glory when he took on the seemingly invincible giant George Foreman. George is such a beloved figure now that people have forgotten that when he first won the Heavywieght Crown from Joe Frazier in 1973, that he was as dreaded and feared as Sonny Liston was in his heyday. Howard Cosell was one of Ali's most ardent supporters (he was one of the first to call him by that name and support him in his opposition of the draft) and yet even Cosell said that he didn't think that Ali could beat George Foreman. Ali had lost to Joe Frazier and Ken Norton and had barely won rematches with them, and Foreman knocked both of them silly in less then two rounds. Ali was almost 33 years old and considered all washed up and yet he showed no fear against this man. He told the public \"You think you were shocked when Nixon resigned, wait till I whip George Foreman's behind!!!\" This film brings that time and place in Zaire, Africa to life. Don King is a despicable character and yet he was a genius in promoting this fight in Africa. He said it was like from slaveship to championship. The symbolism was just tremendous. Norman Mailer and the late George Plimpton are two of the writers who most observed Ali and they both offer wonderful insights during the course of this film. They are especially good when they talk about the fight itself and how they both had a ringside seat. George Plimpton saw Bobby Kennedy shot and yet I don't think he was much more astounded when he saw what happened in that ring when Ali pulled off an amazing upset and knocked out Foreman to begin another glorious championship rein. It is almost comical when they show their shocked faces as Ali delivered the knockout blow. The best part of the film is where they play the song \"When We Were Kings\" at the end and show a montage of Ali's fights during his amazing career. You will look at these and realize how awesome this man truly was!!!"
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Theatrical Trailer from Gramercy Pictures",
        "duration": "PT1M43S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi585236761",
        "name": "When We Were Kings",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGZkZTU0ZTItODk2OC00OWYzLTgxZTctYzNiNjdlOGYzNWIxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGZkZTU0ZTItODk2OC00OWYzLTgxZTctYzNiNjdlOGYzNWIxXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-18T12:05:48Z",
        "url": "https://www.imdb.com/video/vi585236761/"
    },
    "url": "/title/tt0118147/"
}