{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jeff Anderson",
            "url": "/name/nm1998839/"
        },
        {
            "@type": "Person",
            "name": "Bryan",
            "url": "/name/nm11344835/"
        },
        {
            "@type": "Person",
            "name": "Jason Cavallo",
            "url": "/name/nm1173659/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 389,
        "ratingValue": 5.8,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0032422/"
        }
    ],
    "datePublished": "2003-12-02",
    "description": "Non-fiction account of three men as they find their place in the Circuit Party Scene.",
    "director": [
        {
            "@type": "Person",
            "name": "Stewart Halpern-Fingerhut",
            "url": "/name/nm0356966/"
        },
        {
            "@type": "Person",
            "name": "Lenid Rolov",
            "url": "/name/nm1173114/"
        }
    ],
    "duration": "PT1H",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjA5MDQ1NzEzMl5BMl5BanBnXkFtZTcwNzQ2NTAwMQ@@._V1_.jpg",
    "keywords": "circuit party,gay interest,drug addiction,sex,male nudity",
    "name": "When Boys Fly",
    "original_info": {
        "id": "When Boys Fly_2002",
        "name": "When Boys Fly",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "shomrig"
        },
        "dateCreated": "2002-08-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0318828/"
        },
        "name": "Honest look at gay subculture",
        "reviewBody": "It might be a good thing that I've never seen \"Circuit\", which is the film that everyone seems to keep comparing this piece to. I got to see \"When Boys Fly\" when it appeared at the Austin Gay and Lesbian International Film Festival and really enjoyed the experience.\n\nThis is a film about a circuit party, one of those big all-night events frequented by gay die-hard participants who will travel across the country. For those of you still in the dark, a circuit party is basically a rave, except the guests are almost all gay and in a variety of age ranges and occupations. Oh yeah, and there's a LOT of sex and drugs.\n\nI saw this movie two days before attending my first circuit party and it both excited and intimidated me. The subjects clearly explain that they attend these events despite the fact that others may think they're lame or laden with too many drugs or simply too expensive. Obviously, these are gay men, and as many of us know, gay men rarely conform to what the rest of society calls \"normal\", which I suppose is part of what these circuit parties are all about: the chance to express yourself through dance, partying, and hanging with friends.\n\nIt all comes out as great fun; the actors/subjects are cute, funny, and for the most part we really care about them. I came out of the theater feeling as hungover as those in film, however, as the moral of the story is crystal clear: too much of a bad thing can be destructive. One should never think one is too smart to get swallowed up by the party scene."
    },
    "url": "/title/tt0318828/"
}