{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Natalie Portman",
            "url": "/name/nm0000204/"
        },
        {
            "@type": "Person",
            "name": "James Frain",
            "url": "/name/nm0289656/"
        },
        {
            "@type": "Person",
            "name": "Ashley Judd",
            "url": "/name/nm0000171/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 35028,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0028602/"
        },
        {
            "@type": "Person",
            "name": "Lowell Ganz",
            "url": "/name/nm0304665/"
        },
        {
            "@type": "Person",
            "name": "Babaloo Mandel",
            "url": "/name/nm0541632/"
        },
        {
            "@type": "Person",
            "name": "Billie Letts",
            "url": "/name/nm0504819/"
        }
    ],
    "datePublished": "2000-04-28",
    "description": "A pregnant seventeen-year-old rebuilds her life after being abandoned by her boyfriend at a Walmart in Sequoyah, Oklahoma.",
    "director": [
        {
            "@type": "Person",
            "name": "Matt Williams",
            "url": "/name/nm0931285/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMGZkNjMxYWItYzRjZC00MzA2LWE0YWYtYjIzMmU2MTJiNmEyXkEyXkFqcGdeQXVyMTA0MjU0Ng@@._V1_.jpg",
    "keywords": "small town,library,woman holds a baby,body part in title,four word title",
    "name": "Where the Heart Is",
    "original_info": {
        "id": "Where the Heart Is_2000",
        "name": "Where the Heart Is",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FlickJunkie-2"
        },
        "dateCreated": "2000-10-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0198021/"
        },
        "name": "An enchanting human interest story",
        "reviewBody": "This film is a bittersweet human-interest story with a side order of romance. The story has a country flavor, plenty of country music and a story that could serve as the film version of the typical lyrics of any country music CD. It is replete with bad decisions, bad luck and tragedies at every turn. It is sappy, corny, stereotypical, and unfortunately full of the types of things that really happen in rural America. Despite this seething despondency, it has an upbeat fatalism that suggests that at least for some of the people, the struggle against bad breaks and hard times pays off.\n\nThe story follows the life of Novalee Nation (Natalie Portman), poor young girl setting out to start a new life with her no account boyfriend. When Novalee makes a rest stop at a Wal-Mart in Oklahoma, he ditches her, literally leaving her there barefoot and pregnant. Having only five dollars to her name, she takes up residence in the Wal-Mart and ultimately has the baby there. She becomes a minor celebrity and she is adopted by the Welcome Wagon lady. The remainder of the film examines the various relationships and experiences she has in this small town over the next seven or eight years.\n\nThe story is charming and steeped in sentiment. The character development of Novalee is excellent, although Director Matt Williams could have spent more time on some of the supporting characters, especially Sister Husband (Stockard Channing). To his credit, the film was nicely shot, and the tornado scene was fabulous.\n\nNatalie Portman's performance was her best to date. She played the part with a near helpless determination that made her a very attractive and lovable character. Her southern accent was terrible, but her portrayal of the rural southern attitude was on target. Though the part didn't have a lot of range, she was extremely effective with the emotional element, and elicited great sympathy and admiration for her response to her desperate situation.\n\nStockard Channing was wonderful as the eccentric Welcome Wagon lady. I would have liked to see this part expanded, just to see more of Channing. She was enchantingly warm and peculiar. James Frain was also very good as Forney. He made the character very interesting and affable. He continues to be a solid supporting actor who has shown himself to be extremely versatile (Hilary and Jackie, Reindeer Games, Titus). Ashley Judd added another fine performance to her resume, with a free spirited portrayal of Lexie.\n\nThis was a nice story with an agreeable and upbeat ending. I rated it a 7/10. Add a point if you are a woman or if you have ever lived in a mobile home. It will find its most enthusiastic audience with women due to its extreme sentimentality, but it is not so `female' that it can't be enjoyed by men, making it a good date movie.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from 20th Century Fox Home Entertainment",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi669122841",
        "name": "Where the Heart Is",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzM0Mjc2NDQtY2MwYS00YTg1LWFlMTItOTI4NTc5YzNkZjFiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzM0Mjc2NDQtY2MwYS00YTg1LWFlMTItOTI4NTc5YzNkZjFiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-18T12:06:05Z",
        "url": "https://www.imdb.com/video/vi669122841/"
    },
    "url": "/title/tt0198021/"
}