{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ching Wan Lau",
            "url": "/name/nm0490513/"
        },
        {
            "@type": "Person",
            "name": "Ruby Wong",
            "url": "/name/nm0939315/"
        },
        {
            "@type": "Person",
            "name": "Yiu-Cheung Lai",
            "url": "/name/nm0481737/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 523,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "Where a Good Man Goes",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0068676/"
        },
        {
            "@type": "Person",
            "name": "Ka-Fai Wai",
            "url": "/name/nm0906413/"
        },
        {
            "@type": "Person",
            "name": "Nai-Hoi Yau",
            "url": "/name/nm0946883/"
        }
    ],
    "datePublished": "1999-05-06",
    "description": "Fresh from a prison term, a former Triad boss resides in a hotel in Macau, where he befriends its owner and her young son.",
    "director": [
        {
            "@type": "Person",
            "name": "Johnnie To",
            "url": "/name/nm0864775/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Action",
        "Drama",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjIwZWExY2MtNWFkMy00MGVlLWJkZGMtZWY2ODQ2MzVmYTM2XkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1_.jpg",
    "keywords": "prison",
    "name": "Joi gin a long",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "experten"
        },
        "dateCreated": "2002-04-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0202682/"
        },
        "name": "Odd romantic drama with some bursts of violence",
        "reviewBody": "This is a movie from highly acclaimed Milkyway movie production company, made by the master director himself, Johnny To. Some consider Where A Good Man Goes to be an overlooked masterpiece but my personal opinion is that it is a good but not great movie.\n\nI prefer some of Johnny To's other movies such as Running Out Of Time and especially A Hero Never Dies which is much more violent and also very stylistic with many very nice shootings with bloodsquibs. I can also recommend some of the movies produced by Johnny To; the exciting thriller The Intruder, the odd masterpiece The Odd Ones Die and the extremely violent and well written The Longest Nite.\n\nWhere A Good Man Goes is not very violent, but it has some sudden bursts of violence. It is more of a romantic drama about the relationship between a newly released ex-convict and an attractive widow hotel owner. If you are a little more mature movie lover who doesn't expect to see a heroic bloodshed gun ballet movie (there is no gun action here) but want to see a well directed well played drama, but still have the stomach too see some violence, some ugly beatings, then I think you will enjoy this movie.\n\nThe pacing is not high, but there are enough going on all the time to keep mature viewers entertained. The ex-convict Michael is played by Ching Wan Lau and he is one tough bastard and here he is good as always. Ruby Wong is attractive but also believable in her role as the hotel owner, she has a certain dignity with her. Lam Suet is also very good as the nasty policeman who wants to catch Michael.\n\nWhere A Good Man Goes is also interesting because the character Michael, although believable, is hard to understand. His point of view is that we live in a dog eat dog world and you better be mean because there are so many mean people out there that otherwise will take advantage of you. This is his philosophy and he lives like he preaches, he treats everybody bad including the widow hotel owner. It is interesting to watch the relationship between them develop despite the way he is treating her. Michael is a more multidimensional character than is common in Hollywood movies, To is not afraid to make him complicated, to show us his bad sides as well as his good qualities.\n\nRating: 7 / 10. Recommended for mature people only.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0202682/"
}