{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Michael Keaton",
            "url": "/name/nm0000474/"
        },
        {
            "@type": "Person",
            "name": "Deborah Kara Unger",
            "url": "/name/nm0000679/"
        },
        {
            "@type": "Person",
            "name": "Ian McNeice",
            "url": "/name/nm0573862/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 49773,
        "ratingValue": 5.5,
        "worstRating": 1
    },
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0065717/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0005073/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0076476/"
        },
        {
            "@type": "Person",
            "name": "Niall Johnson",
            "url": "/name/nm0425894/"
        }
    ],
    "datePublished": "2005-01-07",
    "description": "An architect's desire to speak with his wife from beyond the grave becomes an obsession with supernatural repercussions.",
    "director": [
        {
            "@type": "Person",
            "name": "Geoffrey Sax",
            "url": "/name/nm0768249/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Drama",
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNWVkNGY2NTgtNWVhNi00NWU3LWE4NWMtNDFjMzA1N2QzMjQyXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "supernatural horror,tape over mouth,television static,river,obsession",
    "name": "White Noise",
    "original_info": {
        "id": "White Noise_2005",
        "name": "White Noise",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "meako1973"
        },
        "dateCreated": "2005-01-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0375210/"
        },
        "name": "Chilling and effective.",
        "reviewBody": "White Noise is a film that takes a true scientific phenomenon, and makes a film out of it. The phenomenon is one which involves electronic recording/broadcast equipment. In amongst white-noise (that crackle and hiss you get on a blank recording) and static on untuned TV reception there are voices and images discernible. Sometimes these voices have been clear enough to work out, and many people believe they are the voices and images of those who have died, trying to contact the living.\n\nIn the film, Michael Keaton plays Jonathan Rivers, an estate agent who loses his wife. When he is approached by Raymond, a man who lost his son years ago and claims he has heard from Jonathan's wife, it draws him into the phenomenon, and pretty soon he becomes obsessed, recording his own tapes and viewing/listening to them for messages. Then, suddenly, the messages become clear, and seem to be premonitions. Can he decipher the meaning of the messages, or will he disturb something best left alone? I was uncertain going into the film what to expect. Too many times the film world have come up with a great concept, but failed to deliver anything more than mediocre when it is a horror subject. Expecting another Godsend, I was pleasantly surprised to find a pretty good film, with some nice touches, and chills. Admittedly the story wouldn't look out of place on X-Files, but unlike the recent The Forgotten, it manages to feel complete, and doesn't seem to take the easy option at the end.\n\nThe direction by Sax (best know for his TV work such as Tipping the Velvet, Dr Who, Clocking Off, and Spitting Image to name a few) is more than sufficient, and he uses the white-noise to great effect. A little buzz here, and flicker there all serve to unnerve, and you could be forgiven for thinking you are watching another Japanese adaptation. There are a lot of similarities to eastern horror throughout, the use of silence the unnerve, the distorted images in the TV sets, and so on. Only the occasion \"music to let you know you should jump\" lets down the tone.\n\nNevertheless, with a well woven script which doesn't pander to the lowest denominator, and a sterling performance from Michael Keaton, who hasn't really had a presence on the screen since 1998s Jack Frost, make this an enjoyable little movie which deserves a viewing or two.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Universal Studios Home Entertainment",
        "duration": "PT31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1308426521",
        "name": "White Noise",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDQxMDgyM2MtYWY0MC00ZDdmLThmNTAtZjM1MThkNjAwODRjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDQxMDgyM2MtYWY0MC00ZDdmLThmNTAtZjM1MThkNjAwODRjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:23:40Z",
        "url": "https://www.imdb.com/video/vi1308426521/"
    },
    "url": "/title/tt0375210/"
}