{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Bela Lugosi",
            "url": "/name/nm0000509/"
        },
        {
            "@type": "Person",
            "name": "Madge Bellamy",
            "url": "/name/nm0068705/"
        },
        {
            "@type": "Person",
            "name": "Joseph Cawthorn",
            "url": "/name/nm0147248/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 11016,
        "ratingValue": 6.2,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0553623/"
        },
        {
            "@type": "Person",
            "name": "Garnett Weston",
            "url": "/name/nm0922951/"
        },
        {
            "@type": "Person",
            "name": "William B. Seabrook",
            "url": "/name/nm2690196/"
        }
    ],
    "datePublished": "1932-08-04",
    "description": "A young man turns to a witch doctor to lure the woman he loves away from her fiancé, but instead turns her into a zombie slave.",
    "director": [
        {
            "@type": "Person",
            "name": "Victor Halperin",
            "url": "/name/nm0356931/"
        }
    ],
    "duration": "PT1H9M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjEwODU3MDI1OF5BMl5BanBnXkFtZTgwODY4NzYwMjE@._V1_.jpg",
    "keywords": "zombie,voodoo,haiti,voodoo zombie,plantation",
    "name": "White Zombie",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "ebubier"
        },
        "dateCreated": "2009-11-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0023694/"
        },
        "name": "Even better on the Big Screen",
        "reviewBody": "This review will be more about the print and theatrical experience than about the plot. Most people won't find this \"useful\", but hey, so what. Here's my two cents.\n\nIf you have the opportunity to see the Roan Group print projected in a theater, don't hesitate. Go see it.\n\nI just saw this in the big screen last weekend and it is MUCH better in a proper theater with a crowd of enthusiasts than in the confines of your home, even with a big TV and 5.1. The audience I was in was comprised of about 150 kids and their parents. The kids had a great time as did I, who has seen the movie several times over the years in the washed out public domain video prints that have circulated forever.\n\nThe Roan Group print (same as the remastered DVD) is the one we saw, projected in 35 mm. It was obvious that there were two sources for this print. The vast majority of this appears to come from a very nice print with high contrast and sharp definition. The \"fill-in\" portions, apparently missing from the other source, are much more typical of a 75-year-old cheapie independent production shot in 11 days, i.e., scratchy, multiple generations removed from the negative, and faded. Thankfully there's not too much from that second source. There are a few jumps in the film (a few seconds at most) that could not be restored. Too bad, but no biggie. \n\nThe sound was problematic, veering from a comfortable volume when dialogue was speaking, to way too loud, almost to the point of distortion, when the music played or the bird squawked. I really don't think it was the theater's fault as their sound is always \"just right\".\n\nInterestingly, for a movie this old (pre King Kong and Bride of Frankenstein) there was a whole lot of music and not as much dialogue as one usually gets in a film from this era. The music was rarely background to dialogue and was used almost exclusively to enhance the mood of the film. It was probably cheaper to do it this way, but who cares why. It works.\n\nThis is a really neat film full of great shots and creepy characters. Bela is fantastic, maybe his best performance on film. White Zombie hardly ranks up there with the Universal classics of the era, but it is positively time for a historical and critical reappraisal of this newly restored film.\n\nIt's good on video, but on the big screen, WOW!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "A young man turns to a witch doctor to lure the woman he loves away from her fiancé, but instead turns her into a zombie slave.",
        "duration": "PT1M42S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi399819033",
        "name": "Restoration Theatrical Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTllM2JiYTAtODJmZC00NjZhLTg0ODYtNWEwYWQzYTYwMTg5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTllM2JiYTAtODJmZC00NjZhLTg0ODYtNWEwYWQzYTYwMTg5XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-11-02T17:33:13.463Z",
        "url": "https://www.imdb.com/video/vi399819033/"
    },
    "url": "/title/tt0023694/"
}