{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Elizabeth Taylor",
            "url": "/name/nm0000072/"
        },
        {
            "@type": "Person",
            "name": "Richard Burton",
            "url": "/name/nm0000009/"
        },
        {
            "@type": "Person",
            "name": "George Segal",
            "url": "/name/nm0001719/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 76922,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0002663/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0037402/"
        },
        {
            "@type": "Person",
            "name": "Ernest Lehman",
            "url": "/name/nm0499626/"
        },
        {
            "@type": "Person",
            "name": "Edward Albee",
            "url": "/name/nm0016361/"
        }
    ],
    "datePublished": "1966-06-22",
    "description": "A bitter, aging couple, with the help of alcohol, use their young houseguests to fuel anguish and emotional pain towards each other over the course of a distressing night.",
    "director": [
        {
            "@type": "Person",
            "name": "Mike Nichols",
            "url": "/name/nm0001566/"
        }
    ],
    "duration": "PT2H11M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzczM2VlNmQtODc3OS00MWEyLWI2ODItN2Y3YTliNTI4ZDhlXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "alcohol,dialogue driven,drunkenness,disrespect,professor",
    "name": "Who's Afraid of Virginia Woolf?",
    "original_info": {
        "id": "Who's Afraid of Virginia Woolf?_1966",
        "name": "Who's Afraid of Virginia Woolf?",
        "year": "1966"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "RWiggum"
        },
        "dateCreated": "2003-07-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0061184/"
        },
        "name": "That's what comes from too much alcohol and too few mutual respect",
        "reviewBody": "'Who's Afraid of Virginia Woolf' tells the story of two couples that are quite different at first sight - one used to each other for years, the other one rather freshly wed in comparison. Actually it doesn't tell their story, but it displays their relationships. \n\nThe film begins on a Sunday morning at 2 o'clock, right after a party, and ends just after the sun rises. In these few hours we get to know these four people better then we might possibly want. \n\nGeorge and Martha are the older couple. He is a history professor, she is the daughter of the head of the university. Their relationship seems to be from hell, full of mutual disgust and humiliation. Their guests are Nick and Honey. He is the new, ambitious biology professor, she is his naive young wive. As all these four characters are more or less drunk throughout the entire film, alcohol works as a catalyst, and we quickly see the different kind of character traits they have: George is a cynic, Martha loves to torment her husband, Nick is an opportunist and Honey is very much a stupid blonde. \n\nThe two relationships deserve closer examination: We wonder why Martha and George married in the first place. They keep swearing at each other. Martha can't stop humiliating George, when they are alone as well as when Nick and Honey are there. Maybe there is still a rest of love in them, but there mutual respect has vanished completely. And then there is the strange story of their son, who is supposed to visit on his birthday. They way George and Martha talk about him make us feel that there is something peculiar about him. At the end we get to know more about him, and we can only guess how important the son is for their relationship. \n\nNick and Honey, on the other hand, seem to be quite the opposite. But, being used as weapons by the older couple, we see that their relationship isn't as perfect as it seems to be, either. Nick didn't marry Honey because he loved her, but because he thought she was pregnant and because of her money. And when Martha tries to seduce him to tease George, he plays the game with her, always in mind that this woman's father is the head of the university. Honey, on the other hand, is much more emotional than her husband, but she also is the most passive character, and the one most affected by the alcohol. \n\nMike Nichols assembled an outstanding cast for his film. Casting Elizabeth Taylor and Richard Burton as Martha and George is a stroke of genius - not only are they terrific actors, but it also heats the imagination of the viewer how much their real-life-marriage resembled the relationship they had in this film. Elizabeth Taylor outshines her co-stars a little. Never was she any better than in this one; although her character is the meanest in the film, she manages that we still feel compassion for her at the end. But Richard Burton, George Segal and especially Sandy Dennis deliver memorable performances, too. \n\n'Who's Afraid of Virginia Woolf' succeeds at something rather difficult: It makes us care for characters we wouldn't want to have anything to do with in real life. And although it actually consist of nothing but four people talking for two hours, it never bored us for a second.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for this classic film based on the play",
        "duration": "PT2M12S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2027095065",
        "name": "Who's Afraid of Virginia Woolf?",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjViOWM1MTktY2M1OS00NTA5LWJiOTktOWY4MTYzODAzZjQ3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjViOWM1MTktY2M1OS00NTA5LWJiOTktOWY4MTYzODAzZjQ3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2010-01-16T17:19:44Z",
        "url": "https://www.imdb.com/video/vi2027095065/"
    },
    "url": "/title/tt0061184/"
}