{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Harvey Keitel",
            "url": "/name/nm0000172/"
        },
        {
            "@type": "Person",
            "name": "Zina Bethune",
            "url": "/name/nm0079203/"
        },
        {
            "@type": "Person",
            "name": "Anne Collette",
            "url": "/name/nm0171801/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 9414,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "alternateName": "Who's That Knocking at My Door",
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0055278/"
        },
        {
            "@type": "Person",
            "name": "Martin Scorsese",
            "url": "/name/nm0000217/"
        },
        {
            "@type": "Person",
            "name": "Betzi Manoogian",
            "url": "/name/nm1058895/"
        }
    ],
    "datePublished": "1968-09-13",
    "description": "A young man can't accept the girl he likes because of her bitter past.",
    "director": [
        {
            "@type": "Person",
            "name": "Martin Scorsese",
            "url": "/name/nm0000217/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjg3ZjBlY2UtYmExYi00OTU2LTg1MzItZGY2MmRlMzhiNTE4XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "male nudity,male frontal nudity,sex,sexual fantasy,female nudity",
    "name": "I Call First",
    "original_info": {
        "id": "Who's That Knocking at My Door?_1969",
        "name": "Who's That Knocking at My Door?",
        "year": "1969"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "KnightsofNi11"
        },
        "dateCreated": "2011-01-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0063803/"
        },
        "name": "A must see for Scorsese fans",
        "reviewBody": "Martin Scorsese is undoubtedly one of my all time favorite directors. He has a consistently great string of movies that span his entire career and Who's That Knocking at My Door is the very first one of them all. The movie itself is very good, but looking at it in relation to the career and development of Scorsese's aesthetically unique style of directing makes it even better. When you break it down it is sort of a movie about nothing, and it focuses more on aesthetics and visual nuances to give it a very unique feel that fits right in with Scorsese's body of work. But if you have to assign a storyline to the film it is about J.R., an Italian American living in New York, who meets a girl and falls in love with her. They have their ups and downs and the movie essentially just follows J.R. through his life as a city slicker, hanging out with his foul mouthed buddies at bars and trying to balance that with his love life. The story more or less takes a back seat to the unique visual exploration that is way ahead of its time.\n\nIf you're familiar with Scorsese, then this film would be what you would expect from his directorial debut. It is very raw, unpolished, and experimental. Thankfully, a lot of what Scorsese plays with in this film would actually carry through to his later films that were obviously much bigger successes. This film is essentially a gigantic lens into what would later develop into Scorsese's very specific style of directing. It mixes up a little bit of everything and almost feels like a rough mixing of all of Scorsese's unique visual elements that he has trademarked since then. Who's Knocking at My Door employs all kinds of techniques that we've grown to love from Scorsese. It deals out some long static shots, long tracking shots, and its fair share of strangely quick cuts. The dialouge has a very unpolished Scorsese-esquire cadence to it. It can't even compare to some of the dialouge of his later films, but you can definitely see the early formations of Scorsese's vulgar and quick paced dialouge.\n\nYou also have to give a lot of credit to Scorsese and the people who signed on to help him produce this film because of just how experimental the film was for a directorial debut. The film is far ahead of its time in content and style, and for Scorsese to take this risk with his very first film is something that is very respectable in any filmmaker. He didn't try to do anything on a large and flashy scale. Instead he creates a very small scale story with small scale characters and he does a surprising lot artistically with the little he has to work with. And it's also incredible that, to me at least, it works. Trying something so bizarre and different from conventional filmmaking styles of the time could easily crash and burn. But Scorsese pulls it off with his first film and makes something that is actually watchable.\n\nWho's Knocking at My Door is a really good movie by itself, but it becomes so much more interesting when you put it in the context of Scorsese's body of work. When you do this, the film becomes a fascinating study of the beginnings of Scorsese, and for that I absolutely loved it. Being such a small scale movie without a lot of purely escapist entertainment value it's hard to recommend this film to just anybody, but if you are a Scorsese fan then it is a must see.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0063803/"
}