{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Yi Pan-Yong",
            "url": "/name/nm0659044/"
        },
        {
            "@type": "Person",
            "name": "Sin Won-Sop",
            "url": "/name/nm0938863/"
        },
        {
            "@type": "Person",
            "name": "Hae-Jin Huang",
            "url": "/name/nm0398989/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1388,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "Why Has Bodhi-Dharma Left for the East?",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037079/"
        },
        {
            "@type": "Person",
            "name": "Yong-Kyun Bae",
            "url": "/name/nm0046282/"
        }
    ],
    "datePublished": "1989-09-23",
    "description": "About three monks in a remote monastery; an aging master, a small orphan and a young man who left his city life to seek Enlightenment.",
    "director": [
        {
            "@type": "Person",
            "name": "Yong-Kyun Bae",
            "url": "/name/nm0046282/"
        }
    ],
    "duration": "PT2H17M",
    "genre": [
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDliNDAzNjgtODgyMC00MTMxLWI1YmItMzkzYjY1NjU3ZmJmXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_.jpg",
    "keywords": "gentle cinema,monastery,teacher,orphan,monk",
    "name": "Dharmaga tongjoguro kan kkadalgun",
    "original_info": {
        "id": "Why Has Bodhi Dharma Left for the East?_1989",
        "name": "Why Has Bodhi Dharma Left for the East?",
        "year": "1989"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nedifico"
        },
        "dateCreated": "1999-10-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0097195/"
        },
        "name": "a quality film full of symbolism",
        "reviewBody": "The thing about Why has Bodhidharma Left for the East that struck me the most was the life of the little boy, Haejin. In particular, there are two connected scenes that were superbly done, and the strongest impression I got from Why... is the symbolism to be found within them. In the first of the two scenes, relatively early in the film Haejin picks up a rock off of the ground and, for no apparent reason, takes aim at a bird and hurls the rock at it. After he strikes the bird in the head and the bird falls to the ground, Haejin runs over to it and examines it. At this point, Haejin clearly is stricken with guilt and is remorseful for what he has done. Rushing back to the monastery, he avoids his Master and covertly hides the bird, seeking to nurse the bird back to health.\n\nLater in the film, Haejin is swimming with some boys in a pool of water when the boys take to dunking Haejin under the water. As the scene progresses, Haejin is seen emerging from the water repeatedly, struggling, gasping for air and trying to free himself as best he can. Ostensibly, the boys around him do not see that they are harming Haejin; they dunk him underwater for fun, and the possibility that he could drown does not even occur to them. Although, after a few minutes of the dunking, some boys on the outskirts of the pool look on with worried faces, nobody expects that the action could seriously hurt Haejin, and accordingly nobody acts to help him.\n\nThe most fascinating thing about these two scenes is the parallelism: not particularly thinking of the possible consequences, young boys behave dangerously, and someone or something ends up getting hurt. Haejin thoughtlessly hurls the rock at the bird and damages it physically, whereas the boys at the pool gang up on Haejin and dunk him underwater, terrifying him emotionally. I think this is an issue of karma: Haejin does not think about the consequences of hurting the bird, which is mirrored by the boys' thoughtless torment of Haejin.\n\nAnd yet, another really interesting thing about the situation was the difference in behavior that took place after the thoughtless violence. Immediately, Haejin realized that he had done something wrong, that he had wounded the bird terribly, so he rushed to take care of it and help it. Presumably, the boys who were harassing Haejin did no such thing, for in and after that scene we see neither guilt nor any attempts to mend fences on their part. The immediate question is then why: why does Haejin see the mistake he made and try to rectify his wrong whereas there is no such action by the boys? I think that the answer lies in the fact that the viewer is supposed to note that Haejin is a Buddhist, whereas the boys are from the \"world,\" and it can safely be assumed that they do not follow the path of those in the monastery. The viewer is supposed to identify the distinct difference between those of the monastery and those from the world. The concept of the how the world is can be found in Haejin's master Hyegok's explanation to Haejin that the world outside the monastery is full of pain and thoughtlessness. (The scene at the pool is the point where the director of the film gives the viewer the opportunity to see Haejin in a situation that verifies what the Master said. Kibong had the same opportunity when he went home to see his mother). Although there is not much of an observable difference in the behavior of the boys during the violent behavior - for all are only little boys prone to stupidity - the emphasis is the Buddhist response to the situation as opposed to the non-Buddhist response.\n\nAlthough I do not think that I understood everything in the film - when Master Hyegok was talking about really deep and spiritual things, he spoke quite fast and I did not really catch everything that he said - I think that I understood at least some of the movie. Overall, I enjoyed the film, particularly the scenery and the painstaking attention to detail. Most of all, I enjoyed leaving the film room thinking about it and trying to understand its symbolism and messages."
    },
    "url": "/title/tt0097195/"
}