{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Gemma Jones",
            "url": "/name/nm0428121/"
        },
        {
            "@type": "Person",
            "name": "Michael Kitchen",
            "url": "/name/nm0457655/"
        },
        {
            "@type": "Person",
            "name": "Owen Teale",
            "url": "/name/nm0853583/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 219,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0106302/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060480/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0775886/"
        }
    ],
    "datePublished": "1996-09-30",
    "description": "Alice, a mild-mannered librarian, has a bizarre secret: once a month she turns into a werewolf. Struggling with her affliction, she becomes involved in a strange triangle between her analyst and another man who may be the key to s...",
    "genre": [
        "Drama",
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMmE0ZTM1ODEtNTgyMy00NDRkLWJmZTYtY2U0NmEyMjA4OWRkXkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "werewolf horror,female full frontal nudity,psychiatrist,female werewolf,female rear nudity",
    "name": "Wilderness",
    "original_info": {
        "id": "Wilderness_1996",
        "name": "Wilderness",
        "year": "1996"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Teknofobe70"
        },
        "dateCreated": "2005-04-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118169/"
        },
        "name": "Not bad, but ...",
        "reviewBody": "\"Wilderness\" was originally aired as a UK mini-series and ran for a total of 174 minutes. Unfortunately, the version I saw was a movie edited together from the series which runs for only 100 minutes or so, which means there was over an hour of material missing -- so bear in mind that this is a review of the edited movie rather than the series.\n\nIt's immediately apparent from watching Wilderness that it's based on a novel, and fact is you probably already know the story. There's a whole bunch of books of the same type -- a woman has been living as a werewolf since she hit puberty, which causes problems in her relationships so she goes to see a psychiatrist and there's this guy that she really likes but she's scared he won't understand and he has this ex-wife who's a complete bitch and ... yeah, it sounds like popular British fiction alright, and if you're familiar with it you can predict all of the twists and turns here a while before they actually happen.\n\nThe directing feels like your average UK TV series, and so does the acting. Everyone does an okay job, but the real stand-out performance would have to be from Michael Kitchen as the suffering psychiatrist who becomes increasingly unhinged as the story goes on. The fact that there's an hour missing explains why the pacing is all wrong, I guess, and it's possible that I would have enjoyed this a lot more in it's original form as a mini-series.\n\nI wouldn't generally recommend this unless you're a big fan of British TV. You may want to check out the mini-series if you ever get a chance, though.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "url": "/title/tt0118169/"
}