{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Victor Sjöström",
            "url": "/name/nm0803705/"
        },
        {
            "@type": "Person",
            "name": "Bibi Andersson",
            "url": "/name/nm0000761/"
        },
        {
            "@type": "Person",
            "name": "Ingrid Thulin",
            "url": "/name/nm0862026/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 109231,
        "ratingValue": 8.1,
        "worstRating": 1
    },
    "alternateName": "Wild Strawberries",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050989/"
        },
        {
            "@type": "Person",
            "name": "Ingmar Bergman",
            "url": "/name/nm0000005/"
        }
    ],
    "datePublished": "1959-06-22",
    "description": "After living a life marked by coldness, an aging professor is forced to confront the emptiness of his existence.",
    "director": [
        {
            "@type": "Person",
            "name": "Ingmar Bergman",
            "url": "/name/nm0000005/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWQxYzdhMDMtNjAyZC00NzE0LWFjYmQtYjk0YzMyYjA5NzZkXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "professor,road movie,nostalgia,dream,swedish summer",
    "name": "Smultronstället",
    "original_info": {
        "id": "Wild Strawberries_1957",
        "name": "Wild Strawberries",
        "year": "1957"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "nqure"
        },
        "dateCreated": "2002-02-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0050986/"
        },
        "name": "Cinema as an art form",
        "reviewBody": "Bergman's films, to state the blindingly obvious, are the complete antithesis of the mindcandy (A Beautiful Mind) presented to cinemagoers in sterile multiplexes. They are almost like cinematic art forms, meditations on life and its meanings but, like many works of art, they can be obscure, challenging and demand patience to understand their underlying subtexts. Even after a 2nd viewing!\n\n'Wild Strawberries' deals with the past, memories & regrets. It's about an inner journey about one man's subjective state of mind as he sees nostalgic memories of childhood & lost love (regret), surreal visions of denial (mortality) and unsettling weird dreams which hint at a self-awareness and truth that he cannot face in reality.\n\nI was touched by Victor Sjostrom's performance as the elderly Prof. Isak Borg reflecting upon his life, and moved by the final emotional scenes where he achieves an inner peace. Is it slightly deceiving, a cop-out that Borg finds peace at the sight of his father and mother, 'the point before betrayal, before the messiness of life' intervenes as another reviewer stated? Well, I think it's commonly accepted that most people, as they grow older, tend to remember more from their past & childhoods. Why? Perhaps because it reminds them of a time of lost innocence.\n\nWhat I found quite difficult to understand was how Isak is supposed to be this cold-hearted rationalist; Sjostrom's touching depiction makes this troubled old man quite endearing (viz the young travelling companions affection for him). Perhaps, as the opening suggests, this is a man who has shied away from intimate contact, whose coldness drove his unhappy late wife into the arms of another and who has approached life solely on his own (egotistic) terms leading to loneliness.\n\nThis is where the allusion to wild strawberries becomes significant as it is the symbol of regeneration: through his inner journey, mixing dream & reality, Borg sees the truth about his life and its emptiness. The film charts his growing intimacy with his daughter-in-law and an eventual inner peace.\n\nThe film sounds typically Scandinavian in its gloom but it is also a celebration of youth as well as a study of mortality and one man's mind. It's also not without comedy, particularly the old Prof's relationship with his housekeeper Agfa and the absurd boxing match about 'God'(Bergman parodying himself) between the two young hitchhikers.\n\nWhat makes the film so intriguing is how characters/situations often reflect one another (Borg & his son, their coldness and attitude to life); these parallels extend to the point where characters even play dual roles: Bibi Andersson as Sara (the lost love & then the young vivacious traveller) and a cruel husband who later appears as the stern examiner in an unsettling dream. It's a highly complex pattern of subtle connections (stream of consciousness)that, as Borg states at the end, forms some sort of logical order. ....................................................................................................................\n\n2021 addition. I recently heard Charles Causley's poem 'Eden Rock' which is about the older poet encountering his parents as he remembers them when young, and they beckon him to cross the drifting stream (the passage between life & death).\n\n'Crossing is not as hard as you might think.\"\n\nI'm not sure I understand all the meanings in this film, but feel the above poem illuminates the final scene of the film, perhaps with the old Professor coming to terms with his life & mortality.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0050986/"
}