{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Martina Bezousková",
            "url": "/name/nm1184955/"
        },
        {
            "@type": "Person",
            "name": "Sylvie Kraslová",
            "url": "/name/nm2416829/"
        },
        {
            "@type": "Person",
            "name": "Sára Vorísková",
            "url": "/name/nm2417328/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1430,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "alternateName": "Wild Flowers",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0033780/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0056005/"
        },
        {
            "@type": "Person",
            "name": "Karel Jaromír Erben",
            "url": "/name/nm0258652/"
        },
        {
            "@type": "Person",
            "name": "Milos Macourek",
            "url": "/name/nm0534181/"
        },
        {
            "@type": "Person",
            "name": "F.A. Brabec",
            "url": "/name/nm0102629/"
        }
    ],
    "datePublished": "2000-12-07",
    "description": "Seven seemingly unconnected fairy tales - glued together only by folklore, mood, color and light - make up this Czech collection of visual poetry. The original piece of literature, written by Karel Jaromír Erben in 1853, contained...",
    "director": [
        {
            "@type": "Person",
            "name": "F.A. Brabec",
            "url": "/name/nm0102629/"
        }
    ],
    "duration": "PT1H21M",
    "genre": [
        "Drama",
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNTc5OTk1YzgtMjY1Ni00MjFkLWFkYzMtMDk0ZjJiOTA4NzNhXkEyXkFqcGdeQXVyMjIxMzMyMQ@@._V1_.jpg",
    "keywords": "campy,folk horror,psychotronic film,literature on screen,central europe",
    "name": "Kytice",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "NateManD"
        },
        "dateCreated": "2005-07-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0239102/"
        },
        "name": "A film of visual beauty and dark folk lore.",
        "reviewBody": "F.A. Brabec did an amazing job of directing \"Kytice\" (wildflowers), which is based on the book \"the Seven Ballads\". I'm not familiar with the novel, but I must say that the seven Czech fairy tales within the film are extremely nightmarish. These are not fairy tales to read to children before bedtime. One tale concerns an underwater spirit, who takes women captive as wives, if they happen to fall in the water. Another has a girl praying for her boyfriend to return from the dead. He returns in soldier uniform and gives her the power to fly every time she denounces her religious faith. The stories teach bizarre moral lessons, and people end up paying for their bad choices. The cinematography is gorgeous, and should be studied by film students everywhere. The movie is dark, but very moving and filled with colorful life. Jakubisko's art direction is amazing. (he helped produce the film along with his wife) The soundtrack is haunting and will stay with you long after the film is over. In fact I ended up buying the soundtrack, and it is excellent. \"Kytice\" reminds me of Kurasawa's \"Dreams\", \"Big Fish\" and \"Valerie and her Week of Wonders\" all rolled into one bizarre dream. The Czech Republic is a country thats film industry remains undiscovered by western audiences. I have yet to watch a Czech film that I didn't like. For more dark unsettling Czech folk lore also view Jakubisko's \"An Ambiguous Report about the end of the World\".",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0239102/"
}