{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Stéphanie Michelini",
            "url": "/name/nm1564268/"
        },
        {
            "@type": "Person",
            "name": "Yasmine Belmadi",
            "url": "/name/nm0069289/"
        },
        {
            "@type": "Person",
            "name": "Edouard Nikitine",
            "url": "/name/nm1559680/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1097,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0042169/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0023000/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0130369/"
        },
        {
            "@type": "Person",
            "name": "Stéphane Bouquet",
            "url": "/name/nm0099683/"
        },
        {
            "@type": "Person",
            "name": "Sébastien Lifshitz",
            "url": "/name/nm0509852/"
        }
    ],
    "datePublished": "2004-04-14",
    "description": "A transgender woman who survives prostituting herself in Paris, returns - with her two male lovers in tow - to her family home in the countryside to look after her dying mother.",
    "director": [
        {
            "@type": "Person",
            "name": "Sébastien Lifshitz",
            "url": "/name/nm0509852/"
        }
    ],
    "duration": "PT1H33M",
    "genre": [
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTU5MDIwNDQ3Nl5BMl5BanBnXkFtZTcwMjIxNDAzMQ@@._V1_.jpg",
    "keywords": "male pubic hair,pubic hair,mother daughter relationship,transgender woman,transgender prostitute",
    "name": "Wild Side",
    "original_info": {
        "id": "Wild Side_2004",
        "name": "Wild Side",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "anyajzb"
        },
        "dateCreated": "2008-02-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0364120/"
        },
        "name": "A powerful yet confused film about human connection",
        "reviewBody": "Wild Side is an often moving, sometimes heartbreaking French film about a trio of friends centered around the life of pre-op transwoman Stéphanie. She is a sexworker in Paris (I think these scenes were filmed in the Bois de Boulogne, where a large contingent of mostly foreign-born transwomen sexworkers do their trade). She comes back into the life of her taciturn mother, a woman who lost a husband and a daughter and had previously decided to break contact with Stephanie after she transitioned. Now, as the only available caretaker, Stephanie is responsible for the mom, and brings her back to their rundown hometown in the North of France. Along the way, we meet Mikhail, a bi or possibly gay illegal Russian immigrant who is involved with Stephanie and Djamel, an Algerian male prostitute from the dumpy highrise projects north of Paris. How they all met is never really explained and not so important... the story is really about their various regrets and how they feel about this trio (not really a manage á trois since they aren't into group sex).\n\nThe spine of the film is the powerful performance and screen presence of Stephanie Michelini as Stephanie. While not a trained actress (this was her first acting job) she brings a quiet longing to the role and never has a false moment. She's female at the core of her soul, often very pretty framed by her beautiful ringlets of hair, even when the camera lingers on some of her face's hard edges. Matching her is Edouard Nikitine as Mikhail, giving a powerful, sad performance with dark, sometimes dead eyes. The two have a silent bathtub scene which is loving and erotic at the same time. Unfortunately, Djamel, the gay prostitute, doesn't add much to the mix. Yasmine Beimadi (a professional actor) gives him a bravado and almost Jimmy Cagney pugnaciousness. But why he's in this trio and what he brings to it doesn't seem altogether believable. Perhaps it was to bring out a conflict in Mikhail about being gay... as if his relationship with Stephanie is his last attempt to hang on to woman.\n\nIn my experience, such men never have relationships with transwomen and, as with all her customers, mostly very straight-identified men are into pre-op transwomen. I felt Sebastien Lifshitz (who is gay) tried to weld two very different stories together than don't altogether fit. As I watched Wild Side, I kept hoping for more about Stephanie and Mikhail and that a totally separate film had been made about Djamel. Another wonderful performance is given by Josiane Stoleru as Stephanie's sick mother. The scenes between mother and daughter are altogether tender and loving, even when laced with the mother's intense guilt and total disregard for Stephanie as a woman although she relishes her daughter's caretaking of her.\n\nThe cinematography in Wild Side (by Agnes Godard) is stunning and Lifshitz is wonderful at using low key sound and silence to add focus and give the film a elegiac tone. Special mention has to be made of one of the scenes opening sequences of roomful of transwomen being dolefully serenaded by genderqueer singer Antony Hegarty (who fronts his own band in NYC). The women in the room form a kind of chorus of trans beauty, pain, solidarity and regrets that is stunning. The song Hegarty sings is mourning the lose of a dead boy (in this care, perhaps, the 'boy' each of his audience members has lost as they transitioned?) It's a beautiful scene but, again, very much a gay man's take on what being a transwoman is. He focuses on the 'super femme gay male' aspects which is reinforced by the 'required' penis shot of Stephanies' body just before song scene.\n\nAlso, I found this film's quiet beauty also marred by having Stephanie be involved in sex work and the graphic scenes this entails (focusing on the hypocrisy of her straight clients). Unfortunately, even most gay men have a view of this as being what transwomen's lives are all about (even though Stephanie obviously wants to get out of it). As sensitive as Lifshitz is, he often stoops to an objectification of her that, while beautifully packaged and with a social/political undertone, sends much of the same message as many far more exploitive films.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0364120/"
}