{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Susan Ward",
            "url": "/name/nm0911861/"
        },
        {
            "@type": "Person",
            "name": "Katie Stuart",
            "url": "/name/nm0835759/"
        },
        {
            "@type": "Person",
            "name": "Leila Arcieri",
            "url": "/name/nm0033837/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7437,
        "ratingValue": 4.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0017834/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0013922/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0053825/"
        },
        {
            "@type": "Person",
            "name": "Ross Helford",
            "url": "/name/nm1062366/"
        },
        {
            "@type": "Person",
            "name": "Andy Hurst",
            "url": "/name/nm0403577/"
        },
        {
            "@type": "Person",
            "name": "Stephen Peters",
            "url": "/name/nm0002983/"
        }
    ],
    "datePublished": "2004-02-23",
    "description": "Sequel to the hot film Wild Things, Wild Things 2 sees teenage bad girls Maya and Britney go on a sex and killing spree to win millions.",
    "director": [
        {
            "@type": "Person",
            "name": "Jack Perez",
            "url": "/name/nm0673512/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODUzMDAyNzYtZGJjNC00YWY4LWE1NDItYWFjY2RmNGJmZGExXkEyXkFqcGdeQXVyMzY0MTE3NzU@._V1_.jpg",
    "keywords": "nudity,sex scene,seduction,cheating girlfriend,breasts",
    "name": "Wild Things 2",
    "original_info": {
        "id": "Wild Things 2_2004",
        "name": "Wild Things 2",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mentalcritic"
        },
        "dateCreated": "2004-09-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0365270/"
        },
        "name": "Wild Things minus all the things that made it interesting = Wild Things 2",
        "reviewBody": "One of the standout features of Wild Things was that in spite of having an obvious emphasis on the eye-candy content, it also contained enough to keep the other areas of the mind stimulated. In addition to a cast that was very pleasant to look at, doing some things that were equally pleasing to the eye, it had a credible plot that read like an everyday event in parts of America. Most importantly, however, the original Wild Things wasn't afraid to recognise that adults have a right to be entertained, too.\n\nAs my summary suggests, when you take the original Wild Things and remove everything that made it worthwhile, you get Wild Things 2. Many key scenes from Wild Things get replicated here, only there is a certain something lacking. It could be credible acting. It could be a decent script. But what is most apparently missing here is creativity. The photography, so lush and dynamic in the first film, is flat and uninteresting here. About twenty-eight minutes into the film, we hear one of the detectives say something along the lines of \"oh, plot thickens\". This plot would need to eat a whole turkey for every meal every day for a year in order to stop resembling a death camp survivor.\n\nSpeaking of the plot, one critique of Ralph Bakshi's production of The Lord Of The Rings states that about a third of the way through, Ralph shifts gears and simply gives all the neat highlights without any of the setup that links them together to give coherence. Wild Things 2 never shifts gears. It starts out on the assumption that it has given enough exposition to make sense, and simply throws scenes in the viewer's face without any hint of transition. It is almost as if an entire half-hour of footage was deleted from throughout the film, all from between one scene or another.\n\nAnother feature of Wild Things that Wild Things 2 left out is the plot twists. Sure, there's plot twists here, but the lack of setup in the rest of the film, combined with the scenes' rapid-fire handling, gives them the same level of impact as a funeral in an Ed Wood film. After the half-hearted attempt to recreate the threesome scene, and its ability to demonstrate how \"wider audience\" seems to mean \"children/adolescents only\" in Hollywood, I'm sure nobody who's seen the film will be surprised that I tend to think of this mess as Wild Things Lite.\n\nIn all, I gave this mess a two out of ten. It is a perfect example of a Hollywood studio trying to please everyone, and winding up pleasing no one as a result. Save your money and buy the original instead. You won't feel as if you wasted ninety minutes of your life and a few thousand brain cells as a result.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Columbia Tristar",
        "duration": "PT1M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1910636825",
        "name": "Wild Things 2",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWZkODk1OGQtMjJlNS00NTcyLThiYmMtOGEwYjc3MDJhYTRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWZkODk1OGQtMjJlNS00NTcyLThiYmMtOGEwYjc3MDJhYTRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-18T12:08:24Z",
        "url": "https://www.imdb.com/video/vi1910636825/"
    },
    "url": "/title/tt0365270/"
}