{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Val Kilmer",
            "url": "/name/nm0000174/"
        },
        {
            "@type": "Person",
            "name": "Joanne Whalley",
            "url": "/name/nm0000695/"
        },
        {
            "@type": "Person",
            "name": "Warwick Davis",
            "url": "/name/nm0001116/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 126095,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0071326/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0003687/"
        },
        {
            "@type": "Person",
            "name": "George Lucas",
            "url": "/name/nm0000184/"
        },
        {
            "@type": "Person",
            "name": "Bob Dolman",
            "url": "/name/nm0231190/"
        }
    ],
    "datePublished": "1988-05-20",
    "description": "A young farmer is chosen to undertake a perilous journey in order to protect a special baby from an evil queen.",
    "director": [
        {
            "@type": "Person",
            "name": "Ron Howard",
            "url": "/name/nm0000165/"
        }
    ],
    "duration": "PT2H6M",
    "genre": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWIyMTA2M2ItOGI5MC00OTY0LWFmZTItN2NkOWQ0MGQ5NDkyL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "baby,prophecy,journey,little person,magic",
    "name": "Willow",
    "original_info": {
        "id": "Willow_1988",
        "name": "Willow",
        "year": "1988"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "aimless-46"
        },
        "dateCreated": "2006-10-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0096446/"
        },
        "name": "A New Generation of Kids Will Love This Film",
        "reviewBody": "To sum things up, this was really a George Lucus film-with the then relatively inexperienced Ron Howard hired to direct-under the watchful eye of Lucus. Lucus wrote the screenplay, raiding his bookshelf for Tolkein (especially \"The Hobbit\") and Lewis (\"Narnia\"). Then he simply transferred the hero/heroine romance from his \"Star Wars\" screenplay. Not necessarily a bad thing, it was a simple way for him to build a feature length screenplay targeting younger viewers but sophisticated enough to entertain the entire family. \"Willow\" has some scary stuff but should not be a problem for the average grade school viewer. My rating is based on comparisons to other films with a similar target audience. \n\nI must confess up-front to a positive bias. My favorite part of \"Star Wars\" is the caustic romance between Han Solo and Princess Leia; and in \"Willow\" Lucus has refined his technique and actually improved something that was already close to perfection. Sorsha (Joanne Whalley) and Madmartigan (Val Kilmer) substitute nicely for Carrie Fisher and Harrison Ford, with the added dimension of having them begin the story on opposite sides. The romantic elements are efficiently and subtly inserted into the film. Even though these characters are part of the main storyline, the romance is separate enough to serve as the film's main parallel story. The only downside is that this side story soon becomes more interesting than the main one, so much so that its climatic kiss (occurring about 20 minutes before the ending) unintentionally turns into the film's climax (at least energy wise). The actual resolution of the main story then plays out rather anti-climatically. \n\n\"Willow\" is a delivery quest story, much like \"The Hobbit\" where a reluctant Nelwyn (small person) is required to set out on a perilous journey to return a lost baby (even smaller) to a Daikini (tall person). Along the way he is assisted by a couple of Brownies (yet smaller guys who speak with outrageous French accents). The size differentials are the main theme of the film and are especially intriguing to young viewers who easily identify with having to deal with people who tower above them. Howard encourages this identification process by shooting most of the action at child level. If you watch the film with young children you will be amazed at its ability to draw them into the story, this happens because the camera angles intentionally match a child's point-of-view of the world. The viewing child's surrogate is the title character (Warwick Davis-who does a commentary on the DVD), a unlikely hero who inspires audience sympathy as he bravely faces the dangers of his journey while gamely putting up with an ever-changing group of irritating companions. There are frequent cutaways to Elora Danan (the baby), mostly for reaction shots. As in \"Raising Arizona\", the producers took enough stock clips to match her expressions to almost any situation. Willow learns early on from Cherlindrea (a dazzling fairy) that Elora Danan is a princess who (it has been foretold) will one day vanquish the evil Queen Baymorda (a fun role for Jean Marsh). Things get a bit Biblical/Narnia here as the Queen is seeking to eliminate the Princess before she becomes a threat. \n\nThe DVD features: \"Willow:The Making of an Adventure\" (made during production in 1988) and \"Willow: Morf to Morphing\" (made in 2001 for the DVD release), really put the film in historical context relative to its place in the evolution of special effects. It was really the transitional point where photochemical (film) effects were subordinated to digital effects. This gave \"Willow\" a significant place in film history and these two featurettes taken together nicely illustrate the continuing challenge to those involved with special effects; any new development is soon overused and no longer an audience draw. Meaning that effects people have to stay on the cutting edge to simply justify their existence. \n\nThen again, what do I know? I'm only a child.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Willow",
        "duration": "PT1M23S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1038067481",
        "name": "Willow: Blu-Ray",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmE3YjBjZDYtMWY0ZC00MjcwLWJhODMtNWE3MWI1ZDAwYmE5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmE3YjBjZDYtMWY0ZC00MjcwLWJhODMtNWE3MWI1ZDAwYmE5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2013-01-06T06:39:07Z",
        "url": "https://www.imdb.com/video/vi1038067481/"
    },
    "url": "/title/tt0096446/"
}