{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jacques Perrin",
            "url": "/name/nm0674742/"
        },
        {
            "@type": "Person",
            "name": "Philippe Labro",
            "url": "/name/nm0479721/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12072,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "alternateName": "Winged Migration",
    "contentRating": "G",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0058643/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0056755/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0044140/"
        },
        {
            "@type": "Person",
            "name": "Jacques Perrin",
            "url": "/name/nm0674742/"
        },
        {
            "@type": "Person",
            "name": "Stéphane Durand",
            "url": "/name/nm1144320/"
        },
        {
            "@type": "Person",
            "name": "Jean Dorst",
            "url": "/name/nm1607471/"
        }
    ],
    "datePublished": "2003-08-29",
    "description": "Documentary on the migratory patterns of birds, shot over the course of three years on all seven continents.",
    "director": [
        {
            "@type": "Person",
            "name": "Jacques Perrin",
            "url": "/name/nm0674742/"
        },
        {
            "@type": "Person",
            "name": "Jacques Cluzaud",
            "url": "/name/nm0167384/"
        },
        {
            "@type": "Person",
            "name": "Michel Debats",
            "url": "/name/nm0213340/"
        }
    ],
    "duration": "PT1H29M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTkwOTg5MTI5N15BMl5BanBnXkFtZTYwNTQ3Njk5._V1_.jpg",
    "keywords": "aerial camera shot,new york city,iceland,eiffel tower paris,statue of liberty new york city",
    "name": "Le peuple migrateur",
    "original_info": {
        "id": "Winged Migration_2001",
        "name": "Winged Migration",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gregsrants"
        },
        "dateCreated": "2003-11-27",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0301727/"
        },
        "name": "A magnificent movie experience",
        "reviewBody": "Watching Jacques Perrin's Winged Migration I felt incredibly cheated. I felt cheated out of the fact that I didn't get the chance to see this remarkable film at my locale theatre where the images would be displayed in a much larger venue.\n\nWinged Migration is an astonishing achievement. With the help of 450 individuals, including 17 pilots and 14 cinematographers, directors Jacques Perrin, Michael Debats and Jacques Cluzaud, bring to life the migrating habits of a variety of birds throughout the world.\n\nWe learn of the red-crowned crane that flies 600 miles from the far east to the Siberian taiga, the sandhill crane that flies 2000 miles from the Central American Plains to the Arctic circle, and the bald eagle that flies 1800 miles from the American West to Alaska, just to name a few. But it is how we learn from these creatures that is pure cinematic symphony. The three directors took 4 years to film Winged Migration and used everything from gliders, planes, helicopters and balloons to get close enough to the flying birds that you would actually think you are one of them. The scene of the Canadian Geese migrating is photographed so magnificently through the Grand Canyon that we can see the reflection of the formation on the stilled morning waters without the simplest distraction of man. \n\n Winged Migration is filled with such imagery. Not soon will I forget the greater sage grouse in Idaho where the birds have expanding chests and have tail-feathers that look as sharp as a porcupine's quills. Nor will I soon forget the scenes where millions of king penguins take over a coastal island or the countless birds diving into the water with such rapid fire like a multiple torpedo hit.\n\nWhat is really amazing however, is how the filmmakers were able to show the birds in such a format as to give them personalities. We see the arrogance of the Canadian Goose, the fighting nature of the red breasted goose, the relentless tenacity of the captured Amazon parrot and the grieving king penguins after one of their young are eaten.\n\nFor all its glorious visuals, it is man that brings to the screen the most unnatural and catastrophic of images. Threshers on a farm destroy a habitat, hunters hide in the reeds and shoot down overhead geese and pollution and sludge take the life of a migrating red breast. It is hard to believe that the same species that could get close enough to these birds to follow them hundreds of miles, is also one of their greatest enemies.\n\nWinged Migration should be seen on the large screen, but even on the tiniest of home entertainment units, you cannot help but marvel at the life cycle, the fight for survival and incredible long journey's these creatures embark upon twice a year. Three stars."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer 1",
        "duration": "PT1M57S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1675755801",
        "name": "Winged Migration",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYzczMDkwMjAtZGNmNi00OTk0LWE2MmItYzg0MWIxMWZiMDQ2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYzczMDkwMjAtZGNmNi00OTk0LWE2MmItYzg0MWIxMWZiMDQ2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-18T12:09:32Z",
        "url": "https://www.imdb.com/video/vi1675755801/"
    },
    "url": "/title/tt0301727/"
}