{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hossein Abedini",
            "url": "/name/nm0008416/"
        },
        {
            "@type": "Person",
            "name": "Mahmoud Jafari",
            "url": "/name/nm0415416/"
        },
        {
            "@type": "Person",
            "name": "Shahrzad Kamalzadeh",
            "url": "/name/nm4378865/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 49,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0273270/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0737337/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0571647/"
        },
        {
            "@type": "Person",
            "name": "Hamed Emami",
            "url": "/name/nm10189600/"
        },
        {
            "@type": "Person",
            "name": "Hassan Nazer",
            "url": "/name/nm4769460/"
        }
    ],
    "datePublished": "2022-08-13",
    "description": "In a small provincial Iranian town, the children work hard to support their families. One day nine-year-old Yahya and his friend Leyla find a precious statue. Sharing a passion for cinema, Yahya's boss Naser Khan (Reza Naji) decid...",
    "director": [
        {
            "@type": "Person",
            "name": "Hassan Nazer",
            "url": "/name/nm4769460/"
        }
    ],
    "duration": "PT1H25M",
    "genre": [
        "Drama",
        "Family"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMDc1NGQ5MzktYjdjNi00NzUzLTgyNmUtOGVmOTkxMDFmODNkXkEyXkFqcGdeQXVyMjkxNTAxODc@._V1_.jpg",
    "name": "Winners",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "CinemaSerf"
        },
        "dateCreated": "2022-11-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt9673176/"
        },
        "name": "Winners",
        "reviewBody": "I had quite a long chat with director Hassan Nazer after a screening of this, and managed to garner quite an interesting insight into just how the increasingly productive and entertaining Iranian film industry thrives despite the international sanctions and internal censorious attitudes that dog productions. Luckily for us, too, because this is is a charming and engaging story that reminded me at the start a little of \"Oliver Twist\"! \"Yahya\" (Parsa Maghami) and his friend \"Leyla\" (Heila Mohammadkhani) supplement their family's meagre income by scavenging plastics which they sell on. One day, however, he finds something rather different. Rather more golden! Together with his cinema-loving boss \"Naser\" (Reza Naji) they decide to try and repatriate this object and have some fun escapades not just in tracking the owner down, but in keeping it from the grasping hands of others! This is a characterful and entertaining drama that moves along well for just under ninety minutes. The young Maghami brings an enthusiastic innocence to his performance and the whole thing successfully manages to exude a degree of mischievous optimism and honesty despite the fact that their lives are challenging, to say the least. We are presented with a sense of community and decency tinged with just a hint of unscrupulousness that is enjoyable to watch. The direction and the story flow easily with a lively score to accompany a natural dialogue that is well delivered across the board. A feel-good film with a difference that is really worth a watch, i'd say.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt9673176/"
}