{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Hardy",
            "url": "/name/nm0362735/"
        },
        {
            "@type": "Person",
            "name": "Siân Phillips",
            "url": "/name/nm0680795/"
        },
        {
            "@type": "Person",
            "name": "Nigel Havers",
            "url": "/name/nm0369814/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 317,
        "ratingValue": 8.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103379/"
        }
    ],
    "datePublished": "1983-01-16",
    "description": "The story of Winston Churchill's life between 1929, when he lost his cabinet position, and 1939, when he joined Great Britain's War Cabinet - a period he described as the most difficult in his life.",
    "genre": [
        "Biography",
        "Drama",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTA1MTk2MzExMTVeQTJeQWpwZ15BbWU2MDkwNDU5OQ@@._V1_.jpg",
    "keywords": "cabinet minister,political leader,tv mini series,king george v,prime minister",
    "name": "Winston Churchill: The Wilderness Years",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "sissoed"
        },
        "dateCreated": "2008-06-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0081963/"
        },
        "name": "Among the Best-ever Historical Dramatisations",
        "reviewBody": "I was very impressed by this film when it was broadcast in the 1980s, and have watched it many times since buying it on DVD. Robert Hardy's portrayal of Churchill is masterful, passionate, convincing, and authentic.\n\nBut what especially makes this one of the best-ever historical dramatizations are the performances of the other key actors: the men who portray Churchill's political colleagues and competitors. Edward Woodward, portraying Samuel Hoare, presents such a mixture of personal ambition, policy idealism, and jealousy that you feel you are experiencing a real human being, not a caricature that is simply performing a role to make a dramatic conflict with the main character. \n\nThe same is true of the other key roles. Peter Barkworth as Prime Minister Stanley Baldwin presents a calculating but tactful politician. Eric Porter as Neville Chamberlain is a compelling performance of a man so focused on the pursuit of peace and economic well- being at home that he deceives himself as to Hitler and the Nazis' true character. \n\nWithout exception, there are no stereotypes, no simplistic characters, presented here. All of Churchill's opponents are good men, dedicated to the peace and prosperity of the British people, whose flaw is that they are so dedicated to that cause that they deceive themselves regarding the character of Hitler. \n\nIndeed, in many ways, after researching the history of the subjects covered, I grew to like Churchill's opponents almost as much as I like Churchill. A major sequence in this film focuses on India  where the supposed \"villain,\" Samuel Hoare, is working overtime to achieve a reform bill for India that gives greater freedom and self-government to the Indian people, in part by removing a restrictive trade law that gave Manchester cotton-men a guaranteed market in India. The testimony Hoare suppressed  and that Churchill is so keen to expose  was in favor of perpetuating protectionism that raised the prices paid by poor Indians. This film ignores this, because it reveals Churchill to be a reactionary anti-free- trade protectionist on this issue. The India bill that Churchill opposed, and that Hoare, Baldwin, and Ramsey Macdonald (also one of the Prime Ministers portrayed) supported was a visionary bill that did honor to the British people, and it has been forgotten only because World War II, and the subsequent Indian independence movement, have buried it under the weight of more significant history. Then later, Hoare becomes one of those who realizes the true character of Hitler, and it is he, not Churchill, who forces Chamberlain to act after the Nazi invasion of Poland. If I were the ghost of Sir Samuel Hoare, I would find this film to be a great vindication. \n\nChurchill as presented here  and, I think, in real life  was a feeling, but not a calculating, man. Again and again in this film, Churchill due to his good nature is tricked by the deceits of his opponents, to the point that he comes across almost as unintelligent. As Stanley Baldwin puts it at a key point in this film, if Britain went to war, Churchill would be the best choice for Wartime Prime Minister, but in peace, never. There is a fair amount of Churchill idolatry on the conservative side of the American political spectrum, which ought to be tempered with the recognition that a rational and calculating mind is usually what is needed to run a government. \n\nIn 1940, after the disaster at Dunkirk, a trio of journalists writing under the pen-name Cato produced a short book, \"Guilty Men,\" that blamed Chamberlain, Baldwin, Hoare, and others for misjudgments and self-interest that led to the \"appeasement\" policy. The book was hugely popular and has colored the public and academic-historical understanding of the \"Wilderness Years\" ever since. This film follows the same line, as does the 2007 book \"Troublesome Young Men\" by Lynne Olson. But as reviewer Andrew Stuttaford wrote in the New York Sun, this view \"spared the rest of the British people the embarrassment of asking themselves what exactly they had been doing while the threat from the Third Reich grew. It was, after all, a period in which Britons in their millions had not only participated in 1935's unofficial 'Peace Ballot' (collective security, 'effective' sanctions, you know how it goes), but had also, after three more years of Hitler, taken to the streets to celebrate the deal Chamberlain cut at Munich.\" And as Evan Thomas wrote in Newsweek (23 June 2008), Franklin Roosevelt's response to Chamberlain's Munich deal was a telegram to Chamberlain saying \"good man,\" and FDR wrote the US ambassador to Italy \"I am not a bit upset over the final result.\" \n\nThe lesson of this film is that many of us, when we set out on a career and identify goals that we want to achieve to make great reputations for ourselves, have a tendency to see the other people we encounter in life as having personalities and motivations that will facilitate our getting what we want. As presented here, Baldwin wanted peace and prosperity for Britain, and so he seized on the idea that while Hitler was warlike, Hitler wanted war only with the Soviets, not with the West, so Britain need not fear. His successor, Chamberlain, also wanted peace and prosperity, and knew that he would be thwarted if Hitler really was all-out for war; so he saw Hitler as also being a man who wanted peace and prosperity. Both men gambled on Hitler, and Germany, being a leader and nation that would, due to their own interests and preferences, act in ways that would make it possible for Baldwin and Chamberlain to achieve their own ends. The lesson here for us today is to separate-out from our assessments of foreign leaders the way we hope those leaders are if we are to achieve our own goals.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0081963/"
}