{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Robson Green",
            "url": "/name/nm0338292/"
        },
        {
            "@type": "Person",
            "name": "Mark Letheren",
            "url": "/name/nm0504675/"
        },
        {
            "@type": "Person",
            "name": "Emma Handy",
            "url": "/name/nm0359692/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 8733,
        "ratingValue": 8.3,
        "worstRating": 1
    },
    "contentRating": "TV-MA",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050539/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0104823/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0033860/"
        }
    ],
    "datePublished": "2002-11-14",
    "description": "A psychologist gets inside of the minds of both killers and victims to aid the police in solving gruesome serial killings in Northern England.",
    "genre": [
        "Crime",
        "Drama",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWRiNGIyZGQtNjIzNi00YmM3LTk1ZDktNDNiZTlkOTMxYTljXkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_.jpg",
    "keywords": "female police officer,serial killer crime,psychologist,police,serial killer",
    "name": "Wire in the Blood",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "d_sakaki"
        },
        "dateCreated": "2003-01-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0337792/"
        },
        "name": "Suspenseful British Drama at its Best",
        "reviewBody": "I was lucky enough to have a copy taped from BBC America (cheers, Mom!) -- if you're a Robson Green fan, it's a fantastic showcase for his acting. Not as cavalier as his \"Touching Evil\" series; his \"Wire in the Blood\" character of Tony Hill is much more reserved, quirky, and, being a criminal profiler, is more internalized with his processing of information. Even if you're not a Robson Green fan, this will surely garner him new followers. There were three full-length movies: \"The Mermaid's Singing\", \"Shadows Rising\", and \"Justice Painted Blind\". The first two, \"Singing\" and \"Shadows\" are adaptations of author Val McDermid's books;\n\n\"Justice\" is an original script based off of McDermid's work, but closely follows her style and she was directly involved with its creation, so I think it's a respectful homage to her work as a whole, so I don't think her fans will be disappointed. All three deal with strange and grisly serial killings, the profiling of possible suspects, and the drama involved with tracking down the unique killers. Set against the backdrop of the bleak, lonely hills of the north of England, the movies are all gritty and disturbing (but not overly-so), and they really show the darker side of human nature and the lengths at which a profiler like Tony Hill is willing to venture to capture the killer. The supporting cast is brilliant; Hermione Norris as D.I. Carol Jordan is just wonderful to watch. Intelligent, sincere, and admirably professional, it's as much her story as it is Tony Hill's. The chemistry they have is marvellous to watch and not at all contrived. Personally, I think \"Mermaids\" was the best; it was the first, it clearly had the most detailed characterizations and plot complexity, and was definitely the most vicious -- some scenes definitely not for the faint of heart. But still compelling and highly recommended. The other two are still great, well-plotted and suspenseful, but slightly less edgy as the first. I recommend seeing the series in its proper order, to catch little references to past storylines."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Short trailer for this thriller show",
        "duration": "PT23S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1698890265",
        "name": "Wire In The Blood: Series Six",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjJkMTBjNzUtM2ExYi00Nzk1LThlZWUtOTE2ZGZjOThmYWI2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjJkMTBjNzUtM2ExYi00Nzk1LThlZWUtOTE2ZGZjOThmYWI2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-09T14:49:36Z",
        "url": "https://www.imdb.com/video/vi1698890265/"
    },
    "url": "/title/tt0337792/"
}