{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Todd Allen",
            "url": "/name/nm0021112/"
        },
        {
            "@type": "Person",
            "name": "Tawny Kitaen",
            "url": "/name/nm0000478/"
        },
        {
            "@type": "Person",
            "name": "Stephen Nichols",
            "url": "/name/nm0629731/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7476,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0032369/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0042650/"
        },
        {
            "@type": "Person",
            "name": "Kevin Tenney",
            "url": "/name/nm0855107/"
        }
    ],
    "datePublished": "1987-03-13",
    "description": "When his girlfriend becomes dangerously obsessed with a ghost she contacted using a Ouija board, Jim reluctantly joins forces with her ex-his own estranged childhood best friend-to identify and exorcise the evil spirit.",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Tenney",
            "url": "/name/nm0855107/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Horror",
        "Mystery",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzhhODQwOTctYjdmMi00NWJjLTg1NjMtMWRhMWJlODNlMjFlXkEyXkFqcGdeQXVyMzU4ODM5Nw@@._V1_.jpg",
    "keywords": "ouija board,psychic,medium,ghost child,female nudity",
    "name": "Witchboard",
    "original_info": {
        "id": "Witchboard_1986",
        "name": "Witchboard",
        "year": "1986"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "thesar-2"
        },
        "dateCreated": "2010-01-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0090327/"
        },
        "name": "TTFN!! Just a little psychic humor of the 80s",
        "reviewBody": "I Love the 80s! You gotta love productions like Witchboard, if you like the 1980s. It is the ultimate 80s horror flick: bad hair (including punk multi-colors and mullets), microfiche, bad dialogue, smoking in a hospital (?!?), waterbeds, cheap thrills and open-shirted male shirts with hair flowing from masculine chests to the screen. It's actually a guilty pleasure of mine and hard to downgrade since I grew up on it.\n\nMy sister was the one that loved this movie when I was young and like a lot of late-1980s flicks (i.e. A Nightmare on Elm Street 4: The Dream Master and Dirty Dancing) she got me hooked on this one. Now, watching it again, honestly the first time since the late 1980s, it's such an extreme flashback. I mean dialogue like \"TTFN – ta ta for now\" or \"I got a bad feeling about this\" should sum it up. Oh, and the foggy graveyard helps too.\n\nWe have a bizarre love triangle between former best male friends and a female third who is soon-to-be engaged to one of the males at a party and an Ouija Board. They contact (for fun) a dead 10-year-old Davidor did they bring about an evil spirit? Either way, ditzy red-headed Linda (Tawny Kitaen) continues to \"play\" with the board alone when she's not supposed to! Inadvertently, she concurs up this other \"evil\" spirit and people start dying left/right. Will the two males fighting for her attention solve the problem before she's fully possessed? It's hilarious. Really. If you watched this for the first time, outside of the 1980s, you might laugh your ass off. But, I'm glad this movie was made; this was an extreme homage to that period. It's kinda scary – not really, but if you believe in this hocus-pocus Ouija stuff. It's gory. And it has the most laugh-out-loud outrageous finale, as if they ran out of ideas and had to close it out. This is for die-hard fans, or just someone out for a good laugh.\n\nSide Note: I remember reading a wonderful \"Ask Marilyn\" (by Marilyn vos Savant) article that stated on how to prove the Ouija is a hoax, and I believe her. You get two people to control the Ouija Board, but blindfolded and have a third party watch them. Since they can't subconsciously control the pointer while in the dark, the results should be hilarious. Honestly, I have yet to try that, but I have met very few that believe in such nonsense. I'd love to prove the insanity this board has produced. At least it produced a fantastically fun 1980s horror movie.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT2M38S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3615670553",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGNmYjRiNzYtNDJkNy00MGRjLTk2NzMtZmFjYzEyYzE1M2NjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGNmYjRiNzYtNDJkNy00MGRjLTk2NzMtZmFjYzEyYzE1M2NjXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-10-05T19:51:12.377Z",
        "url": "https://www.imdb.com/video/vi3615670553/"
    },
    "url": "/title/tt0090327/"
}