{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Landon Hall",
            "url": "/name/nm0355809/"
        },
        {
            "@type": "Person",
            "name": "David Byrnes",
            "url": "/name/nm0126316/"
        },
        {
            "@type": "Person",
            "name": "Julius Antonio",
            "url": "/name/nm1211175/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 245,
        "ratingValue": 2.5,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0003222/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0011639/"
        },
        {
            "@type": "Person",
            "name": "Stephen Downing",
            "url": "/name/nm0047732/"
        },
        {
            "@type": "Person",
            "name": "Stephen Downing",
            "url": "/name/nm12185661/"
        }
    ],
    "datePublished": "1997-05-29",
    "description": "Will Spanner, parted from his body, finds a hooker who can hear him; meanwhile Detectives Lutz and Garner investigate a string of murders seemingly tied to ancient Egypt.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Paul Girard",
            "url": "/name/nm0320697/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Crime",
        "Fantasy",
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjExMjk4Njg4NV5BMl5BanBnXkFtZTcwNjgxOTIyMQ@@._V1_.jpg",
    "keywords": "ritualistic murder,police detective,female police detective,prostitute as protagonist,part of series",
    "name": "Witchcraft IX: Bitter Flesh",
    "original_info": {
        "id": "Witchcraft IX: Bitter Flesh_1997",
        "name": "Witchcraft IX: Bitter Flesh",
        "year": "1997"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "FieCrier"
        },
        "dateCreated": "2005-09-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0118181/"
        },
        "name": "fairly entertaining, not very horrific, generous amount of nudity and sex scenes",
        "reviewBody": "Two dead bodies are on the floor of a modern art gallery, one of them belonging to lawyer/ warlock Will Spanner. Spanner gets up out of his body, at which point his body disappears. Detectives Lutz and Garner find the other body, then later find the body of a woman who's had her heart cut out, and Egyptian symbols painted on the wall in black along with a triangle with an eye over it painted in blood.\n\nSpanner wanders around as a ghost, until he finds someone who can hear (but not see) him. That person is Sheila, a hooker, who's gained some powers after having a car accident.\n\nThis being an erotic horror movie, or at least having ambitions in that direction, there are a few sex scenes with Sheila. There are also some involving Spanner's girlfriend Keli with someone using his body.\n\nSpanner tries to warn his girlfriend, about whom Sheila has had a bad premonitory nightmare, and their story intersects with that of the police investigation. Stephanie Beaton plays Detective Lutz, formerly played by Alisa Christensen in Witchcraft 7. Being a Detective, evidently one is allowed to wear high heels, short skirts, and extremely low-cut blouses; good thing, too! Garner and Keli are played by different actors than in part seven as well, but David Byrnes returns as Spanner.\n\nThis movie picks up where Witchcraft 7 left off (also directed by Girard), though it rewrites how that one ended to some extent. Spanner's dead in a gallery instead of a home. There's another body with him, when the one in 7 was a not-dead-yet vampire who crawled away and died elsewhere. Lutz and Garner saw Spanner dead, here they didn't. Spanner has long hair and a goatee he lacked in part seven.\n\nThere are some confusing images during the opening credits of this one which are not in this movie, which are flashbacks to that one. Consequently, it may be better to watch 7 before this, though with most other titles in the series the order doesn't matter. Part Eight is unrelated.\n\nThis is fairly entertaining, although it takes a while to get moving. Will Spanner wanders around a lot in the beginning, and we meet some characters who turn out to be unimportant. The actress playing Sheila performs a bit unevenly, but that may have been the direction she was given.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 4,
            "worstRating": 1
        }
    },
    "url": "/title/tt0118181/"
}