{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Miranda Odell",
            "url": "/name/nm0643984/"
        },
        {
            "@type": "Person",
            "name": "Lauren Ian Richards",
            "url": "/name/nm1219155/"
        },
        {
            "@type": "Person",
            "name": "Kathleen St. Lawrence",
            "url": "/name/nm1217992/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 290,
        "ratingValue": 2.9,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Person",
            "name": "Ron Ford",
            "url": "/name/nm0285858/"
        }
    ],
    "datePublished": "2000-05-09",
    "description": "Three drama students revive three witches, who want to open a gate to hell; Will Spanner and Kelly get involved, while Detectives Lutz and Garner investigate.",
    "director": [
        {
            "@type": "Person",
            "name": "Ron Ford",
            "url": "/name/nm0285858/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Horror"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDcyMjc5MDIzNV5BMl5BanBnXkFtZTgwMjYzMzA5NjE@._V1_.jpg",
    "keywords": "reference to abaddon,portal to hell,human sacrifice,ghost rape,sex with a priest",
    "name": "Witchcraft XI: Sisters in Blood",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2012-10-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0191654/"
        },
        "name": "So Bad You'll Love It",
        "reviewBody": "Witchcraft XI: Sisters in Blood (2000) \n\n** (out of 4) \n\nThree college girls are putting on a production of MacBeth when they decide to become witches and help a demon find a key that will open the gateway to Hell. Lucky for the world that one of the girls has a sister that is dating the one and only Will Spanner (James Servais). This eleventh film in the series gets a higher than normal rating from me but please don't think it's because this is a better made movie or anything like that. No, this here is just as bad as the previous ten entries but this one here is so laughably bad that I couldn't help but have a good time with it. I've seen a great number of movies and I really can't think of a film where rape is funny. The subject is ugly and I'm really ashamed to say this but there's a rape scene here that's actually funny and it's when two of the witches rape a priest who is crying and begging for his virginity. The scene is obviously so wrong but at the same time the priest's performance is so bad that you can't help but laugh. This film also offers up other hilarious performances and just check out the \"acting\" towards the end when the three girls are walking off and the crowd of heroes are reacting to them. This film also manages to be a tad bit gorier than previous entries and we even get some violent face ripping and stabbing to the eyes. As for nudity, there's quite a bit here but the majority of it comes from people you really don't want to see naked. Stephanie Beaton returns as Detective Lutz and her scene at the end where she's being sexually attacked is something you've got to see to fully believe. Kathleen St. Lawrence plays the main witch here and while her acting wasn't the greatest, I thought she was incredibly cute and I noticed that this was her only film credit, which leads me to believe she found other ways of making money other than taking her clothes off for an eleventh film in a series. Again, WITCHCRAFT XI is a bad movie but thankfully it's bad enough to make you laugh and keep you entertained."
    },
    "url": "/title/tt0191654/"
}