{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mushond Lee",
            "url": "/name/nm0497931/"
        },
        {
            "@type": "Person",
            "name": "Cynda Williams",
            "url": "/name/nm0930326/"
        },
        {
            "@type": "Person",
            "name": "Guy Torry",
            "url": "/name/nm0868956/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 131,
        "ratingValue": 4.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0093901/"
        },
        {
            "@type": "Person",
            "name": "Bobby Thompson",
            "url": "/name/nm1332900/"
        }
    ],
    "datePublished": "2003-05-11",
    "description": "Robert Hightower's seemingly perfect life is turned upside down when his girlfriend announces that she is pregnant and pressures him to get married. When the friends and family get together, it's a battle of the sexes like no othe...",
    "director": [
        {
            "@type": "Person",
            "name": "G. Stubbs",
            "url": "/name/nm1324360/"
        }
    ],
    "duration": "PT1H31M",
    "genre": [
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc5NjUzNzU3Nl5BMl5BanBnXkFtZTcwNzg0OTcyMQ@@._V1_.jpg",
    "name": "With or Without You",
    "original_info": {
        "id": "With or Without You_2003",
        "name": "With or Without You",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "danceability"
        },
        "dateCreated": "2009-10-23",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0346148/"
        },
        "name": "Enjoyed This Movie",
        "reviewBody": "ENJOYED THIS MOVIE \n\nI'd never heard of this movie when I picked it up in DVD shop so I took a chance and bought it. That was 6.50 euro well spent because I was not disappointed. This movie is funny at times, sad at times, thought-provoking at times, but entertaining at all times. Anyhoo, I turned my ringer off so I wouldn't be disturbed. If you like \"30 Years To Life\" you'll like this movie too. The main reason I like this movie is because the characters are so real: the drunk who puts somebody on blast at the family gathering, the \"Oreo\" friend (black on the outside, white on the inside), the \"Ms. Independent I Don't Need No Man I Got Dental Benefits and my own business\" female, the angry one who has that inner turmoil but is taking it out on everybody else, the so- called \"Mack\" who fronts like he's \"The Man\" when he's really on lock, the \"We need to take this relationship to another level\" one,(marriage) and the loud sister, the one who keeps the party going no matter what (Wendy Raquel Robinson). The only thing I didn't like about this movie is that in some scenes women were referred to as \"b-----s\" and \"h--s.\" Anyway, Guy Torry is an outstanding actor, he acted his heiny off in this one. His character is the one that stood out. But don't take my word for it, take a chance like I did and see it for yourself. You won't be disappointed.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0346148/"
}