{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "George Bush",
            "url": "/name/nm0124132/"
        },
        {
            "@type": "Person",
            "name": "George W. Bush",
            "url": "/name/nm0124133/"
        },
        {
            "@type": "Person",
            "name": "Jimmy Carter",
            "url": "/name/nm0141699/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 238,
        "ratingValue": 5.7,
        "worstRating": 1
    },
    "datePublished": "2004-11-01",
    "director": [
        {
            "@type": "Person",
            "name": "Calvin Skaggs",
            "url": "/name/nm0803761/"
        },
        {
            "@type": "Person",
            "name": "David Van Taylor",
            "url": "/name/nm0888083/"
        }
    ],
    "duration": "PT1H40M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTMxNjE1ODExNl5BMl5BanBnXkFtZTcwNzQ5MDEzMQ@@._V1_.jpg",
    "keywords": "american politics,american politician,hypocrisy,american exceptionalism,american imperialism",
    "name": "With God on Our Side: George W. Bush and the Rise of the Religious Right in America",
    "original_info": {
        "id": "With God on Our Side: George W. Bush and the Rise of the Religious Right in America_2004",
        "name": "With God on Our Side: George W. Bush and the Rise of the Religious Right in America",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jeromec-2"
        },
        "dateCreated": "2007-01-26",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0431468/"
        },
        "name": "Its about the influence of the Religious Right",
        "reviewBody": "I have read the comments of others on this board about this film.\n\nI guess my objection to what I've read is that people did not understand fully what they were watching. It was the rise of the influence of the religious right or as it is stated the evangelical right.\n\nIt began with the protestant opposition to Kennedy who mistakenly I think, assumed that Kennedy would take orders from the pope. Kennedy denied it, but we are led to believe that the right was not comfortable nor did they really believe him.\n\nBarry Goldwater represented the conservative views of the right: small government, moral integrity and standards of all kinds. The democrats under Johnson defeated him by painting him as a reactionary. If elected Goldwater would lead the country into social chaos if not international war. Funny the part fear plays in these things.\n\nNixon was next: Billy Graham openly supported him. The support was more inferred than openly stated. We all know why Graham was not happy about that friendship.\n\nThen came Jimmy Carter who for the first time spoke a language that was clearly understood by the right. It confused the rest of the nation, but it lead the right to recognize its power, which they used for Ronald Reagan. He was the first of the presidents to betray the grass roots that elected him and get away with it. He had in my mind, and I say this most grudgingly, real political moxie. He turned the right into advisers instead of activists. By bypassing the right but mouthing the words, he was able to hold onto their support while not being taken in by an agenda he did not fully endorse. Reagan was able to do this for 2 complete terms. It's a remarkable feat, wouldn't you say? Bush senior was not nearly so adept at handling the religious right, but Bush junior being a new convert himself, was. The masterstroke of that election was not to discredit the religious right by destroying Pat Robertson directly, but by discrediting Bakker and Falwell so that those around him tarnished Robertson. The religious right was divided. No one could organize them.\n\nThe danger in Bush Junior is that he endorses the right without the careful thought that political rule involves. It has issues that are far too confined to be a valuable contribution to social political needs.\n\nAs anyone can tell by my writing, I am left wing. I see a need for the right. They have valuable ideas and men of good will on both sides of the political spectrum can use each other's idea.\n\nBush does not represent the right. He is an abomination. There are men of good will in the Political Arena. Our job should be to find them and elect them no matter what our political beliefs. We are far too lazy in our political discussions.\n\nWe ought to investigate films like this and we don't understand them then we ought to do careful research. That's what the Internet is for.\n\nI give this a 9 out of 10. I took off one point only because I thought this could be edited just a bit better between the discussions about Bush senior and Clinton.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0431468/"
}