{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Peter Arnett",
            "url": "/name/nm0036250/"
        },
        {
            "@type": "Person",
            "name": "George W. Bush",
            "url": "/name/nm0124133/"
        },
        {
            "@type": "Person",
            "name": "Dick Cheney",
            "url": "/name/nm0155515/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 450,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0028460/"
        }
    ],
    "datePublished": "2004-06-17",
    "description": "There were two wars in Iraq--a military assault and a media war. The former was well-covered; the latter was not. Until now... Independent filmmaker, Emmy-award winningTV journalist, author and media critic, Danny Schechter turns ...",
    "director": [
        {
            "@type": "Person",
            "name": "Danny Schechter",
            "url": "/name/nm0770357/"
        }
    ],
    "duration": "PT1H38M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ4MDk0OTA0OV5BMl5BanBnXkFtZTcwMzY1ODc4Mw@@._V1_.jpg",
    "keywords": "media,wmd,interview,pentagon,military",
    "name": "WMD: Weapons of Mass Deception",
    "original_info": {
        "id": "WMD: Weapons of Mass Deception_2004",
        "name": "WMD: Weapons of Mass Deception",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "wscjr1"
        },
        "dateCreated": "2004-12-12",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0402577/"
        },
        "name": "The news media's relationship to the U.S. military",
        "reviewBody": "This is a documentary about the American media and their relationship to the military. It's all about spin. Why were newspapers and TV news so strongly pro-war in the prelude to the invasion of Iraq? One obvious reason is that they believed what the Bush administration told them about weapons of mass destruction, but others are suggested.\n\nParts of this movie are quite chilling, such as the footage of an American tank firing on the Palestine Hotel in Baghdad, which resulted in death and injuries to journalists staying there. The film reports on some very interesting facts, such as the relationship between which news networks a person watches and how misinformed they are.\n\nOne thing this movie is NOT about is the brutality of Saddam Hussein, as was suggested by another reviewer. There are some graphic scenes of children in hospitals, but their injuries resulted from American bombing.\n\nIf you think that Bush's invasion of Iraq was part of the war on terrorism, or believe that Iraq collaborated with bin Laden in planning 9/11, then you will think this film is hopelessly biased to the left."
    },
    "url": "/title/tt0402577/"
}