{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Darren Pleavin",
            "url": "/name/nm3638941/"
        },
        {
            "@type": "Person",
            "name": "Kenta Miyake",
            "url": "/name/nm1399925/"
        },
        {
            "@type": "Person",
            "name": "Akio Suyama",
            "url": "/name/nm0840501/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7965,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0080697/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0073964/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0055529/"
        }
    ],
    "datePublished": "2003-01-06",
    "description": "In a post-apocalyptic future where humans live in domed cities surrounded by wasteland, wolves are assumed to be two hundred years extinct.",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODIyYTk2ZWQtZjcxYi00MTUxLTg2YzgtZWViMjQ0NDA4YThlXkEyXkFqcGdeQXVyNjc3MjQzNTI@._V1_.jpg",
    "keywords": "snow adventure,multiple english dubs,babe scientist,belief in paradise,bleakness",
    "name": "Wolf's Rain",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "tsbischof"
        },
        "dateCreated": "2005-07-21",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0367439/"
        },
        "name": "Great anime which triumphs over its (very few) flaws.",
        "reviewBody": "I originally found this series on Adult Swim last summer, midway through the series, while scanning through the channels for something to watch on late-night television. I had never seriously watched anime before, and found myself fascinated with this series, especially with the characters. Not all people will find them so interesting, as some have pointed out, but if they appeal to you at all they will grow on you by the end of the series.\n\nAs for the flaws, they mostly are with character depth. Each character really has one main feeling, as you could probably guess from watching any episode. The conflicts, twists, and connections between characters make up for this, though, and while you could probably guess a number of the twists, they still have a great impact.\n\nTake in mind, though, that this comes from someone who is obsessed with the series. After seeing one episode, I fell hopelessly in love with it, though not for anime in general, as some might.\n\nAnimation here is much better than typical anime, with many talents from Cowboy Bebop, and the overall feel of it is that you don't really mind the shortcuts taken in animation, as they don't really distract you from enjoying the show.\n\nIf you want to sample the show before seeing a good amount of it, see at least the first five episodes (or DVD 1) before giving up, as it takes a short amount of time for the series to get into full gear. But once in full gear, you'll love it.\n\n30 episodes, with 4 recap episodes, probably the worst part of the show. Hence, don't buy DVD 4 if you end up wanting to own the series, unless you're a compulsive anime freak who must have all of the disks for the art/whatever. Even then, the episodes (15-18) really don't mean anything, and probably were a chance for the animators to have a vacation off in the tropics. But definitely watch episodes 27-30 if you watch the rest of the series. These are the most abstract of the series, and are very well done.\n\nOverall: 10 out of 10."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from Bandai Entertainment",
        "duration": "PT2M16S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi905838873",
        "name": "Wolf's Rain",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzg0ODBhMjItNDc3Ni00ZDI4LWJmZTktNzZhYzE4ZjkyZmFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzg0ODBhMjItNDc3Ni00ZDI4LWJmZTktNzZhYzE4ZjkyZmFjXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:26:23Z",
        "url": "https://www.imdb.com/video/vi905838873/"
    },
    "url": "/title/tt0367439/"
}