{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Kiley",
            "url": "/name/nm0453006/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 105,
        "ratingValue": 8.5,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Person",
            "name": "Mose Richards",
            "url": "/name/nm0724255/"
        }
    ],
    "datePublished": "1997-10-27",
    "director": [
        {
            "@type": "Person",
            "name": "Jim Dutcher",
            "url": "/name/nm1202525/"
        }
    ],
    "duration": "PT52M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIzNDE5MjczNV5BMl5BanBnXkFtZTcwNTY5NTUxMQ@@._V1_.jpg",
    "keywords": "wolf,wilderness,nature,naturalist,national forest",
    "name": "Wolves at Our Door",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "dubzrusty"
        },
        "dateCreated": "2015-06-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0326413/"
        },
        "name": "My Synopsis and Analysis",
        "reviewBody": "Ruthless Beasts or Protective Unit? Wolves are mysterious creatures. They are symbols of secrecy and menace. Wolves are the untamed call of the wild. These creatures are considered carnivorous; wild beasts with ruthless intentions. However, is that really the truth? Sure, one can't keep a fluffy wolf pup as a pet, but there are a few dimensions of wolf livelihood that society is failing to consider. The film Wolves at our Door sheds light on the true life a wolf pack raised in captivity experiences through the perspective of the Sawtooth Pack. Jim and Jamie Dutcher spend six years observing and interacting with the beautiful members of the Sawtooth Pack in the Sawtooth Mountains of Idaho. The Dutchers obtained wolf pups they then raised in captivity to observe them in their natural environment, as a pack. The relationship the couple has with the wolf pack is remarkable to see in this film. It is a bond built upon a six- year foundation. The couple lives just beyond a fence next to the pack's enclosure, enjoying the breathtaking patterns and lifestyles of the unit. The Dutchers allow the viewer to really consider how \"vicious\" a pack of wolves can be. They are a family unit and this film expresses that fully. It is an awe-inspiring film. The up close shots of the pack allow the viewer to feel near the beautiful animals. The sounds in the film are also crisp and clear. A particular scene that captured my attention was the scene when the three new pups are introduced to the original members of the pack. It is intriguing to watch three captive-raised animals immediately submit to animal instincts. Jim Dutcher said, \"Kamots is the leader, you guys are going to have to listen to him\" to the young pups. It was interesting to see these creatures behave like any other wild animal. As a viewer of this documentary, one can hear the crunch of the snow underfoot of the wolf pack. Jamie also recorded the howls created by the animals; beautiful voices traveling deep into the night. Jim Dutcher reminds us about the kill ratio between humans and wolves. As a society, we have killed thousands of wolves in North America. It is how many of us they have killed that is shocking: none. Jamie and Jim Dutcher show these \"devils in the dark\" in a new light in this film. In this film, Kamots, the wolf pack alpha, and his family unit are observed over the course of six years. Bottle fed at birth and released into the wolf enclosure at seven weeks, these wolves are considered captive, yet experience freedom for the rest of their lives, with occasional human interaction. The wolves live in a setting undisturbed by civilization and, unlike their wild brethren, are free of hunters. The pack begins with five wolves, but three years later, three pups are introduced into the family unit. The hierarchy of the wolf pack is explored in this film. There are decisive roles in a wolf pack. There is the alpha, the wolf pack leader, the beta wolf, second in command and the peacemaker, and the omega, the lowest rank of the pack who yields to others, are two important slots in pack life. Each wolf has strengths and weaknesses, and each wolf has an important role amongst the hierarchy of wolf society. As the pack expands and as the wolves age, the Dutchers observe their every move over the course of the seasons with minimal interference. Although the pack was raised by humans and understand human contact, I feel they, as a pack, still represent wolf packs in the wild as well. The interactions between the wolves are extraordinary to capture on film, which the Dutchers manage to do well. There is an impending threat for this wolf pack unfortunately. The Dutchers' permit for the land they are on is running out, and Jim and Jamie must find a new home for their little family. Will the family find a new, more permanent home in time? The documentary captures a beautiful story uncovering and dispelling the myths about wolves being dangerous creatures. They are only doing what is best for their family. That is the key beauty to a wolf pack. Family is always first on a wolf pack's priority list. The bonds between wolves grow every day and strengthen the unit as a whole. The only aspect of this film that keeps few viewers wary of wolves is that these are still technically captive wolves being observed, and the idea of \"observer bias\" must be considered. It is possible the Dutchers' interference with the wolf pack has changed the results of pack life caught on film. Overall, the film is beautiful, observing a solid story with a wonderful family dynamic. Unfortunately, this film lacks comparison to wild wolves. It is lovely to see positive features of these animals, but what are wolves wild and free from human activity like? I think having a wolf expert come in and interview about this topic would give this film that added support it needs. It is true that wolves are carnivorous and, in the wild, are unrelenting to their prey. However, this film shows a mysterious life of a wolf pack uncovered. The Dutchers have a very obvious passion for these animals as demonstrated by the film. Wolves are family, they are a unit, and although they still represent the mysterious, untamed call of the wild, this film sheds light upon the most undisturbed features of wolf life and shows their beauty as a family.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0326413/"
}