{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Willy Fritsch",
            "url": "/name/nm0295992/"
        },
        {
            "@type": "Person",
            "name": "Gerda Maurus",
            "url": "/name/nm0561276/"
        },
        {
            "@type": "Person",
            "name": "Klaus Pohl",
            "url": "/name/nm0688332/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3644,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "Woman in the Moon",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0021661/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0136934/"
        },
        {
            "@type": "Person",
            "name": "Thea von Harbou",
            "url": "/name/nm0902376/"
        },
        {
            "@type": "Person",
            "name": "Fritz Lang",
            "url": "/name/nm0000485/"
        }
    ],
    "datePublished": "1931-02-06",
    "description": "A tenacious scientist blasts off for the moon in hopes of riches that may be found there.",
    "director": [
        {
            "@type": "Person",
            "name": "Fritz Lang",
            "url": "/name/nm0000485/"
        }
    ],
    "duration": "PT1H35M",
    "genre": [
        "Adventure",
        "Comedy",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQ4NzM2NDA0MV5BMl5BanBnXkFtZTgwMDgzMDM1MjE@._V1_.jpg",
    "keywords": "moon,rocket,gold,love triangle,f rated",
    "name": "Frau im Mond",
    "original_info": {
        "id": "Woman in the Moon_1931",
        "name": "Woman in the Moon",
        "year": "1931"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Rosabel"
        },
        "dateCreated": "2005-02-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0019901/"
        },
        "name": "Excellent, despite some slow patches",
        "reviewBody": "The new Kino DVD release of 'Woman In The Moon' is a great addition to anyone's Fritz Lang collection. Once again, the new music composed for the film adds tremendously to the experience. I was astounded by how ahead of its time this movie was in terms of its science, and it was no surprise to read that Ufa had a team of science consultants working with Lang to supply realistic details. The use of the rotation of the Earth to provide extra impetus to the rocket, the way the booster rockets were discarded as the spaceship moved further out of the Earth's atmosphere - having grown up watching real moon launches in the 60s, it was astonishing to see the actuality echoed by fiction decades earlier. There was clearly a lot of attention to detail; they even figured out ways of conveying weightlessness in space, which were pretty advanced for the time. The special effect of trying to pour a bottle of wine without gravity was both funny and impressive. The movie is not one of Lang's great masterpieces, and I agree with other comments that point out that it tends to slow down in places. Lang always did like making long, long movies, and when he settled down to tell a story, he could really take his time getting everything perfect. When this involves people just sitting or standing in a room talking, it can get a little tiresome - in one scene, Helius is trying to get through on the phone to his partner Windegger, and it takes so long he has time to snip to pieces a big bouquet of flowers on the table in front of him. I swear, it seems to be happening in real time; if there were something exciting happening in the meantime somewhere else it might have passed more quickly, but we just keep cutting between a scene of a man impatiently holding a phone to his ear and snipping at flowers, and a scene of people sitting at a dinner table listening to a speech. Not even Lang can make this gripping, though I think he was defiantly determined to try. On the other hand, there are places where it works well. The long buildup to the rocket launch is terrific - I would have enjoyed it if it were even longer. The hangar in the darkening scene, lit with jumpy spotlights as the moon begins to rise, the slow, smooth monumental sliding of that massive machinery as the rocket glides forward to its launch position, dwarfing the human beings walking alongside it, and all the beautiful changes of camera angle to draw in the viewer, are very moving. I can see why the Nazis liked Lang and wanted to get their claws into him; if they could have harnessed him to make THEIR kind of movies, he'd have been a real prize for them, another Riefenstahl. 'Woman In The Moon' wasn't a hit at the time, mainly because Lang (as usual) wouldn't listen to the studio heads who wanted some concessions to the coming of sound technology, so it was a dinosaur silent movie when the public was engrossed with something new. But it is definitely worth watching, and its strong points are worth sitting through some tedious slow patches to enjoy.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0019901/"
}