{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Elle Alexander",
            "url": "/name/nm0018400/"
        },
        {
            "@type": "Person",
            "name": "Darryl Armbruster",
            "url": "/name/nm0035363/"
        },
        {
            "@type": "Person",
            "name": "Dayton Callie",
            "url": "/name/nm0130502/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 424,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0071026/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0014925/"
        },
        {
            "@type": "Person",
            "name": "David J. Burke",
            "url": "/name/nm0121653/"
        }
    ],
    "datePublished": "2002-08-04",
    "description": "A battle of the sexes breaks out when a woman follows her disgruntled husband and his buddy to a strip club and spots them getting lap dances.",
    "director": [
        {
            "@type": "Person",
            "name": "Chazz Palminteri",
            "url": "/name/nm0001590/"
        }
    ],
    "duration": "PT1H28M",
    "genre": [
        "Comedy"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTY4ODQ3NDQ0N15BMl5BanBnXkFtZTYwNTUwNDg5._V1_.jpg",
    "name": "Women vs. Men",
    "original_info": {
        "id": "Women vs. Men_2002",
        "name": "Women vs. Men",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "NoeValleyJeff"
        },
        "dateCreated": "2003-11-30",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0290018/"
        },
        "name": "A fun and funny flick about relationships and real people.",
        "reviewBody": "If you don't like relationship films, I won't get you started. Skip this and live a happier life. \n\nBut, if you like movies about real people, this one's a winner. (Don't be confused by it's designation as a \"comedy\" -- you'll laugh, but it's not \"funny, ha-ha.\" It's a humorous drama, a la \"Diner\" or \"to Gillian on her 39th Birthday\" -- if you didn't like those movies, you won't like this one.)\n\nThe acting, writing, and direction work together to put you in the middle of a really bad day in the marriage of Michael (Mantegna) & Dana (Lahti). They've hit that point in a relationship where everything's great, but nothing's right anymore. They're about ready to break up because they can't figure out how to talk about their problems with each other... perhaps because neither is sure what those problems are.\n\nUnlike most movies where people are having trouble talking to each other, these folks really try. Dana talks to Brita (Headly) and Mike talks to Bruce (Resier). Even without the flashbacks, you can really feel that these people have been living in each other's lives for decades. Dana & Mike want to break their vicious cycle, but keep falling into their old patterns. They get angry, say (or do) the wrong thing (realizing how wrong it is) and back themselves into a corner.\n\nThroughout, they try to keep a sense of humor about it all. Mike & Bruce make each other laugh, as do Dana & Brita...and we're laughing with them.\n\n They're all smart and thoughtful and yet have trouble keeping their eye on the prize, maybe because they've forgotten that it takes work to make a relationship work, even (especially?) after 20 years.\n\nFor a movie that takes place in just a single day and in so few sets, it's surprisingly open and light. Palminteri's direction is fantastic. He makes a scene where the boys head to a strip club seem intimate and quiet while a scene where a single male strips for the two girls seem raucous and rowdy.\n\n Palminteri gets the best performance I've seen out of Mantegna and the most intimate out of Reiser, so perhaps Palminteri remembers something about acting (even if he can't, in my opinion, act his way out of a paper bag). The women are equally amazing (Lahti and Headly showing they're more than just solid TV-series actors).\n\nDespite the trauma that these folks go through, you'll enjoy spending 90 minutes watching them watch their lives fall apart. And watching them pick up the pieces because they're still crazy (in love) after all these years.\n\nI rated this 9/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from MGM",
        "duration": "PT2M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2745500953",
        "name": "Women vs. Men",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTUyN2EwN2YtMjY1ZS00OTZhLTg2NDItMTI3YWQ5MzZhZDc4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTUyN2EwN2YtMjY1ZS00OTZhLTg2NDItMTI3YWQ5MzZhZDc4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2009-10-31T06:54:05Z",
        "url": "https://www.imdb.com/video/vi2745500953/"
    },
    "url": "/title/tt0290018/"
}