{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Peter Bogdanovich",
            "url": "/name/nm0000953/"
        },
        {
            "@type": "Person",
            "name": "Curtis Harrington",
            "url": "/name/nm0364252/"
        },
        {
            "@type": "Person",
            "name": "Peter Jason",
            "url": "/name/nm0419273/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 32,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "datePublished": "1999-09-09",
    "description": "A cinematographer for Orson Welles put together this compilation of reminiscences by people who worked with him in his later years.",
    "director": [
        {
            "@type": "Person",
            "name": "Gary Graver",
            "url": "/name/nm0004372/"
        }
    ],
    "duration": "PT1H34M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTE5OTI4OTM3MF5BMl5BanBnXkFtZTcwNDczODUxMQ@@._V1_.jpg",
    "name": "Working with Orson Welles",
    "original_info": {
        "id": "Working with Orson Welles_1993",
        "name": "Working with Orson Welles",
        "year": "1993"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "blanche-2"
        },
        "dateCreated": "2010-10-31",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0304952/"
        },
        "name": "Welles is the star",
        "reviewBody": "\"Working with Orson Welles\" is a low-budget production put together by Gary Graver, who worked as a cameraman for Welles in the last 15 years of his life. Welles was a complicated man, and the last years of his life were filled with excess, unfinished projects, and inability to find a distributor for anything he did finish. In one pathetic part of his biography, he goes out to dinner with Steven Spielberg in the hopes that Spielberg can help him find a distributor, only to have Spielberg fawn over him and want to talk about the Citizen Kane years. Welles was a sad case, a man who peaked in his twenties, who needed the discipline of the studio system but couldn't work within it.\n\nIn spite of all of this, or maybe because of this, he was a tremendous character and fantastic raconteur. Having seen the man interviewed for several hours on a documentary years ago, I came away loving him and believing there was no one like him.\n\nThe people who were interviewed for this documentary - Peter Jason, Peter Bogdonovich, Cameron Mitchell, Curtis Harrington, Susan Strasberg, Stacy Keach, etc., did so out of a love for Welles. I don't believe, as a previous reviewer said, that they were hangers-on who did the documentary for their own self-aggrandizement. This is not a Turner Classic Movies documentary with glossy production values. It probably cost all of $5. One could tell listening to their stories that they really cared about Welles. And the stories are great.\n\nUnfortunately, there was no footage of the films Graver spoke of, particularly \"The Other Side of the Wind,\" which would have been great.\n\nI enjoyed it.\n\nA piece of trivia: The beautiful woman who worked in many of these later films, Oja Kodar, was a lover of Welles while he was married to his last wife. When Welles died, Kodar and Mrs. Welles came to an agreement about how the estate would be settled - apparently Kodar was mentioned in the will. On her way to sign the final papers, however, Mrs. Welles was killed in a car accident.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0304952/"
}