{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Vincent Van Patten",
            "url": "/name/nm0887701/"
        },
        {
            "@type": "Person",
            "name": "Mike Sexton",
            "url": "/name/nm1427735/"
        },
        {
            "@type": "Person",
            "name": "Lynn Gilmartin",
            "url": "/name/nm4943503/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 421,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0178393/"
        },
        {
            "@type": "Person",
            "name": "Steve Lipscomb",
            "url": "/name/nm2254158/"
        }
    ],
    "datePublished": "2003-03-30",
    "description": "Poker players from around the world compete for large cash prizes",
    "genre": [
        "Game-Show"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODY3MTI2ZGQtMmMzOS00NzBlLWE5ZTgtN2U1ZjYxNzNmM2MzXkEyXkFqcGdeQXVyMzA3NjIxNDA@._V1_.jpg",
    "keywords": "cash,skill game show,poker,poker game,poker tournament",
    "name": "World Poker Tour",
    "original_info": {
        "id": "World Poker Tour: Season 1_2003",
        "name": "World Poker Tour: Season 1",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "jbenik"
        },
        "dateCreated": "2004-03-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0363391/"
        },
        "name": "More Than Just a Television Show",
        "reviewBody": "The World Poker Tour is more than just a television show. It has become a cultural phenomenon. Not only is it hugely popular for the Travel Channel, it has transformed the game itself. Thanks to the World Poker Tour and some of its internet-cardroom sponsors, poker has gone from a strange pursuit of middle-aged white guys in a smoke-filled corner of a casino that would rather use the space for more slot machines, to a passion for thousands of players of all ages and backgrounds. The show has already spawned other similar shows, including Celebrity Poker Showdown and the World Series of Blackjack. ESPN has been covering the World Series of Poker for years, but they have increased their coverage from a single show to a series, and have been hugely successful with it as well.\n\nBut what is the show like? Well, the production standards are high, and you can tell that having a tournament televised is a big deal to the tournament organizers. The producers do a good job in backgrounding the players, which is important since most of these people are not known by the public. And the Hole Card Cam is tremendously beneficial, since it allows viewers to see what the players are doing as they are doing it, instead of waiting until the cards are turned over. I've watched poker coverage without this advantage, and it is about as interesting as C-SPAN in Spanish.\n\n The commentary is mixed. Mike Sexton does a terrific job explaining the players' moves, and isn't afraid to say when he thinks that someone made a bad one. But \"Hollywood Home Gamer\" Vince Van Patten seems to me more about generating excitement than about anything resembling analysis. Former Coppertone model and host of \"Wild On\" Shana Hiatt is not exactly a poker pro either. But in her case, it is much more forgivable, since her role has more to do with interviewing players and presenting the casino to viewers than any kind of hard-core analysis. Plus, she's a breath of fresh air in a sport that is still dominated by middle-aged men who, well, let's say they could use some more time in the hotel exercise room.\n\nAll in all, the World Poker Tour is imperfect, but still one of the best things on television. It is a must-see for fans of card games, but be careful. Once you watch for the first time, it could very well become a permanent part of your Wednesday nights."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "World Poker Tour® is proud to announce the debut of the new main title open for its televised broadcast. Titled Rise Above, the new open is the third installment of the WPT® Legacy Through Art Series. Featuring music co-written by WPT CEO Adam Pliska and composer Sharal Churchill, Rise Above depicts the emotional journey of a player on the quest to reach the pinnacle of poker and join the prestigious WPT Champions Club.\nRise Above was produced and edited by WPT Studios, in conjunction with Big Block Entertainment.",
        "duration": "PT1M8S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1492434201",
        "name": "World Poker Tour: Rise Above",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZWM1ZjIzYzMtMmVlYS00YzIyLWI1NzctODJlZjczNjU4OTNlXkEyXkFqcGdeQUlNRGJWaWRlb1RodW1ibmFpbFNlcnZpY2U@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZWM1ZjIzYzMtMmVlYS00YzIyLWI1NzctODJlZjczNjU4OTNlXkEyXkFqcGdeQUlNRGJWaWRlb1RodW1ibmFpbFNlcnZpY2U@._V1_.jpg",
        "uploadDate": "2019-03-19T21:26:12.402Z",
        "url": "https://www.imdb.com/video/vi1492434201/"
    },
    "url": "/title/tt0363391/"
}