{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul Levesque",
            "url": "/name/nm0505391/"
        },
        {
            "@type": "Person",
            "name": "Chris Benoit",
            "url": "/name/nm0072240/"
        },
        {
            "@type": "Person",
            "name": "Shawn Michaels",
            "url": "/name/nm0382582/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1906,
        "ratingValue": 8,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0108337/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0017569/"
        },
        {
            "@type": "Person",
            "name": "Ed Koskey",
            "url": "/name/nm1550100/"
        }
    ],
    "datePublished": "2004-03-14",
    "description": "Triple H puts his Heavyweight Championship on the line in a Triple Threat Match against Chris Benoit and Shawn Michaels. WWE Champion Eddie Guerrero defends against Kurt Angle. Plus, Kane faces the returning Undertaker, Goldberg b...",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Dunn",
            "url": "/name/nm0242658/"
        }
    ],
    "duration": "PT4H35M",
    "genre": [
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjZhYWViZWQtZTBkYS00MGY3LTkzM2YtYTRlZTkxNjkwODgwXkEyXkFqcGdeQXVyODAzNzAwOTU@._V1_.jpg",
    "keywords": "tv special,professional wrestling,wrestlemania,live broadcast,twentieth part",
    "name": "WrestleMania XX",
    "original_info": {
        "id": "Wrestlemania XX 2004_2004",
        "name": "Wrestlemania XX 2004",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "LG2004"
        },
        "dateCreated": "2005-02-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0403687/"
        },
        "name": "Great, but I've seen better",
        "reviewBody": "I got WrestleMania XX as a Christmas gift, and it was pretty good. It's not the best WM, but it's up there (WrestleManias 17 and 19 were better). Here are my thoughts on the matches:\n\nContains Spoilers:\n\nWWE United States Championship: Big Show Vs. John Cena\n\nBig Show gave the doctor of thugonomics a couple of good shots, but Cena managed to beat him after 2 FUs. The first one Show kicked out of, but John hit the 2nd one after striking Show w/ one of his Word Life brass knuckles. 4/5\n\nWorld Tag Team Championship: Fatal Four Way Match: Rob Van Dam/Booker T Vs. Dudley Boyz Vs. Garrison Cade/Mark Jindrak Vs. La Resistance\n\nDecent match, with Booker and RVD retaining the gold. 3/5\n\nChris Jericho Vs. Christian\n\nGreat match between the former friends. The CLB wins after Trish interferes and accidentally hits Jericho, allowing Christian to roll up Y2J for the 3 count. This would be the start of Trish's heel run. 4/5\n\n2-3 Handicap Tag Team Match: The Rock and Mick Foley Vs. Evolution (Randy Orton, Ric Flair, and Batista)\n\nThe Rock returns to the ring to team up with Rock and Sock tag team partner Mick Foley. While the Rock electrified the crowd w/ the People's Elbow (and adding in his version of Flair's strut for good measure), he and Foley lose after Randy hits the RKO on Foley (who tried to use Socko). 5/5\n\nPlayboy Evening Gown Match: Sable and Torrie Wilson Vs. Stacy Keibler and Miss Jackie \n\nThe Raw and SmackDown! divas never cease to amaze me. Even though the 4 of them don't really wrestle, I loved the match. Instead of having to defeat each other by tearing off their gowns, Sable suggests that they all take their gowns off and wrestle without them (in lingerie). All of the divas are all for it, except Miss Jackie, who had to have hers torn off by Torrie and Sable. After a few near falls (some very nice roll ups), Torrie pins Miss Jackie, giving her and Sable the win. 5/5\n\nWWE Cruiserweight Championship Open: Chavo Guerrero Vs. Jamie Noble Vs. Funaki Vs. Ultimo Dragon Vs. Rey Mysterio Vs. Nunzio Vs. Tajiri Vs. Shannon Moore Vs. Billy Kidman \n\nA pretty fast-paced match, but I think it was over too quick. Chavo ends up retaining the title after his dad helps him pin Rey Mysterio. 3/5\n\nGoldberg Vs. Brock Lesnar: Special Guest Referee: \"Stone Cold\" Steve Austin It's not as bad as some people have said. Sure they didn't do much for a moment, but they started to battle later. Goldberg wins after a Spear and Jackhammer. Austin then stuns Lesnar and Goldberg. 4/5\n\nWWE Tag Team Championship: Fatal Four Way Match: Scotty 2 Hotty and Rikishi Vs. APA Vs. Basham Brothers Vs. Benjamin/Haas \n\nSame comments as Raw match, the champions retain their titles. 3/5\n\nWWE Women's Championship: Victoria Vs. Molly Holly \n\nIf Molly loses this, she gets her head shaved. Molly tries to use Victoria's Widow's Peak, but Victoria counters w/ a backslide pin, thus winning the match. Molly tries to escape from Victoria, but it's to no avail. Molly got what she deserved. A very close shave, you could say. lol 4/5\n\nWWE Championship Match: Eddie Guerrero Vs. Kurt Angle \n\nA great match. Eddie and Kurt pulled out all of their best moves in this one. I thought the match was over when Eddie hit the frog splash. Unfortunately, Kurt kicked out. Eddie would retain his title after cheating (unlacing his boot) and rolling up Kurt. 5/5\n\nUndertaker Vs. Kane \n\nNot their best match, but close. It was also a little rushed. Taker's new look is okay, but I prefer his 1999 Deadman look. Kane would fall to the Taker after getting the Tombstone. 3/5\n\nWorld Heavyweight Championship: Triple Threat Match: Triple H Vs. Chris Benoit Vs. Shawn Michaels \n\nThese 3 are some of the best superstars in the WWE today, although I'm not a fan of H-Boy. There were times when 2 of the men would briefly team up (HHH and HBK suplex Benoit through an announce table), but still it was every man for himself. The 3 men gave all they had in this match, and eventually Benoit would win after putting the Crossface on H-Boy, making him tap out. After the match, Eddie would come out and embrace his friend for his victory. 5/5",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT2M4S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4293001497",
        "name": "Wrestlemania XX",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmRmYzQ4MmEtYmQ1YS00NGE0LWE4YzYtZGRmNTQ1YzVjZDA3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmRmYzQ4MmEtYmQ1YS00NGE0LWE4YzYtZGRmNTQ1YzVjZDA3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-18T12:15:05Z",
        "url": "https://www.imdb.com/video/vi4293001497/"
    },
    "url": "/title/tt0403687/"
}