{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Eliza Dushku",
            "url": "/name/nm0244630/"
        },
        {
            "@type": "Person",
            "name": "Jeremy Sisto",
            "url": "/name/nm0005438/"
        },
        {
            "@type": "Person",
            "name": "Emmanuelle Chriqui",
            "url": "/name/nm0004825/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 124380,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046206/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002257/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0029749/"
        },
        {
            "@type": "Person",
            "name": "Alan B. McElroy",
            "url": "/name/nm0568416/"
        }
    ],
    "datePublished": "2003-05-30",
    "description": "Chris and a group of five friends are left stranded deep in the middle of the woods after their cars collide. As they venture deeper into the woods, they face an uncertain and bloodcurdling fate.",
    "director": [
        {
            "@type": "Person",
            "name": "Rob Schmidt",
            "url": "/name/nm0003343/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Horror",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQwMTkyMTY4M15BMl5BanBnXkFtZTYwMDc0NDE3._V1_.jpg",
    "keywords": "west virginia,wrong turn,bound and gagged,flat tire,hillbilly",
    "name": "Wrong Turn",
    "original_info": {
        "id": "Wrong Turn_2003",
        "name": "Wrong Turn",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "TJ1380"
        },
        "dateCreated": "2003-10-20",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0295700/"
        },
        "name": "A scary movie that actually scared me.",
        "reviewBody": "I usually don't find horror movies to be very scary. I've seen enough of them to know pretty much what's going to happen and when it will happen. They're generally so predictable that they just fail to illicit any kind of emotional response in me whatsoever. \"Wrong Turn\" is an exception, however. It's one of the rare horror movies that was actually as scary and disturbing to me as it was meant to be.\n\nThe plot, which involves six attractive young people being hunted by a family of cannibalistic mountain men, is very straightforward and offers no real surprises to fans of horror movies. As is the case in most of these movies, however, the plot quickly becomes besides the point, and the movie becomes more concerned with trying to frighten and disturb the viewer.\n\nNeedless to say, it succeeds. The mountain men prove to be some of the scariest movie killers that I've seen in a long time, probably because the film wastes no time in showing us exactly what they plan to do with their victims (we see this about a half-hour into the movie in a scene that is guaranteed to make at least half of the people who watch it really, really sick). They also manage to be more relentless and even more beyond reason than most horror movie killers; they behave more like wild animals than people.\n\nThe acting is considerably better than most movies in this genre. Granted, that's not saying much, but I actually felt more than a little sympathy for the two main characters (Eliza Dushku and the Ray Liotta-looking med student). They behave just like anyone else would in that situation, and they're likable enough and believable enough to make us root for them. I didn't find myself feeling much sympathy for the rest of the cast (they often act like typical slasher movie fodder, especially the two kids who get high and have sex shortly before being murdered), but they're at least more believable than the characters who usually appear in these movies.\n\nOverall, I would have to say that this movie was better than most of the horror movies that have come out lately. I wouldn't recommend it to everyone, but any fan of horror movies should definitely check it out."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Pre, \"Coming Soon\"",
        "duration": "PT34S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1946026265",
        "name": "Wrong Turn",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDY3YjZjODQtMzNkZC00ZTZjLTg2NTMtN2UyN2NiNTk1ZTkzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDY3YjZjODQtMzNkZC00ZTZjLTg2NTMtN2UyN2NiNTk1ZTkzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:27:09Z",
        "url": "https://www.imdb.com/video/vi1946026265/"
    },
    "url": "/title/tt0295700/"
}