{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fabienne Babe",
            "url": "/name/nm0044865/"
        },
        {
            "@type": "Person",
            "name": "Lucas Belvaux",
            "url": "/name/nm0069711/"
        },
        {
            "@type": "Person",
            "name": "Sandra Montaigu",
            "url": "/name/nm0538079/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 380,
        "ratingValue": 6.5,
        "worstRating": 1
    },
    "alternateName": "Wuthering Heights",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0254121/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0067540/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0247664/"
        },
        {
            "@type": "Person",
            "name": "Pascal Bonitzer",
            "url": "/name/nm0094726/"
        },
        {
            "@type": "Person",
            "name": "Suzanne Schiffman",
            "url": "/name/nm0771535/"
        },
        {
            "@type": "Person",
            "name": "Jacques Rivette",
            "url": "/name/nm0729626/"
        }
    ],
    "datePublished": "1985-10-09",
    "description": "Mistreated foundling Heathcliff and his stepsister Catherine fall in love, but when she marries a wealthy man, he becomes obsessed with getting revenge, even well into the next generation.",
    "director": [
        {
            "@type": "Person",
            "name": "Jacques Rivette",
            "url": "/name/nm0729626/"
        }
    ],
    "duration": "PT2H10M",
    "genre": [
        "Drama",
        "Romance",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODRlNTNlNTYtOGZmNi00ZmE0LTg0MjYtMWQ1NjQ3OWY2ZjIwXkEyXkFqcGdeQXVyMjQzMzQzODY@._V1_.jpg",
    "keywords": "foreign language adaptation,france,hautes pyrenees,obsession,mental illness",
    "name": "Hurlevent",
    "original_info": {
        "id": "Wuthering Heights_1985",
        "name": "Wuthering Heights",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "OldAle1"
        },
        "dateCreated": "2007-04-18",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0089312/"
        },
        "name": "Minor Rivette, but still beautiful and involving",
        "reviewBody": "I haven't read Wuthering Heights for many years, and I barely remember the couple of previous adaptations (the William Wyler production from '39 and the Buñuel from '54) that I've seen, so I was much more interested in seeing this as a little-seen, supposedly minor work of Jacques Rivette than as yet another adaptation of a hoary English classic. That may well be the best way to look at it, as I found this a fairly involving, even compelling story of unrequited and difficult loves, not just between the central characters of Heathcliff (Roch in this version, an at first bloodless but later quite savage Lucas Belvaux) and Catherine (deceptively strong-willed in Fabienne Babe's performance)....throughout the film there are hints of incestuous feelings on the part of Catherine's older brother Guillaume, and all of the characters seem to have powerful love-hate attractions to their landscape and environment, here translated to a remote and rocky pair of farms in 1930s France. The class distinctions between orphan Roch, his on-the-decline adoptive family, and the on-the-rise siblings Olivier and Isabel are subtly drawn and the feelings of entrapment in the remote vastnesses of both the two huge country houses and the wild hillside are always present, if more potently presented in the early parts of the film. Beautifully shot, though the VHS copy I watched suffered from rather washed-out color; the very minimal and rarely heard music is from the Bulgarian Women's Choir, fitting ultimately if not a very obvious choice.\n\nWhen all is said and done Rivette's theatrical style of shooting and direction of performances offers a lot of interesting counterpoint to the madness at the heart of the story, the actors seeming cool and detached and often still at many points both before and after short eruptions of violence and passion, but ultimately it does drain some of the drama from the story and I found the second act after Roch's return less involving than the first. Still, this is far from awful as I had been led to believe it might be and though it is certainly one of the director's weaker films it remains well worth seeing to his fans.\n\nLetterboxed VHS tape, rental. 8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0089312/"
}