{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Brock Lesnar",
            "url": "/name/nm1137025/"
        },
        {
            "@type": "Person",
            "name": "Paul Wight",
            "url": "/name/nm0927833/"
        },
        {
            "@type": "Person",
            "name": "Kevin Nash",
            "url": "/name/nm0621760/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 242,
        "ratingValue": 6.3,
        "worstRating": 1
    },
    "datePublished": "2003-05-18",
    "description": "The main feud heading into PPV on the SmackDown. brand was between Brock Lesnar against Big Show and on the Raw brand was between Triple H and Kevin Nash.",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Dunn",
            "url": "/name/nm0242658/"
        }
    ],
    "duration": "PT3H",
    "genre": [
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmQ1MTQwMWMtNWIwNS00OTYwLTg5YTUtOGVmNzA4MDE3NmU4XkEyXkFqcGdeQXVyMjkxODI3MTY@._V1_.jpg",
    "keywords": "live broadcast,female female kiss,thong,fitness model,women's wrestling",
    "name": "WWE Judgment Day",
    "original_info": {
        "id": "WWE: Judgment Day 2003_2003",
        "name": "WWE: Judgment Day 2003",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "wrestlingsitewebmaster"
        },
        "dateCreated": "2005-08-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0365905/"
        },
        "name": "Judgment Day 2003",
        "reviewBody": "This was a bad PPV, but 2 matches were very good indeed.\n\nThings get off to a disappointing start as Rhyno, Spanky and Chris Benoit battle FBI members Palumbo and Stamboli and John Cena. This was only 4 minutes long and it was a waste of time. Then Torrie Wilson battles Sable in a bikini challenge. Nice bikinis! but you can't help the fact that WWE stands for World WRESTLING Entertainment! Next up Hulk..... oh sorry Mr America battles 'Rowdy' Roddy Piper in a crap match. Why these two were on the show I do not know. Hogan and Piper apparently still believing it was 1985 tried to put on a good match, it didn't happen. Then Charlie Haas and Shelton Benjamin took it to Eddie Guerrero and Chavo Guerrero's replacement, Tajiri in a ladder match. This was a 1st class, ace match, and it saw Tajiri and 'Latino Heat' come out on top.\n\nNext up a disappointing IC battle royal takes place. All former IC champs which included Kane, RVD, Test, Lance Storm, Val Venis, Christian, Chris Jericho and Booker T (even though he wasn't a former IC champ before 2003) tried to put on a good match. It didn't happen, about 6 participants got eliminated in the first minute of the match, and Christian won by cheating! All Y2J done was shout during the match and Kane got eliminated 2nd! Just awful.\n\nNext up La Resistance battled Scott Steiner and Test in a match that they will be probably want to forget. This was crap. The only person I was interested in was Stacy Keibler. Then Trish Stratus, Jazz, Victoria and Jacqueline, 4 of the best Women around had an acceptable match for the Women's match.\n\nThen Kevin Nash took on Triple H for the World Heavyweight Championship in a p*ss poor match. This bored the arse off me and I think a Mae Young vs Goldberg match would have been better. Well it wouldn't but you get the picture! Then Brock Lesnar battled The Big Show in a fantastic stretcher match. Paul Wight (Big Show) had to win back the fans and locker rooms loyalty, because at Backlash he treated Rey Mysterio like a piece of garbage when he strapped him to a stretcher and swung him around the ring post. This sent Oscar Gueirretez (Mysterio) to the hospital folks, no kidding. Mysterio even made an appearance himself, before Lesnar put Show on a folk lift for the win! Overall Grade - C-",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 5,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer",
        "duration": "PT1M47S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2768109849",
        "name": "WWE Judgement Day 2003",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTg0NzM4YTQtZjY5ZS00NmYzLTk5MzktYmMxZTJmYmRkZGVkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTg0NzM4YTQtZjY5ZS00NmYzLTk5MzktYmMxZTJmYmRkZGVkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:28:04Z",
        "url": "https://www.imdb.com/video/vi2768109849/"
    },
    "url": "/title/tt0365905/"
}