{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mark Calaway",
            "url": "/name/nm0130587/"
        },
        {
            "@type": "Person",
            "name": "William Moody",
            "url": "/name/nm0600542/"
        },
        {
            "@type": "Person",
            "name": "Mark LoMonaco",
            "url": "/name/nm0518597/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 195,
        "ratingValue": 4.7,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0108337/"
        }
    ],
    "datePublished": "2004-06-27",
    "description": "Fatal 4 way US title match: John Cena vs Rene Dupree vs RVD vs Booker T. Cruiserweight title match: Rey Mysterio vs Chavo Guerrero. Bullrope match for WWE title: Eddie Guerrero vs JBL.",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Dunn",
            "url": "/name/nm0242658/"
        }
    ],
    "duration": "PT3H",
    "genre": [
        "Action"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTJlMDA0YmQtMDhjNy00ZTlmLTk4MGUtMWEwYWFhOWJmNTlmXkEyXkFqcGdeQXVyMjkxODI3MTY@._V1_.jpg",
    "keywords": "tv special,world wrestling entertainment,wrestling",
    "name": "WWE Great American Bash",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "SteveDonnachie20022001"
        },
        "dateCreated": "2005-05-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0417249/"
        },
        "name": "Man what a rip off",
        "reviewBody": "I just went to Walmart of all places to get a wrestling DVD{not good choices guys} and they had the great American Bash on DVD so I thought what the heck it looks pretty good. So I bought it,got home and watched it and man did I feel ripped off. I had more trouble trying to stay interested in this then I did trying to actually watch it. They had like 2 good matches but the rest of the card had slow boring matches.\n\n1. John Cena vs RVD vs Renne Dupree vs Booker T. The first match for Booker T and Renne Dupreee since the pointless draft of Smackdown and Raw of 2004. I guess it started out OK but the match got kind of stupid as it became more of a 1 on 1 match when just 2 of the 4 wrestlers would fight each other and there would be 2 more wrestlers outside the ring doing nothing. Its a fatal 4 way guys. That means all 4 wrestlers are supposed to fight in this. Anyways I'm no John Cena fan but I thought he really kept the crowd interested in this. So did Booker T. They have pretty good chemistry. I give this match a 2 out of 10.\n\n2. Charlies Hass vs Luther Reigns. This was a terrible match. Charlie Hass how far you have fallen since your tag team days with Shelton Benjamen. Charlie Hass did have to carry Luther through this match who looked lost at times and didn't seem like he knew what he was doing. This match got really good when it ended.\n\n3.Billy Gunn vs Kenso Susuki. Another bad match with missed spots. The match itself was so and it was hard to stay interested. You would think after 10 years of being in the WWE that they would push Billy Gunn better. But this had to be the worst match ever.\n\n4. Rey Mystero vs Chavo Gurerrero. Good match,high movies,great fast paced action. Finally it was starting to get good. Rey and Chavo work great together and they managed to wake up the fans in this match. This is the way a wrestling match should be. Fast paced and more then just punching and kicking.\n\n5. Hardcore Holly vs Mordeci. Not the best match. Hardcore Holly put the rookie over and the fact is the WWE much like the way they are using Billy Gunn,are doing the same thing to Hardcore Holly. Used to push wrestlers that can't wrestle.\n\n6. Eddie Guerrero vs JBL. Man this was the match that start a pointless JBL push. The guy can't wrestle at all. All he does is punch and kick. Not a bad match but I feel sorry for the WWE having to let Eddie lose the title to a man with no ability rather then keep the title on a man who has ability. And people wonder why Smackdown ratings have been down since JBL won the title.\n\n7. Undertaker vs the Dudley Boyz. This match wasn't what it could have been. I was expecting more violence in this one. The fact is this match was more of a tag team match then a 2 on 1 match. And the way they handled this storyline was awful. The Dudleys are OK but this wasn't the storyline for them. The Undertaker put on a OK match but he was better of as the American Badass. Besides if you look real carefully the Undertaker looked really bored during this match and looked like he didn't want to be part of this Paul Bearer abducting angle anymore.\n\nI gotta tell ya after seeing this pay per view it makes me wonder what ever happened to the heart of the WWE. Skip this pay per view by any means.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 2,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "HV-post",
        "duration": "PT56S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3705798937",
        "name": "Great American Bash",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWQxZTYyZDEtYjIxNi00MjgxLTk0YmYtNTYwM2Y1M2E3M2I3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWQxZTYyZDEtYjIxNi00MjgxLTk0YmYtNTYwM2Y1M2E3M2I3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-18T12:13:37Z",
        "url": "https://www.imdb.com/video/vi3705798937/"
    },
    "url": "/title/tt0417249/"
}