{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Dave Bautista",
            "url": "/name/nm1176985/"
        },
        {
            "@type": "Person",
            "name": "John Layfield",
            "url": "/name/nm0508044/"
        },
        {
            "@type": "Person",
            "name": "Eddie Guerrero",
            "url": "/name/nm0346181/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 205,
        "ratingValue": 5.6,
        "worstRating": 1
    },
    "alternateName": "WWE the Great American Bash",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0108337/"
        },
        {
            "@type": "Person",
            "name": "Court Bauer",
            "url": "/name/nm1219598/"
        },
        {
            "@type": "Person",
            "name": "Christopher DeJoseph",
            "url": "/name/nm2057866/"
        },
        {
            "@type": "Person",
            "name": "Rudy Fischmann",
            "url": "/name/nm1651880/"
        }
    ],
    "datePublished": "2005-07-24",
    "description": "Batista defends the World Heavyweight Title against John Bradshaw Layfield, Rey Mysterio continues his issue with Eddie Guerrero, the Mexicools take on the Blue World Order, Road Warrior Animal and Heidenreich challenge MNM for th...",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Dunn",
            "url": "/name/nm0242658/"
        }
    ],
    "duration": "PT3H",
    "genre": [
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjE4Mjk5MDg0OV5BMl5BanBnXkFtZTcwOTA5NDUzMQ@@._V1_.jpg",
    "keywords": "warrior,tag team,undertaker,returning character killed off,blonde woman",
    "name": "The Great American Bash",
    "original_info": {
        "id": "WWE: The Great American Bash 2005_2005",
        "name": "WWE: The Great American Bash 2005",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "SteveDonnachie20022001"
        },
        "dateCreated": "2005-07-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0457194/"
        },
        "name": "Better then last years",
        "reviewBody": "This is the second Great American Bash that the Smackdown brand has held. Now upon ordering this pay per view I was kind of worried that I would get a repeat of last years Great American Bash. Last years was one of the worst pay per views. But I was wrong. This years gave us more then what last years did.\n\nMatch 1. Animal and Hedenrech vs MNM. OK match. It was nice to see Animal back in the WWE affter Hawk died months ago. This was a OK match. Hedenrech needs to work on his matt skills a little better but he keeps improving with every pay per view that goes by. MNM is a great young team. But as of late they seemed to be the only team out there. The WWE needs to expand the tag team divisions on both Raw and Smackdown. Match 2.Christan vs Booker T. This was Christans first Smackdown pay per view since jumping from Raw to Smackdown. Pretty good match. A lot of Booker T sucks chants during the match since Christan seemed to be the favorite to win this match even though Christan was the heel and Booker was the face. Booker T needs to learn some new moves. Match 3. Chris Beniot vs Orlando Jordan for the US title. This was a good match. Beniot proved why he can go into a match and carry anyone over. Orlando Jordan isn't the best wrestler around and its funny at times listing to Tazz accidentally call Orlando Jordan, Shelton Benjamen from Raw. Big difference Tazz. Non the less this match did deliver some good wrestling action. Good moves. This was Chris Beniots first match upon coming back to Smackdown from Raw. Match 4. Undertaker vs Mohmaed Hussan. This feud got a lot of heat from the boys at the UPN network. Hassen did a angle with masked men pretending to be terrorist on the same day of the London terrorist attacks. And this ended up being Hassens first and only match on a Smackdown pay per view. This match was really violent at the end and it could have been a bit better had there been more build up. Match 5. BWO vs the Mexicools. This was a 6 man tag team match. Didn;t pay attention to it that much since the days of wrestling groups seemed to be over. Match 6. Torrie Wilson vs Malenia. This was a brawl and panties match. OK match. It would be nice if Smackdown would create a womens title and make Torrie Wilson and others show more wrestling holds in the ring instead of the getting tired Braw and Panties match. Match 7. Batista va JBL for the World Title. This match had a lot of hype. This was Batistas first Smackdown pay per view since coming to Smackdown. Finally Smackdown got a real champion and not the paper champion they had with John Cena. This match started out good but it got boring really quickly because it was just punching and kicking. And the match had a bad ending. It wouldn't hurt JBL to learn some new moves.\n\nOverall this pay per view wasn't perfect. But it was a step up from last years.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 6,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from WWE Home Video",
        "duration": "PT1M1S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2600337689",
        "name": "WWE: Great American Bash",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzU2Yjc4MmEtMTA3Ni00NmNmLWFkOTUtNTU5YTI0ZDVjOTFiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzU2Yjc4MmEtMTA3Ni00NmNmLWFkOTUtNTU5YTI0ZDVjOTFiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T17:27:27Z",
        "url": "https://www.imdb.com/video/vi2600337689/"
    },
    "url": "/title/tt0457194/"
}