{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Hulk Hogan",
            "url": "/name/nm0001356/"
        },
        {
            "@type": "Person",
            "name": "Mark Calaway",
            "url": "/name/nm0130587/"
        },
        {
            "@type": "Person",
            "name": "Paul Levesque",
            "url": "/name/nm0505391/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 266,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "datePublished": "2002-05-19",
    "description": "WWE Undisputed Title: Hulk Hogan vs. The Undertaker, Hell in a Cell: Triple H vs. Chris Jericho, WWE Intercontinental Title: Eddie Guerrero vs. Rob Van Dam, WWE Tag Team Titles: Billy & Chuck vs. Rikishi & Rico, WWE Woman's Title:...",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Dunn",
            "url": "/name/nm0242658/"
        }
    ],
    "duration": "PT3H",
    "genre": [
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI3NTQ2Mzg4NF5BMl5BanBnXkFtZTcwNjE3NDEzMQ@@._V1_.jpg",
    "keywords": "tv special,wrestling match,showdown,female wrestler,female fighter",
    "name": "WWE Judgment Day",
    "original_info": {
        "id": "WWE: Rebellion 2002_2002",
        "name": "WWE: Rebellion 2002",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "mishalwwechamp"
        },
        "dateCreated": "2009-08-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0316875/"
        },
        "name": "Judgement Day 2002",
        "reviewBody": "Judgement Day 2002 was a good Pay-Per-View but nothing compared to Wrestlemania XVIII.\n\nThe opening contest featured Intercontinental Champion Eddie Guerrero defending the gold against Rob Van Dam, this was an awesome match which showed a great opening.\n\nIn the second match Trish Stratus faced off against Stacy Keibler in an average match to retain the Womens Championship.\n\nThe Next match featured Brock Lesnar and his manager Paul Heyman going head-to-head with Matt and Jeff Hardy in a boring tag team match where Lesnar did all the work as Lesnar picked up the win for him and Heyman.\n\nNext Stone Cold Steve Austin went to war with Ric Flair and Big Show in an exciting match which ended in Austin picking up the victory.\n\nThe next match for the WWE Tag Team titles featured the champions Billy and Chuck facing off against Rikishi and his mystery partner Rico,a dull and short match with nothing special at all.\n\nThe next match was a fantastic hair vs hair match between Kurt Angle and his opponent Edge,this was definitely the greatest match of the night.\n\nIn the next match rivals Triple H and Chris Jericho faced off in a Hell In A Cell Match.There wasn't much you couldn't see in other Hell In A Cell matches.\n\nThe main event was a Survivor Series 1991 rematch the WWE Champion Hulk Hogan defending his gold against The Undertaker,a fairly good match with a horrible ending though.\n\nHere are the ratings: 1)Rob Van Dam vs Eddie Guerrero - 9/10 2)Trish Stratus vs Stacy Keibler - 6/10 3)Brock Lesnar and Paul Heyman vs The Hardys - 5/10 4)Steve Austin vs Ric Flair and Big Show - 8/10 5)Kurt Angle vs Edge - 10/10 6)Triple H vs Chris Jericho - 7/10 7)Rikishi and Rico vs Billy and Chuck - 4/10 8)Undertaker vs Hulk Hogan - 7/10\n\nOverall Rating - 8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0316875/"
}