{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Trish Stratus",
            "url": "/name/nm0833693/"
        },
        {
            "@type": "Person",
            "name": "Alice Stratigeas",
            "url": "/name/nm6701415/"
        },
        {
            "@type": "Person",
            "name": "Helen",
            "url": "/name/nm6701416/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 160,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0108337/"
        }
    ],
    "datePublished": "2003-10-06",
    "description": "Trish Stratus Is Shown And Highlighted Throughout Her Known Careers In This Collection.",
    "duration": "PT2H30M",
    "genre": [
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZjE2MzMxODQtYzI5ZS00ZDhlLTk3ZDUtMTBiZmZhNDI0M2QxXkEyXkFqcGdeQXVyMjQ4ODQxNjI@._V1_.jpg",
    "keywords": "character name in title",
    "name": "WWE: Trish Stratus - 100% Stratusfaction",
    "original_info": {
        "id": "WWE: Trish Stratus: 100% Stratusfaction Guaranteed_2003",
        "name": "WWE: Trish Stratus: 100% Stratusfaction Guaranteed",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gridoon"
        },
        "dateCreated": "2005-11-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0428031/"
        },
        "name": "A stratusfying enough package, but it could have been even better",
        "reviewBody": "I expected the main feature to be the weakest part of this DVD and the extras to be the strongest, but it was the other way around.\n\n\"Trish Revealed\" is an entertaining, informative and well-paced hour-long documentary on Trish's life and career up to 2003. It begins from her childhood, goes to her years in the medical school and her early steps as a fitness model and traces her career in the WWE, from a teasing piece of T&A to a \"comic relief\" catfighter (with Stephanie McMahon) to a legitimate wrestler to an international superstar. It also examines things like her main feuds with her fellow divas and her relationship with her fans.\n\nMy main complaint about this disc is that it doesn't include enough bonus matches. There are only four, and only three of those are real matches. In detail: \n\n1) Mud Match vs. Stacy Keibler (on Raw). OK, this sounds good. It isn't. It lasts about 2 minutes and it's mostly just splashing around in the mud. The women get so covered in it you can't even tell them apart! 0 \n\n2) Chicago Street Fight vs. Victoria (on Raw). This also sounds good, but it's much too brief (about 5 minutes). Some solid hits by both women with trash can lids and the like, but the match is not given enough time to develop the intensity it could have. ** \n\n3) Triple Threat Match vs. Victoria vs. Jazz (for the title, from Wrestlemania XIX). Very entertaining, and more of an actual TRIPLE threat than most such matches, but also too brief. Victoria, who was in her \"psycho\" mode then, steals the show; her \"shoulder tic\" is brilliant and her outfit ROCKS. ***\n\n4) Title Match vs. Jazz (from Insurrextion 2003). This is a mediocre match, but Trish puts in a good performance. Her escape from Jazz's boston crab alone makes it worth watching. **\n\nIn the rest of the extras, the standouts are the \"Home Tour\" (wow! nice home!) and the \"Diva of the Decade\" (nostalgic clips of older divas - and check out Lita's reaction when HBK announces the winner!). Most of the other stuff (\"Babe of the Year\" photo shoots, Summerslam commercial) is rather trivial (just for the record, I find Trish's looks a little overrated; she's not quite as hot as, say, Torrie Wilson). And there are some things (like the \"Much Music Awards\" segment, with Trish and Chris Jericho opening up two bags full of presents) that are just a waste of time (as Jericho himself points out repeatedly in that one).\n\nAll in all, I wouldn't recommend buying this DVD without watching it first, unless you're a very dedicated fan of Trish.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0428031/"
}