{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Paul Levesque",
            "url": "/name/nm0505391/"
        },
        {
            "@type": "Person",
            "name": "Dave Bautista",
            "url": "/name/nm1176985/"
        },
        {
            "@type": "Person",
            "name": "Randy Orton",
            "url": "/name/nm1169315/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 211,
        "ratingValue": 6.4,
        "worstRating": 1
    },
    "contentRating": "TV-14",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0108337/"
        }
    ],
    "datePublished": "2005-01-05",
    "description": "Intercontinental title match: Shelton Benjamin vs Maven. Woman's title match: Trish vs Lita. Kane vs Snitsky. World title elimination chamber match: HHH vs Edge vs Y2J vs Chris Benoit vs Batista vs. Randy Orton.",
    "director": [
        {
            "@type": "Person",
            "name": "Kevin Dunn",
            "url": "/name/nm0242658/"
        }
    ],
    "duration": "PT3H",
    "genre": [
        "Action"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDQ5MTAxYTAtYjU1Ny00NmY0LTgwZDQtZDBkNzJhOWIzYTg4XkEyXkFqcGdeQXVyMTEyMDcwNw@@._V1_.jpg",
    "keywords": "tv special",
    "name": "WWE New Year's Revolution",
    "original_info": {
        "id": "WWE: New Year's Revolution_2005",
        "name": "WWE: New Year's Revolution",
        "year": "2005"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "BunkhouseTito"
        },
        "dateCreated": "2005-01-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0430750/"
        },
        "name": "This Was Definitely A One Match Show.. And Eugene-Mania Is Alive And Well, Hopefully.",
        "reviewBody": "Usually, I review the DVD, but I thought I'd put up a review with my immediate thoughts on this show. I knew that Puerto Rico would be a great place to hold a Pay-Per-View due to the fact that the crowds there usually pop for anything and, to be honest, this event proves it. The wrestlers worked the crowd a lot more than usual and the fans sounded a lot louder than usual at times. \n\nMatch Reviews.\n\nWORLD TAG TEAM TITLE MATCH Eugene & William Regal (C) vs Christian & Tyson Tomko - Eugene made his entrance, in a mocking but lovable way, the same way that Hulk Hogan made his entrance back in 1984 when he beat the Iron Shiek for the WWF World Championship. They went as far as having a shirt made up for Eugene based on the old Hulkamania shirt, but instead said Eugene across. It even had the rips in the back and Eugene also wore the red and yellow headband. Personally, I loved it and this is a testament to what I was saying about the Puerto Rico crowd. They loved it, too. The match, itself, was not a great spectacle, but it was highly entertaining. Regal got opened up the hard way. With Eugene imitating \"his favorite WWE Superstars growing up\", he practically did a whole Hulk Hogan match. Hell, he could have headlined WrestleMania 6, or 19... or any of them that featured Hulk Hogan! Anyhow, I can only suspect that the supposed finish here was to have Eugene end it with the Leg Drop after the Big Boot to the face, but Eugene injured himself after a dropkick and they ended the match quickly thereafter.\n\nWOMEN'S TITLE MATCH Trish Stratus vs Lita (C) - A pretty short match that probably was not scheduled to go long anyways. This one was also cut short by a knee injury, and again, it didn't look all that bad on TV but the way that Lita was acting, one could tell it was not a work. She injured her knee doing a Thesz Press to the floor and if I remember right, she did another dive or two before the injury took place. Not a bad match, but the WWE needs some more women wrestlers before this division becomes more of a joke than it currently is.\n\nMuhammad Hassan with Khosrow Daivari vs Jerry \"The King\" Lawler with Jim Ross - Muhammad Hassan and Khosrow Daivari made their PPV debut here against Jerry Lawler. As you could imagine, this match was left without commentary. Daivari interfered at one point, then Jim Ross stood in his way to keep him from interfering again later in the match. \n\nINTERCONTINENTAL TITLE MATCH Shelton Benjamin (C) vs Maven - This was the biggest mismatch on the show, in my opinion. Maven should have been counted out long before he bothered to re-enter the ring as he went outside, stood on a chair and worked the crowd for nearly 10 minutes before returning to the ring and ending the match. \n\nKane vs Gene Snitsky - OK, so let me get this one straight. Gene Snitsky causes you to lose your unborn baby, puts you on the shelf for months, torments your wife while you are away and the monster Kane comes in and wrestles a match?? Kane and Snitsky worked a regular match for awhile which later turned into a semi-brawl. Not once was a weapon even used! This match exposed Snitsky as the horrible worker he is. I would have to say that I enjoyed the ladies match more than this one, and it's a sad day when the women make it into the top 3. Luckily, the WWE has all their eggs placed in one basket, here, and we are about to see it.\n\nELIMINATION CHAMBER MATCH FOR THE VACANT WORLD HEAVYWEIGHT CHAMPIONSHIP Triple H vs Randy Orton vs Batista vs Chris Jericho vs Chris Benoit vs Edge with Shawn Michaels as Special Referee - I think this match was used for two purposes. First, to do everything in their power to make Randy Orton into the super babyface they need him to be for WrestleMania. Second, to focus on the slow dissension of Evolution, mainly Triple H and Batista. They did an excellent job of slowly progressing that angle and making Randy Orton the feared babyface on the chase. Batista got put over strong because of his power. He pretty much destroyed Benoit and Jericho by himself and even threw Jericho onto a nearby camera man! Benoit executed a nice head butt from the top of the chamber at one point and another had Triple H in the Crippler Crossface at the same time he was in The Walls Of Jericho. Batista is then released from his chamber and helps Triple H out. Anyways, Triple H refuses to return the favor to Batista when he has the chance to help him out of a jam, unbeknown to Batista (I'm sure that he'll see it on RAW the next night) and lets him get eliminated after Orton's RKO. The show ends with Triple H on Batista's shoulders.\n\nOverall, it was still a fun show, despite all my criticisms. The main event clearly saved the show from being something as bad as NWO Souled Out or something of that nature and it was cool to see how Puerto Rican fans responded to the WWE. Plus, there was quite a bit of footage of Christy Hemme running around the poolside with other divas, rubbing oil on each other, chicken fights, etc. That alone is worth seeing New Years Revolution.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from WWE Home Video",
        "duration": "PT1M12S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi648937753",
        "name": "New Year's Revolution 2005",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTZmOWQwM2YtMTVkOS00Njg3LTg2NjUtYjc2ZmQyM2RlMzRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTZmOWQwM2YtMTVkOS00Njg3LTg2NjUtYjc2ZmQyM2RlMzRiXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-11T14:29:46Z",
        "url": "https://www.imdb.com/video/vi648937753/"
    },
    "url": "/title/tt0430750/"
}