{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Scott McNeil",
            "url": "/name/nm0573926/"
        },
        {
            "@type": "Person",
            "name": "Meghan Black",
            "url": "/name/nm0085428/"
        },
        {
            "@type": "Person",
            "name": "Christopher Judge",
            "url": "/name/nm0431895/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 12322,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "TV-Y7",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0042369/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0095134/"
        }
    ],
    "datePublished": "2000-11-04",
    "description": "This rendition of X-Men features Cyclops, Jean Grey, Rogue, Nightcrawler, Shadowcat and Spike as teenagers as they fight for a world that fears and hates them.",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2JmNTg5N2QtNDUyYi00MWJmLWJlYWMtZWMxOGIwZGI1YmY1XkEyXkFqcGdeQXVyMTI1Mzg0ODA5._V1_.jpg",
    "keywords": "older actors younger roles,teenager,high school,school,high school student",
    "name": "X-Men: Evolution",
    "original_info": {
        "id": "X-Men: Evolution: Season 1_2000",
        "name": "X-Men: Evolution: Season 1",
        "year": "2000"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Skeletors_Hood"
        },
        "dateCreated": "2004-07-02",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0247827/"
        },
        "name": "The best X-men cartoon ever!! Claws down!!",
        "reviewBody": "For those that despise this cartoon because it takes liberties, then change the freaking channel, bub, and shut the hell up.\n\nFor those who remember the early early days of X-men, they were all teenagers in a school, learning to use their powers to benefit mankind. Well, in comic book continuity, these characters have all grown up, married, divorced, died, betrayed their friends, etc etc etc.\n\nThis cartoon went back to the basic principle that Stan Lee and Jack Kirby started out with back in the 60's. And it's revamped itself to fit today's standards and cultural influences. I like to see it as an animated version of the \"Ultimate X-Men\" title that marvel is producing, which does the same thing of reformatting the story to today's timeline. \n\nAnd each character in this show is well written to the point that I like them even better than some of their comic book counterparts.\n\nScott -- we're seeing a leader developing here, but he's still a kid learning to deal with who he is and his place in the world. \n\n Logan -- granted, he's toned down a bit, but he's just as gruff as he is in the comics, and has a better voice than he did in the 90's cartoon. \n\n Kurt -- great interpretation. I always thought Nightcrawler was a little stiff for my liking (given his background), so I love to see him be a party animal, and to be one caught goofing off.\n\nRogue -- BIG BIG BIG BIG BIG IMPROVEMENT!! I'm sorry purists, but the little Southern belle thing annoyed me to no end! Someone commented that they didn't like this version of Rogue because she doesn't say \"Suga.\" It's called good writing. I like Rogue better as a Goth girl, for one basic reason. Given her power, it would seem to me that she would keep herself isolated and sullen, to ward off anyone trying to get close to her, and the dark depressed goth girl would pull that off, not the friendly southern belle. Plus, it makes her an interesting contrast to Jean and Kitty, who are upbeat popular girls. \n\nToad -- they took one of the worst characters of comicdom, and made him likable. He works better as a lovable loser, who just can't get a break.\n\nI will also give honorable mention to a couple other characters, like Magneto, who is actually a threatening presence in this cartoon, and Beast, whose transformation in this cartoon makes more sense than in the comics.\n\nThe best animated X-Men yet, and it will be very hard to top."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "This rendition of X-Men features Cyclops, Jean Grey, Rogue, Nightcrawler, Shadowcat and Spike as teenagers as they fight for a world that fears and hates them.",
        "duration": "PT1M21S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi408796697",
        "name": "DVD Trailer - Season 1",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTVlYmIxYjQtNDliYS00YTJlLTkyZjEtMGM4Yzk0NThlNWIwXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTVlYmIxYjQtNDliYS00YTJlLTkyZjEtMGM4Yzk0NThlNWIwXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-08-18T11:02:06.561Z",
        "url": "https://www.imdb.com/video/vi408796697/"
    },
    "url": "/title/tt0247827/"
}