{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Patrick Stewart",
            "url": "/name/nm0001772/"
        },
        {
            "@type": "Person",
            "name": "Hugh Jackman",
            "url": "/name/nm0413168/"
        },
        {
            "@type": "Person",
            "name": "Halle Berry",
            "url": "/name/nm0000932/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 557893,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "X2: X-Men United",
    "contentRating": "PG-13",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0000756/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0095134/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0001946/"
        },
        {
            "@type": "Person",
            "name": "Zak Penn",
            "url": "/name/nm0672015/"
        },
        {
            "@type": "Person",
            "name": "David Hayter",
            "url": "/name/nm0371684/"
        },
        {
            "@type": "Person",
            "name": "Bryan Singer",
            "url": "/name/nm0001741/"
        }
    ],
    "datePublished": "2003-05-02",
    "description": "When anti-mutant Colonel William Stryker kidnaps Professor X and attacks his school, the X-Men must ally with their archenemy Magneto to stop him.",
    "director": [
        {
            "@type": "Person",
            "name": "Bryan Singer",
            "url": "/name/nm0001741/"
        }
    ],
    "duration": "PT2H14M",
    "genre": [
        "Action",
        "Sci-Fi",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDk0NjYxMzIzOF5BMl5BanBnXkFtZTYwMTc1MjU3._V1_.jpg",
    "keywords": "logan character,erik lehnsherr character,professor charles xavier character,rogue character,storm character",
    "name": "X2",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "suicidea"
        },
        "dateCreated": "2004-01-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0290334/"
        },
        "name": "why all the underrating?",
        "reviewBody": "A lot has been said about this movie, as is the case with many recent Hollywood comics adaptations. While I truly respect everyone's opinion, I really don't see the point in some criticisms brought up against this movie.\n\n(Definitely NO spoilers ahead.)\n\nFirst of all, we must realize that X-men comics have been around for decades. They existed before many of you were born. Still, the producers had to assume that the average audience had little or no idea about the mutant phenomenon, but Bryan singer did a very good job (as always) in the first film, and introduced the audience. Besides, adapting such a story with so many characters to the screen is no easy job, and is also risky, considering it's Hollywood and it must return all those millions. So the mutant phenomenon was well explained, the characters and their abilities introduced, and the plot (which actually had a story, unlike many action flicks) was carried out smoothly. All in the running time of one film. good job.\n\nThe second film, however, had to concentrate (naturally) on more characters and a more thorough story. This is why I object (in the title) to people criticising this film for \"lack of character development\" etc. Many of the characters WERE developed in the first film. If you never read x-men comics, and did not even see the first movie, and see this one right away and still expect the director/writer to spell things out for you, well, you'll be disappointed. \"Where did Colossus take the kids during the attack?\" someone asked. To hide them somewhere, THAT'S where he took them. I don't think people would like to see the director spell out everything, such as Colossus' inner voice saying, \"Well, let me take these kids somewhere beneath this multimillion dollar facility, to hide them from the bad guys.\"\n\nAnd the newly-introduced characters were introduced well enough. You see their abilities, you see whose side they're on, you even learn more about their personalities as the movie progresses. What else do you need to learn? Which team he supports?\n\nThe highlight of the film was definitely Mystique's transformation scenes, very well done.\n\nThe movie had many shortcomings, of course, the pace slowed down more than once, some main characters, especially Cyclops, were almost lost, but the plusses were way more than minuses. Especially Nightcrawler, who almost stole the lead from Wolverine. I must also add that Wolverine is much more violent in this film than the first, much more like the original comic character.\n\nAs for the people who complain about the abundance of characters. Well, bad news for you. X-men is not a story of a couple of guys and their girlfriends. There are much more characters, hopefully to be seen in the next sequel(s). Jubilee, Pyro and Colossus were all hinted in this one. Though I'm eager to see Gambit also, I can't wait to see how they will do the Beast. Of course, I can see the \"no character development\" people asking each other, \"Who is Beast?\"\n\nIn short, this movie does what it's supposed to do: Gives us entertainment, and shows us our favorite characters on screen."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "US Home Video Trailer from 20th Century Fox",
        "duration": "PT52S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3840016665",
        "name": "X-Men 1.5",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTQxMzMxOTI4MF5BMl5BanBnXkFtZTcwOTc2OTg2MQ@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTQxMzMxOTI4MF5BMl5BanBnXkFtZTcwOTc2OTg2MQ@@._V1_.jpg",
        "uploadDate": "2008-04-18T12:16:02Z",
        "url": "https://www.imdb.com/video/vi3840016665/"
    },
    "url": "/title/tt0290334/"
}