{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "John Doe",
            "url": "/name/nm0230335/"
        },
        {
            "@type": "Person",
            "name": "Exene Cervenka",
            "url": "/name/nm0148923/"
        },
        {
            "@type": "Person",
            "name": "Billy Zoom",
            "url": "/name/nm0957847/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 431,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0302168/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060127/"
        },
        {
            "@type": "Person",
            "name": "Christopher Blakely",
            "url": "/name/nm1201066/"
        },
        {
            "@type": "Person",
            "name": "Alizabeth Foley",
            "url": "/name/nm0284093/"
        },
        {
            "@type": "Person",
            "name": "Everett Greaton",
            "url": "/name/nm1199335/"
        }
    ],
    "description": "This film is a documentary about the personalities in, and the music of, the early 1980's Los Angeles punk band X. There are studio and live performances by the band and interviews with band members; all nicely interspersed with f...",
    "director": [
        {
            "@type": "Person",
            "name": "W.T. Morgan",
            "url": "/name/nm0605085/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjYyYWY4MzgtNjM3Zi00OGU0LWJhYzUtOWYyODE4OGJkNzY4XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg",
    "keywords": "band,performance,interview,1980s,punk",
    "name": "X: The Unheard Music",
    "original_info": {
        "id": "X: The Unheard Music_1985",
        "name": "X: The Unheard Music",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "bradlewis98"
        },
        "dateCreated": "2009-09-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0092137/"
        },
        "name": "unique and exciting punk doc",
        "reviewBody": "I have seen an unholy amount of punk documentary and biopics; maybe even more than that. For whatever reason every band that half filled a bar has a film about their career/supposed influence. Once Arab On Radar got their own film you knew things had gone too far. Those quickie fan films can be exciting, and occasionally interesting...and sometimes you even find yourself half drunk and screaming in the background. But they rarely achieve the status as film, really just home videos for the die hards.\n\nThe Unheard Music is the exception that proves the rule. Maybe due to being produced when the market/distribution plan would have been nebulous at best, this comes across as an independent and brilliant piece of art, which just happens to feature one of the first wave LA's best punk bands. Unheard Music is constructed like a collage, like one of those bootleg video mixtapes that were floating around the underground back in the day. Your basic interview, performance, rehearsal sequences are intercut with found footage and various Exene based weirdness.\n\nThe true greatness of the film is the illustration of how X could never possibly find themselves in any subsection of the mainstream. For a band that is so informed by the classic sounds of American rock and roll, for a band that would have had dance hits in 1957, it is disheartening to listen to sleazy label suits babble about how the entire country would not \"get\" X. It's obnoxious at best to think those weasels are making value judgments about my taste based on geography. But then maybe that does explain Nickelback.\n\nThis is a fresh an exciting film about not just X, but what a statement it once was to say you were into punk. It took a certain amount of effort since the powers that be actively kept you from hearing this music. Wasn't on the radio, TV, or in suburban record stores. Makes you really understand how much of an uphill battle artist-musicians have.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0092137/"
}