{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Kenichi Suzumura",
            "url": "/name/nm0840720/"
        },
        {
            "@type": "Person",
            "name": "Jun'ichi Suwabe",
            "url": "/name/nm1146347/"
        },
        {
            "@type": "Person",
            "name": "Mitsuaki Madono",
            "url": "/name/nm0535070/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1737,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "X",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0080697/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0060607/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0022946/"
        }
    ],
    "datePublished": "2002-09-24",
    "description": "Kamui Shirou and Fuuma Monou have been best friends ever since they were kids. Fate, however, separates them when Fuuma's mother died under a mysterious circumstances. Fast forward, 6 years later, a 16 year old Kamui has now retur...",
    "genre": [
        "Animation",
        "Action",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BM2NlZmM3MDAtYjU5Yi00YTIwLTg3OWQtM2QyNGM3MDYzNWY0XkEyXkFqcGdeQXVyMTA0MTM5NjI2._V1_.jpg",
    "keywords": "older actors younger roles,based on comic book,bishoujo,apocalypse,bishounen",
    "name": "Ekkusu",
    "original_info": {
        "id": "X_2001",
        "name": "X",
        "year": "2001"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "film-critic"
        },
        "dateCreated": "2008-11-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0312258/"
        },
        "name": "Two Futures -- One Destiny",
        "reviewBody": "The world is in trouble. Through the course of fated destinies, a handful of trained warriors have been called to either protect humanity or to cleans the Earth, bringing about a rebirth to the land. Ironically, a double-edged sword  or twin sword, \"X\" is an epic adventure that builds characters that an audience can follow, a plot that is emotional, and animation that is so grandiose, that it would make Disney shed a tear. Alas, that isn't to say this series is without faults, but the central key moments are so developed, that one cannot help but jump from one episode to the next, eager to see what befalls our heroes and villains. This was my first full-length animated series (outside of \"Serial: Lain\") that I have experienced, and while it wasn't as powerful as my prior viewings, it was enough to keep my interest going in this genre. \"X\" is a series of powerful battles, engrossing story arcs, impressive sounds, and unexpected turns  so developed that even the amateur anime watcher will be captivated by this world. \"X\" requires dedication, it requires time, and it requires strength to remember who is interconnected with whom, but in the end, it pays off rewardingly.\n\nUpon watching this series, one could easily jump to the finale to see the epic conclusion, but what makes \"X\" more than just your typical Saturday-morning cartoon epic is the characters that we literally get to understand (and at times fall for) within the twenty-four breathtaking episodes. The evil of Fuma, the depression of Subaru, and the love that Satsuki feels are just a few of the emotions that we are privy to throughout this series. Also within the twenty-four episodes, we see moments of fantasy, destruction, betrayal, love, death, and desire. What pulled me in from the opening episode of this series is the curvy path the director as well as the creators took me on. We aren't introduced to the heroine right away, we are mislead, shadowed throughout, and while small truths are revealed in each individual episode, \"X\" continues to leave question upon question unanswered, forcing us to look forward to the upcoming episode. Couple this with the outstanding, crisp animation, and \"X\" seems refreshing in the tub of overplayed and over-recycled American animation. There were certain scenes that just stood out in your mind (especially the final battle), backgrounds that were breathtaking, and battles that made you ask, \"How did they do that?\" The adult themes and blood-filled battles (unheard of in American animation), bring a sense of realism to this story that is not suitable for young children, but as an adult, I would rather kids watch this instead of what is currently programmed.\n\nAlas, as mentioned earlier, \"X\" isn't perfect. It isn't a series that I could immediately reboot, but could suggest to friends. There is quite a bit of development towards a twin-sword in this series, and it likened me to what was impressive as well as disappointing in this series. As previously stated, each episode takes us closer to the truth; sometimes it was the pacing that draws us back. Twenty-four episodes are quite a bit to watch, and in the center episodes, as we develop further relationships and characters, there seems to be a lull in the momentum that was initially set. While battles do not seem to be in short supply, it is the introduction to characters that are impressive, but seem to be left behind as larger stories unfold. With some, they come and go quickly, almost as if our creators didn't really have a full plot for them to follow. This may be my only complaint about this seriesone can only repeat the fact that the characters were bold, impressive, and invigorating, but their roles within the world of \"X\" were not as exciting as I wanted them to be. This was a story about technology, humanity, and nature, and, alas, these three elements were not explored as well as they could. My other small complaint is the lack of real-world complications. While our character's emotions were honest and believable, the battles seemed staged merely due to the barriers they were able to use to not cause damage to the surrounding city. No humans actually were privy to this battle, and I think that could have been explored further. We seemed to focus only on our main characters, and only within their flashbacks, did we see any other involvement with the real world. I wished to see who the people supported, and who they would rally behind in such an epic battle. The ending does mention that the public never would know about their future, but it seemed cheap to me.\n\nOverall, this was a great series despite the picky critic flaws. I would recommend this series to anyone interested in an epic that involves a substantial storyline, amazing characters, and intense battle sequences. This would be a favorite to anyone who enjoys the \"Final Fantasy\" films or games.\n\nGrade: *** out of *****",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for X: The Complete Series",
        "duration": "PT1M8S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4146372121",
        "name": "X: The Complete Series",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmIyNmI2YWEtNGQ1NC00NDY1LWI5NjUtNTY2ZGY3ZWNmMDg5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmIyNmI2YWEtNGQ1NC00NDY1LWI5NjUtNTY2ZGY3ZWNmMDg5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2011-11-12T06:49:05Z",
        "url": "https://www.imdb.com/video/vi4146372121/"
    },
    "url": "/title/tt0312258/"
}