{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Richard Angelides",
            "url": "/name/nm1426474/"
        },
        {
            "@type": "Person",
            "name": "Stephen Berra",
            "url": "/name/nm0077284/"
        },
        {
            "@type": "Person",
            "name": "Brandon Biebel",
            "url": "/name/nm1379336/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1033,
        "ratingValue": 8.4,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "description": "A skate video created Girl Skateboards in 2003.",
    "director": [
        {
            "@type": "Person",
            "name": "Ty Evans",
            "url": "/name/nm1379896/"
        },
        {
            "@type": "Person",
            "name": "Spike Jonze",
            "url": "/name/nm0005069/"
        }
    ],
    "duration": "PT1H11M",
    "genre": [
        "Music",
        "Sport"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BODQyNzgwODYzOF5BMl5BanBnXkFtZTcwNTQ3OTQyMQ@@._V1_.jpg",
    "keywords": "skating,skateboard,skateboarder,new york city,skateboard ramp",
    "name": "Yeah Right!",
    "original_info": {
        "id": "Yeah Right!_2003",
        "name": "Yeah Right!",
        "year": "2003"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "pizzi89"
        },
        "dateCreated": "2004-11-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0368456/"
        },
        "name": "If you want to get into skateboarding, watch this!",
        "reviewBody": "First of all Heath Kirchart isn't in Yeah Right! you must have been thinking of the Emerica video or some Alien Workshop video. When I see this I was truly amazed, its truly inspirational. The Keenon tribute is quite moving. When the slow-mo deck close up comes on its a beautiful way to show the simplicity of skateboarding. \n\nThe skating is good. Brian Anderson has so much style, Marc Johnson- tricks done flawlessly executed to make them look so easy. Paul Rodriguez and Jereme Rogers have brilliant parts, so much talent from the young 'uns!. Rick McCrank and Mike Carroll- always inspirational but ending section could only go to one of the best street skaters in the world- Eric Koston. Pulls out all the hammers but you've got to see his last trick. The ending montage/credits was quite good, one of my favourite parts of the video. The montage in the middle was quite exceptional the build up and so-on was good, a little bit disappointed with Guy Mariano only having one trick but good so see Rick Howard skating so well. The Owen Wilson section was strange yet very entertaining (It is Eric Koston that skates not Owen Wilson)\n\nThe soundtrack for Yeah Right is perfect. All the songs fit each persons style of skating. This is a brilliant video to get into skateboarding, I recommend buying it and the video lived up to its high expectations. I nearly forgot to mention the special effects showcased in the video, The first being the skateboard they keep passing to each other, that section was brilliant. the second being the 'skatetrix' which was a little ridiculous but still good as it has never been used in a skate video, The last was the invisible board section which was quite entertaining. Oh yeah and the invisible ramps popping up throughout the video.\n\nGo buy this video or see it. Its truly amazing! one of the best skate videos ever made"
    },
    "url": "/title/tt0368456/"
}