{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Mickey Rourke",
            "url": "/name/nm0000620/"
        },
        {
            "@type": "Person",
            "name": "John Lone",
            "url": "/name/nm0518821/"
        },
        {
            "@type": "Person",
            "name": "Ariane",
            "url": "/name/nm0034661/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 16602,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014380/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0001757/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0007143/"
        },
        {
            "@type": "Person",
            "name": "Robert Daley",
            "url": "/name/nm1084359/"
        },
        {
            "@type": "Person",
            "name": "Oliver Stone",
            "url": "/name/nm0000231/"
        },
        {
            "@type": "Person",
            "name": "Michael Cimino",
            "url": "/name/nm0001047/"
        }
    ],
    "datePublished": "1985-08-16",
    "description": "A police detective cracks down on organized crime in Chinatown after the murders of Triad and Mafia leaders.",
    "director": [
        {
            "@type": "Person",
            "name": "Michael Cimino",
            "url": "/name/nm0001047/"
        }
    ],
    "duration": "PT2H14M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNzcyOWI0N2ItMzA4Yi00NjQxLTg5NWUtZjI5ODNkMGMyMDU2XkEyXkFqcGdeQXVyNDkzNTM2ODg@._V1_.jpg",
    "keywords": "husband wife relationship,chinatown,police raid,marital separation,xenophobia",
    "name": "Year of the Dragon",
    "original_info": {
        "id": "Year of the Dragon_1985",
        "name": "Year of the Dragon",
        "year": "1985"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "NateWatchesCoolMovies"
        },
        "dateCreated": "2016-05-11",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0090350/"
        },
        "name": "Absolutely blistering cop film. An underrated classic.",
        "reviewBody": "Michael Cimino's Year Of The Dragon is a visceral blast of pure Americana as only the man could bring us. It kills me that he suffered through that whole Heaven's Gate fiasco (which is actually a really good movie, but that's another story and argument entirely) because it extinguished any hopes of him making future films, and in doing so the studios effectively committed genocide against their own. Sure the guy was crazy as hell, but damn could he ever make a great film. This one is one of the most criminally overlooked cop flicks of all time, partly due to Cimino's scorching direction and partly due to a a performance of monolithic grittiness from Mickey Rourke as Captain Stanley White, the cop who won't stop. White is fresh out of Nam and mad as hell, launching a unilateral crusade of racist violence and self righteous fury against the Chinese crime syndicate in New York City, particularly a young upstart in their organization named Joey Thai (John Lone). Thai is as ruthless as White is determined, and the two clash in ugly spectacle, causing leagues of collateral damage on either side and inciting them both to roar towards an inevitable, bloody conclusion. Thai's elderly superiors warn him of men like White, men who are fuelled purely by anger, bitterness and nothing else, smelling the fire and brimstone in the air and wisely stepping out of the way. Thai is of a younger, more petulant generation and foolishly decides to meet the beast head on by essentially kicking the hornet's nest. White is warned by his caring wife (Caroline Kava) and fellow cop and friend Lou (Raymond J. Barry is excellent, firing Rourke up further with his work) not to mess with such a dangerous crowd. He has a volatile relationship with a beautiful Chinese American reporter (Arianne is the only weak link in the acting chain) who puts herself on the line for him by digging around in dangerous corners. The intensity level of this film is something straight from the adrenal gland; even in episodic scenes of introspect we feel the hum of the character's emotions, and when the conflict starts again, which it does in fast and furious amounts, the actors are simply in overdrive. Rourke has never been better than he was in the 80's, it was just his zenith of power. This isn't a role that gets a lot of recognition, but along with Angel Heart, Rumble Fish and Pope Of Greenwich Village, I think it's his best. He puts so much of himself into Stanley White that the edges which separate performer from performance begin to blur and waver, until we are locked into his work on a level that goes beyond passive consumption of art and elicits something reflective in us. Not to sound too hippie dippy about it, but the guy is just that good. On the calmer side of the coin, John Lone brings both evil and elegance to Joey, a slick surface charm that's constantly disturbed by Rourke's hostility, leading to an eventual meltdown that's very cool to see in Lone's expert hands. This is one for the ages and should be in the same pantheon with all timers like Heat, Serpico, The French Connection and others. Rourke fires on all cylinders, as do his colleagues of the craft, and Cimino sits cackling at the switchboard with a mad calm, yanking all the right levers in a frenzy of unhinged genius. Not to be missed.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Year of the Dragon",
        "duration": "PT2M7S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2617287449",
        "name": "Year of the Dragon",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjg3MDBhODgtYjMyNS00MjUxLWEwYzgtMjM0ZGJmMmRiZjk0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjg3MDBhODgtYjMyNS00MjUxLWEwYzgtMjM0ZGJmMmRiZjk0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2012-04-20T03:54:40Z",
        "url": "https://www.imdb.com/video/vi2617287449/"
    },
    "url": "/title/tt0090350/"
}