{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Neil Young",
            "url": "/name/nm0949918/"
        },
        {
            "@type": "Person",
            "name": "Jim Jarmusch",
            "url": "/name/nm0000464/"
        },
        {
            "@type": "Person",
            "name": "Ralph Molina",
            "url": "/name/nm0596776/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1925,
        "ratingValue": 6.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0021102/"
        }
    ],
    "datePublished": "1997-10-08",
    "description": "This film documents Neil Young and Crazy Horse's 1996 concert tour. Jim Jarmusch interviews the band about their long history, and we see backstage footage from the 1970s and 1980s.",
    "director": [
        {
            "@type": "Person",
            "name": "Jim Jarmusch",
            "url": "/name/nm0000464/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTYxOTE0OTYxMV5BMl5BanBnXkFtZTcwMDQ4MTU1MQ@@._V1_.jpg",
    "keywords": "super 8,interview,1980s,neil young,1970s",
    "name": "Year of the Horse",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Michael_Elliott"
        },
        "dateCreated": "2012-05-15",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0120539/"
        },
        "name": "Different but That Doesn't Mean Good",
        "reviewBody": "Year of the Horse (1997)\n\n** (out of 4) \n\nI can respect what Jim Jarmusch was going for. I mean, it's clear that the ugliness of this film was done on purpose but just because you respect someone for trying something different doesn't mean you have to be entertained by it. This documentary, the director's only to date, takes a look at Neil Young and Crazy Horse's 1996 tour with interviews with those involved as they discuss the history of the group. This includes a rather rocky road in the 1970s and various re-gatherings leading up to the '96 tour. Right from the start in big bold letters we're told about the 8mm, 16mm and various other formats used to create this film but whatever they were going for must have gotten lost in the mix because the end result is a pretty ugly film to look at and listen to. I understand the visuals of the film were probably meant to capture the mood and spirit of the music but by filming this way they've also delivered some rather ugly audio. I've heard a lot of people get upset over the selection of songs but as I've grown as a Young fan I've realized that he does what he wants and that includes releasing something with not too many hits. I didn't mind the song selection as the performances were quite good but sadly I thought the actual audio quality didn't do them justice. There was an interesting take on \"Tonight's the Night\" and a clever mix between an old and new performance of \"Like a Hurricane\" that was very good. With that said, the ugliness of the film also has some pretty boring interviews where Young and the band just keep talking and talking and quite often it's about a rather uninteresting subject. There's no question that Young die hards will want to check this out but others should probably avoid it."
    },
    "url": "/title/tt0120539/"
}