{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jon Anderson",
            "url": "/name/nm0026963/"
        },
        {
            "@type": "Person",
            "name": "Steve Howe",
            "url": "/name/nm0397895/"
        },
        {
            "@type": "Person",
            "name": "Chris Squire",
            "url": "/name/nm0820085/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 120,
        "ratingValue": 7.9,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0127181/"
        }
    ],
    "description": "Innovative rock band Yes have had a career spanning five decades. In 2001 they toured with a full orchestra to support their symphonic album Magnification. Tracks include Close To The Edge, Don't Go, Mood For A Day, Starship Troop...",
    "director": [
        {
            "@type": "Person",
            "name": "Aubrey Powell",
            "url": "/name/nm0694023/"
        }
    ],
    "duration": "PT3H14M",
    "genre": [
        "Documentary",
        "Music"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTc3ODQ1NjM4N15BMl5BanBnXkFtZTcwMjMzNjQ5MQ@@._V1_.jpg",
    "keywords": "concert film",
    "name": "Yes: Symphonic Live",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "couzijn"
        },
        "dateCreated": "2007-03-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0468586/"
        },
        "name": "All in all: a must for Yes fans and recommendable to anyone else",
        "reviewBody": "This concert DVD (from a Dutch performance in 2001) has it all: a fine performance, a great atmosphere, an almost exemplary recording of both sound and image, and an interesting set list. This is certainly more than enough to please Yes fans. And because of the large variety of songs, styles and performances, I guess that listeners who are not accustomed with Yes music yet (but with good ears) will find find more than enough to understand why Yes has reached, and is still on top of the symphonic rock bill after almost forty (!) years. The symphonic orchestra adds some really nice touches, enhance yet never take over the music, just as it should be. The only drawback for me is a lack of 'bite' in some of the more raw numbers. I still prefer the studio version of 'Gates', for instance. Anderson presents most of the songs in an endurable 'in jest' way. This makes it harder for me to take him, and even the music, seriously. Yes music is not 'in jest'. It is MUSIC, pure and simple, in all its excitement, magnificence, joy, aggression, and virtuosity. Enjoy!",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0468586/"
}