{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ohad Knoller",
            "url": "/name/nm0461324/"
        },
        {
            "@type": "Person",
            "name": "Yehuda Levi",
            "url": "/name/nm1106990/"
        },
        {
            "@type": "Person",
            "name": "Assi Cohen",
            "url": "/name/nm1093856/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 7381,
        "ratingValue": 7.1,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0218758/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0001095/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0092052/"
        },
        {
            "@type": "Person",
            "name": "Avner Bernheimer",
            "url": "/name/nm1250701/"
        }
    ],
    "datePublished": "2002-08-01",
    "description": "Romance blooms between two soldiers (Knoller, Levi) stationed in an Israeli outpost on the Lebanese border.",
    "director": [
        {
            "@type": "Person",
            "name": "Eytan Fox",
            "url": "/name/nm0297202/"
        }
    ],
    "duration": "PT1H5M",
    "genre": [
        "Drama",
        "History",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZmQ1ZmVkZjMtMDc1Ny00NjMyLWFmNWItZGEzNGY1ZDAyOWMxXkEyXkFqcGdeQXVyMjMyMzI4MzY@._V1_.jpg",
    "keywords": "gay love,queer cinema,gay man,lgbt,lgbt interest",
    "name": "Yossi & Jagger",
    "original_info": {
        "id": "Yossi & Jagger_2002",
        "name": "Yossi & Jagger",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Libretio"
        },
        "dateCreated": "2004-12-22",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0334754/"
        },
        "name": "Love on the front lines...",
        "reviewBody": "YOSSI & JAGGER (Yossi VeJager) \n\nAspect ratio: 1.37:1\n\nSound format: Stereo\n\nOriginally produced for Israeli television but screened theatrically in Tel Aviv to great success before opening nationally to even greater commercial and critical acclaim, this engaging drama from director Eytan Fox has been hailed in some quarters as one of the best gay movies ever made. Running a mere 65 minutes, the film divides its time equally between a platoon of soldiers operating on the Israeli-Lebanese border, and the two men at the center of a clandestine relationship.\n\nYossi (Ohad Knoller) is a brooding commander who feels constrained by his role as a macho authority figure to conceal his sexuality from the conscripts under his command, while Jagger (Yehuda Levi, a popular Israeli heartthrob whose career was kickstarted by an appearance in the TV soap opera \"Cheers for Love\" in 2001) is one of his subordinates, a carefree guy who wants them to declare their love publicly by retiring from the Army and setting up house together. There's a now-famous scene, early in the movie, when Yossi and Jagger make love in the snow (don't get excited - all you see are some lingering kisses and the aftermath, in which the two characters are entirely at ease with one another, free from the restraints imposed by Army discipline), but their romance takes up a surprisingly small amount of the movie's running time, which appears to have been curtailed for reasons of length (there's a number of images doing the rounds from scenes which were apparently shot but didn't make it to the final print). Based on a true story, the film is warm-hearted but inconsequential, with some annoyingly jerky hand-held camera movements, and the climactic scenes are a little too restrained to be entirely successful (though Knoller, in particular, gives a truly remarkable performance in the aftermath of a devastating plot development). There's still much to admire, and any reservations are dispelled by the central romance, depicted with disarming frankness and performed with relish by Knoller and Levi. Highly recommended.\n\n(Hebrew dialogue)",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0334754/"
}