{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sean Connery",
            "url": "/name/nm0000125/"
        },
        {
            "@type": "Person",
            "name": "Akiko Wakabayashi",
            "url": "/name/nm0906686/"
        },
        {
            "@type": "Person",
            "name": "Mie Hama",
            "url": "/name/nm0357240/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 112426,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054040/"
        },
        {
            "@type": "Person",
            "name": "Harold Jack Bloom",
            "url": "/name/nm0089169/"
        },
        {
            "@type": "Person",
            "name": "Roald Dahl",
            "url": "/name/nm0001094/"
        },
        {
            "@type": "Person",
            "name": "Ian Fleming",
            "url": "/name/nm0001220/"
        }
    ],
    "datePublished": "1967-06-13",
    "description": "James Bond and the Japanese Secret Service must find and stop the true culprit of a series of space hijackings, before war is provoked between Russia and the United States.",
    "director": [
        {
            "@type": "Person",
            "name": "Lewis Gilbert",
            "url": "/name/nm0318150/"
        }
    ],
    "duration": "PT1H57M",
    "genre": [
        "Action",
        "Adventure",
        "Thriller"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNDMzZmIyZWEtYWZlNi00NjNiLWFhMGEtNGNmMjgwYWFiMjUwXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg",
    "keywords": "faked death,secret headquarters,japan,ninja,secret organization",
    "name": "You Only Live Twice",
    "original_info": {
        "id": "You Only Live Twice_1967",
        "name": "You Only Live Twice",
        "year": "1967"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "hitchcockthelegend"
        },
        "dateCreated": "2012-05-01",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0062512/"
        },
        "name": "Bond-san, Blofeld, Asian Delights and Production Value Supreme.",
        "reviewBody": "You Only Live Twice is directed by Lewis Gilbert and written by Roald Dahl. It stars Sean Connery, Tetsuro Tamba, Teru Shimada, Akiko Wakabayashi, Mie Hama, Karin Dor and Donald Pleasence. Music is scored by John Barry and cinematography by Freddie Young.\n\nBond 5 and Connery once again tackles the role of 007. With American and Soviet space craft mysteriously vanishing from space, both nations are laying the blame at the other's door. Sensing a nuclear war could break out, M assigns Bond to Japan to investigate if there might be a third party stirring the hornets nest. Teaming up with the Japanese secret service, Bond uncovers evidence that SPECTRE is behind the plot to pitch the East and the West against each other.\n\nThis organisation does not tolerate failure.\n\nThunderball had broke box office records for Bond, gadgetry, outlandish stunts and a quip on the tongue had proved most profitable. It was planned originally that On Her Majesty's Secret Service would be number 5 in the series, but a change of tack to go for You Only Live Twice as the story gave producers Broccoli & Saltzman the scope for a giganticus enormous production. However, it may be set in Japan and feature a Bond/Blofeld conflict, but Roald Dahl's script bares little resemblance to Ian Fleming's source novel. Although a massive financial success with a Worldwide gross of over $111 million, Bond 5 took $30 million less than Thunderball. Strange since this is a better film. Can we attribute the drop to it being a space age saga? Maybe, the rebirth of sci-fi was a few years away, and of course Bond had lost some fans who had grown tired, like Connery, of 007 relying on gadgets instead of brains and brawn to complete his missions. There was also the rival Casino Royale production, as bad as it was, to contend with, while the spy boom created by Bond had been overkilled elsewhere and was on the wane.\n\nExtortion is my business. Go away and think it over, gentlemen. I'm busy. \n\nTrue enough that You Only Live Twice has flaws, though they are far from being film killers if you like the gadgets and hi-techery side of the franchise? Connery announced once production was over that he was leaving the role of Bond behind. He had been close to breaking point after Thunderball, but finally the media circus, typecasting, the fanaticism and the character merely being a cypher for outrageous sequences, led Connery to finally call it a day. His displeasure shows in performance, oh it's professional, very much so, but the swagger and machismo from the earlier films has gone. Although Dahl's script tones down the \"cheese\" dialogue and unfolds as a plot of considerable World peril worth, characterisations are thinly drawn, making this reliant on production value and action sequences. Thankfully both are top dollar. And the ace up its sleeve is the long awaited face to face meeting of Bond and Blofeld.\n\nThe firing power inside my crater is enough to annihilate a small army. You can watch it all on TV. It's the last program you're likely to see.\n\nKen Adam's set design is fit to grace any epic in film history, as is Freddie Young's photography around the Japanese locales, Barry lays a beautiful Bond/Oriental score all over proceedings and Nancy Sinatra's title song is appealingly catchy. The action is excellently constructed by Gilbert (helming the first of three Bond movies on his CV), with the final battle at Blofeld's volcano crater base full of explosions, flying stunt men, expert choreography and meaty fights. Along the way we have been treated to Ninjas, Piranhas, poison, aeroplane peril and the awesome Little Nellie versus the big boy copter smack down! Then there's that Bond/Blofeld confrontation. Well worth the wait, with Pleasence visually scary with bald head (setting the marker for bald villainy to follow in TV and cinema it seems) and scar across his eye. Pleasence is also very low key with his menace, which is perfect, we don't want pantomime and the scenes with Bond work wonderfully well.\n\nIt made less than the film before it and it has fierce critics in Bond and Fleming circles. But it's a Bond film that pays rich rewards on revisits, where the artistry on show really shines through in this HD/Upscale age. 8/10",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "James Bond and the Japanese Secret Service must find and stop the true culprit of a series of space hijackings, before war is provoked between Russia and the United States.",
        "duration": "PT3M19S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi4247831321",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGJlODAxNGYtYjY3ZC00NmIzLWJlN2MtOWRkYzM2YWM4MzYxXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGJlODAxNGYtYjY3ZC00NmIzLWJlN2MtOWRkYzM2YWM4MzYxXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2021-12-23T20:11:48.526Z",
        "url": "https://www.imdb.com/video/vi4247831321/"
    },
    "url": "/title/tt0062512/"
}