{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Fred Astaire",
            "url": "/name/nm0000001/"
        },
        {
            "@type": "Person",
            "name": "Rita Hayworth",
            "url": "/name/nm0000028/"
        },
        {
            "@type": "Person",
            "name": "Adolphe Menjou",
            "url": "/name/nm0579663/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3833,
        "ratingValue": 7.2,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Person",
            "name": "Michael Fessier",
            "url": "/name/nm0275255/"
        },
        {
            "@type": "Person",
            "name": "Ernest Pagano",
            "url": "/name/nm0656039/"
        },
        {
            "@type": "Person",
            "name": "Delmer Daves",
            "url": "/name/nm0202681/"
        }
    ],
    "datePublished": "1942-11-19",
    "description": "In Buenos Aires, a man who has decreed that his daughters must marry in order of age allows an American dancer to perform at his club under the condition that he play suitor to his second-oldest daughter.",
    "director": [
        {
            "@type": "Person",
            "name": "William A. Seiter",
            "url": "/name/nm0782682/"
        }
    ],
    "duration": "PT1H37M",
    "genre": [
        "Comedy",
        "Musical",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzdhZjdhNzUtMGIxMy00ZjUwLWIzYTQtMzU3YWY0ZmExYjUwXkEyXkFqcGdeQXVyNDQzMDg4Nzk@._V1_.jpg",
    "keywords": "song,singer,singing,song in title,story indebted to shakespeare",
    "name": "You Were Never Lovelier",
    "original_info": {
        "id": "You Were Never Lovelier_1942",
        "name": "You Were Never Lovelier",
        "year": "1942"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rmax304823"
        },
        "dateCreated": "2002-10-08",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0035583/"
        },
        "name": "Grace and motion",
        "reviewBody": "Okay, it's not Tosca. But holy smoke, what an efflorescence of talented song writers and lyricists the American stage produced in the thirty years between 1925 and 1955! Irving Berlin, George and Ira Gershwin, Yip Harburg, Johnny Mercer, Jerome Kern, Cole Porter, the list goes on. And the songs! From Astaire's films alone, we have Orchids in the Moonlight, The Carioca, Let's Face the Music and Dance, Yesterdays, Smoke Gets in Your Eyes, Cheek to Cheek, The Way You Look Tonight, A Fine Romance, They All Laughed, Let's Call the Whole Thing off (\"You say tomato, I say tomahto...\"), They Can't Take That Away From Me. That's a handful of the more familiar numbers from the first films Astaire made with Ginger Rogers. \n\n\"You Were Never Lovelier\" has melodies by Jerome Kern and lyrics by Johnny Mercer. Ginger isn't here, but Rita Hayworth is. Her beauty is undeniable. She'd undergone hair removal and Hollywood glamorization by this time and in a few years a pin-up pic of her was to be pasted onto a famous bomb. I missed Astaire's earlier movies. By the time I was old enough, Gene Kelly dominated the screen. I saw Astaire in his later films and didn't like him nearly as much as Kelly. Kelly's background was in athletics. He was masculine and muscular and working class. Astaire's background was in ballroom dancing. How can an adolescent identify with a skinny balding narrow-shouldered dancer in a tuxedo who doesn't swing from ropes? But there's no longer much doubt in most peoples' minds, including mine, that Astaire was by far the better dancer, Kelly's charm notwithstanding. Astaire was elegant and precise and his dance steps were varied; Kelly seemed to repeat his leg-over-leg jumps over and over in each number. \n\nAt any rate, the plot of \"You Were Never Lovelier\" is rather original for an Astaire musical. I don't think it goes farther back in history than Aristophanes. It's a complicated business involving mistaken identities, an interfering father, and whatnot. But it doesn't matter, because the numbers are what counts. Kern and Mercer provide two songs that have become standards: \"Dearly Beloved\" and \"I'm Old Fashioned.\" Anyone who wants to see the Hollywood musical at its best would be advised to listen to either song and to watch the dancing during \"I'm Old Fashioned.\" \"Dearly Beloved\" occurs throughout the film as a kind of theme, and is sung once by Astaire and once by Hayworth, but is never accompanied by a dance. There are other songs too, of course, although none enchants the way these two ballads do. One of the numbers is \"The Shorty George.\" Astaire's movies often had references to a new popular dance craze -- The Carioca, The Yam, the Sluefoot -- and this is an instance of that tendency. It was named after a real dancer, George Snowden, a dancer at the Savoy Ballroom in Harlem, known as \"Shorty.\" If \"I'm Old Fashioned\" has a swooping grace, \"The Shorty George\" includes sections set at a blistering tempo and demonstrates Rita Hayworth's energy and range as a dancer.\n\nSpeaking of energy, how do they do it? \"I'm Old Fashioned\", like most of Astaire's numbers, consists of very long takes in medium distance that depend on both precision and physical stamina. (If you want to see an example of the opposite, watch Travolta do his final number in \"Staying Alive.\") I counted three cuts during the entire dance, which lasts four minutes and thirty-seven seconds. I'd have a heart attack after the first thirty-seven seconds. \n\nWell, okay. It's not Fred and Ginger. It's not even Tosca. But if you want to watch two people engaged in the unpretentious exercise of a physical skill acquired only with the utmost difficulty, this one shouldn't be missed."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Official Trailer",
        "duration": "PT2M5S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1196932121",
        "name": "You Were Never Lovelier",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2IxOTlkOWQtZGQ5NS00ZDY2LThiODUtMWM5ZTI2OGJmMGU3XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2IxOTlkOWQtZGQ5NS00ZDY2LThiODUtMWM5ZTI2OGJmMGU3XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg",
        "uploadDate": "2019-08-03T17:11:00.689Z",
        "url": "https://www.imdb.com/video/vi1196932121/"
    },
    "url": "/title/tt0035583/"
}