{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Kristi Crader",
            "url": "/name/nm1619570/"
        },
        {
            "@type": "Person",
            "name": "Robert Hoffman",
            "url": "/name/nm1382207/"
        },
        {
            "@type": "Person",
            "name": "Marques Houston",
            "url": "/name/nm0396867/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 323,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "creator": [
        {
            "@type": "Person",
            "name": "Billy Pollina",
            "url": "/name/nm1079559/"
        }
    ],
    "datePublished": "2004-06-29",
    "director": [
        {
            "@type": "Person",
            "name": "Billy Pollina",
            "url": "/name/nm1079559/"
        }
    ],
    "duration": "PT53M",
    "genre": [
        "Music",
        "Documentary"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTI5MzE5NDkxMF5BMl5BanBnXkFtZTcwMzIxODUyMQ@@._V1_.jpg",
    "name": "You Got Served, Take It to the Streets",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "horror3333"
        },
        "dateCreated": "2004-07-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0405491/"
        },
        "name": "A Bit Complicated, But Still Fun",
        "reviewBody": "The movie You Got Served may not have been a masterpiece, but lets face it; the dancing was monumental. This DVD that teaches you how to do the moves was definitely a great idea. It teaches you 2 routines from the movie, plus a bonus dance that Dave Scott (choreographer) came up with. All of the dancers were extras in the movie, with the exception of handsome Robert James Hoffman III (Max) and Christopher Jones (Wade), who had supporting roles. The first routine is the one that Dave Scott and his crew performs too in the semifinals of the Big Bounce Competition; definitely the hardest routine. Next is the one that the all-girls-crew performs to, right before David and Elgin's crew challenges the winners for double or nothing. This one is a bit easier, but still a little challenging. After the second routine, Shane Sparks takes us to an underground subway to teach us about Krumping and B-Boying. There is even a freestyle with Marques Houston and Omarion Grandberry. The final routine is just a special routine that Dave Scott came up with; a little hard, but doable. Overall, this might be one only for dancers, as non-dancers would probably quit because of frustration; even dancers may do that. But if you want to learn these routines, you have to keep working. 9/10.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0405491/"
}