{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jean Arthur",
            "url": "/name/nm0000795/"
        },
        {
            "@type": "Person",
            "name": "James Stewart",
            "url": "/name/nm0000071/"
        },
        {
            "@type": "Person",
            "name": "Lionel Barrymore",
            "url": "/name/nm0000859/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 26637,
        "ratingValue": 7.8,
        "worstRating": 1
    },
    "contentRating": "Passed",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0050868/"
        },
        {
            "@type": "Person",
            "name": "Robert Riskin",
            "url": "/name/nm0728307/"
        },
        {
            "@type": "Person",
            "name": "George S. Kaufman",
            "url": "/name/nm0442151/"
        },
        {
            "@type": "Person",
            "name": "Moss Hart",
            "url": "/name/nm0366454/"
        }
    ],
    "datePublished": "1938-09-29",
    "description": "The son of a snobbish Wall Street banker becomes engaged to a woman from a good-natured but decidedly eccentric family, not realizing that his father is trying to force her family from their home for a real estate development.",
    "director": [
        {
            "@type": "Person",
            "name": "Frank Capra",
            "url": "/name/nm0001008/"
        }
    ],
    "duration": "PT2H6M",
    "genre": [
        "Comedy",
        "Drama",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BOGMxZTMwNmQtOWIwMC00ZjFlLTllNGQtYTlkZWU5OGMyMzkxXkEyXkFqcGdeQXVyNzQzNDEyOQ@@._V1_.jpg",
    "keywords": "unconventional family,eccentric family,eccentricity,patchwork family,pulitzer prize source",
    "name": "You Can't Take It with You",
    "original_info": {
        "id": "You Can't Take It With You_1938",
        "name": "You Can't Take It With You",
        "year": "1938"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "gbill-74877"
        },
        "dateCreated": "2018-12-07",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0030993/"
        },
        "name": "Stirring social messages in a delightful movie",
        "reviewBody": "With many of the same themes, and indeed many of the same actors, 'You Can't Take It With You' can be considered a sister film to 'It's a Wonderful Life', though preceding it by eight years. It's a romantic comedy but also a study in class differences told at a fascinating point in history, with America still in the Great Depression, and with the world in tumult. A wealthy banker (Edward Arnold) seeks to monopolize the munitions industry prior to the world going to war, but needs to purchase the house owned by eccentrics led by a whimsical old man (Lionel Barrymore). In a convenient coincidence, the banker's son (Jimmy Stewart) is dating the old man's granddaughter (Jean Arthur), and the pair want to get married, so there are two conflicts here.\n\nBarrymore is in the role of the good guy, the one who's figured out that material things are less important than having friends and enjoying life. He also understands that you've got to let people be free to explore themselves, and be who they are. He has a charming scene early on with Arthur, listening to her describe her new love, and reminiscing about his deceased wife. He's also the voice of reason about extremism in the world, commenting that everybody was running out to 'get an ism' to solve their problems, e.g. communism or fascism, as opposed to sticking to the principles of America. \"With malice toward none and charity to all,\" he quotes Lincoln, \"Nowadays they say think the way I do or I'll bomb the daylights out of you.\" It's a wonderful character, and well played by Barrymore.\n\nJimmy Stewart and Jean Arthur are endearing in their roles as well, and they also turn in very good performances. Watch Arthur's small facial reactions in the aforementioned scene with Barrymore, and later when she's with Stewart when he's clowning around in the restaurant and threatening to scream. The idea that the innovation Stewart's character wants to pursue harvesting energy from the sun's rays like plants really made me smile, seeing as this type of green energy sounded so crazy in 1938. The film isn't bullish on the idea per se, but it gets across the point that it's better to have the courage to follow one's dreams, than it is to bury them in a hum-drum existence.\n\nThere is a joy to the film in this house that Barrymore runs, with inventors in the basement letting off firecrackers, Jean Arthur sliding down the bannister, and her sister (Ann Miller) twirling around to her ballet instructor's direction. On the night Stewart decides to drop in on them as a surprise so that his family can see Arthur's in a true light, Miller is dancing about, Barrymore is tossing darts, his daughter (Spring Byington) is working on an awful old painting of hers with one of the guys posing as a Roman discus thrower, and the servants are dancing delightfully in the kitchen. Everyone is simply being themselves. No one cares how good they are, or exactly how they'll monetize what they're doing. They simply do what they want to do, and have fun at it, letting the money sort itself out in some mysterious way that isn't immediately apparent to us.\n\nA lot is made of director Frank Capra's idealism, which may seem naïve to the modern viewer. It's true that this is movie of hope and optimism, but at the same time, Capra was clear-eyed about what was happening in the world. When Barrymore asks the Russian ballet teacher (Mischa Auer) \"Did you bring me any Russian stamps?,\" the latter replies \"No, nobody writes to me, they're all dead,\" which considering Stalin's purges in 1937-38 is a chilling comment slipped in to the script. Capra also recognized the danger of a climate of fear, and through Arthur's character (actually quoting Barrymore's), says that he has a special aversion to those \"the people who commercialize on fear, to sell you something you don't need.\" He's also spot on when it comes to satirizing the ultra-wealthy, and pointing out how unfair the world is when the wealth gap is so large. Edward Arnold's character buys influence in Washington and has a squadron of lawyers and yes-men to help him push his weight around. On the personal side he turns up his nose at the idea of eating humble fare, and his wife (Mary Forbes) haughtily looks down on everyone. As he's about to explain to a bunch of guys in jail how unemployment is \"an emotional problem\", he tosses a cigar away and a horde of them go after it, which is such a perfect metaphor. Capra was a beacon in the darkness, and with his ability to deliver such stirring social messages in delightful movies - making them work on both levels - he should be considered a genius.\n\nOn the other hand, it's interesting that Barrymore's character has such a casual attitude about money, I mean, one does need to be able to eat. It's a little disturbing that when an IRS agent calls on him, he admits that he's never paid income tax because he \"doesn't believe in it.\" He then goes on to ask where all those dollars go, ridiculing the idea that America needs battleships since they haven't been used since the Spanish-American War (hmmm not so prescient in that comment), and not seeing the irony in the fact that his own servants are \"on relief.\" He'll later say that he was just joking about all this, that he doesn't owe the government a dime, but I just thought this smacked of such backwardness, and counter to all of the programs FDR started that were helping Americans. Later we find out that he was once an executive himself, until one day \"it struck me that I wasn't having any fun.\" I admire the sentiment to prioritize life over amassing a fortune since, after all, you can't take it with you, but it seems a little tone deaf to not recognize the need for some amount of wealth to have this luxury.\n\nThere are lots of parallels to 'It's a Wonderful Life', including the rich industrialist who has lost his sense of values and is poor in the more important ways in life, the 'little guy' who resists his plans for a monopoly by not selling out to him, and a spontaneous cash collection from friends when one is in trouble. In addition the obvious actors in both films, you'll also find Papa Bailey (Samuel S. Hinds) here, as well as the same raven (Jimmy the raven), who apparently had quite the filmography and collaboration with Capra. In this case Stewart is the scion of the industrialist, not the little guy, and he ultimately quits his dad's company to pursue his own dream, as opposed to finding himself forced to stick around at the ol' Building and Loan. The biggest difference, however is that this film imagines that rich men have souls, and that there is a place deep within that can be reached through friendly overtures and some harmonica music. Perhaps recognizing this was idealistic even by his own standards, it's notable that eight years later, that wasn't the case with Mr. Potter, who was never reached.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "\",\"duration\":\"PT1M2S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3984506393",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNGI3ZTJjYTktYTBhOC00MGI5LWI5MzctMWNjOTg3N2RlOTE1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNGI3ZTJjYTktYTBhOC00MGI5LWI5MzctMWNjOTg3N2RlOTE1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2020-07-28T22:55:14.214Z",
        "url": "https://www.imdb.com/video/vi3984506393/"
    },
    "url": "/title/tt0030993/"
}