{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Frank Sinatra",
            "url": "/name/nm0000069/"
        },
        {
            "@type": "Person",
            "name": "Doris Day",
            "url": "/name/nm0000013/"
        },
        {
            "@type": "Person",
            "name": "Gig Young",
            "url": "/name/nm0949574/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 2635,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "contentRating": "Approved",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0026936/"
        },
        {
            "@type": "Person",
            "name": "Julius J. Epstein",
            "url": "/name/nm0258493/"
        },
        {
            "@type": "Person",
            "name": "Lenore J. Coffee",
            "url": "/name/nm0168829/"
        },
        {
            "@type": "Person",
            "name": "Liam O'Brien",
            "url": "/name/nm0639676/"
        }
    ],
    "description": "The lives and romances of three sisters in a musical family; the youngest daughter's life is complicated by the subsequent arrival of a charming composer and a cynical music arranger.",
    "director": [
        {
            "@type": "Person",
            "name": "Gordon Douglas",
            "url": "/name/nm0235066/"
        }
    ],
    "duration": "PT1H57M",
    "genre": [
        "Drama",
        "Music",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZDliMDAyODgtMDFjMy00MjYzLThiZGEtMzhkYjczN2NiYmVjL2ltYWdlXkEyXkFqcGdeQXVyNjE5MjUyOTM@._V1_.jpg",
    "keywords": "remake,sister sister relationship,sibling rivalry,family relationships,songwriter",
    "name": "Young at Heart",
    "original_info": {
        "id": "Young at Heart_1954",
        "name": "Young at Heart",
        "year": "1954"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Bunuel1976"
        },
        "dateCreated": "2008-05-17",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0047688/"
        },
        "name": "YOUNG AT HEART (Gordon Douglas, 1954) ***",
        "reviewBody": "A musicalization of a classic “woman’s picture” is about as unappetizing a prospect as can get for me film-wise, but the polished Hollywood expertise here wins out in the end and makes for a refreshing and appealing movie that I had long underestimated (it was shown several times on Italian TV but I never bothered with it).\n\nDoris Day and, especially, Frank Sinatra are well-matched as star-crossed lovers in small-town America; Day comes from a classically-trained musical family headed by Robert Keith and including Dorothy Malone (with spinster aunt Ethel Barrymore watching maternally from the sidelines). Amiable popular music composer Gig Young bursts in on their quiet, happy family life (all the girls naturally fall for his charms) but this is further exacerbated by the belated introduction of his arranger pal, embittered long-time loser Frank Sinatra. The film’s narrative is largely made up of the romantic entanglements of the trio of girls (two of whom are engaged to local guys but pine for Young) while Day is longed for by Young but is immediately drawn to outsider Sinatra. Robert Keith is really no match for Claude Rains – who had played the father in Michael Curtiz’s original FOUR DAUGHTERS (1938) – but Sinatra does manage to make John Garfield’s star-making, Oscar-nominated turn his own.\n\nCuriously enough, the screenwriters of YOUNG AT HEART – Julius J. Epstein and Lenore Coffee – were the very same duo who had earlier adapted FOUR DAUGHTERS to the screen; however, as is already apparent, the original movie had four daughters instead of three, the character names were also altered and the remake was even given a schmaltzy, happy ending! Naturally, both Day and Sinatra get to sing in the film but they only have a modest duo of sorts at the very end; incidentally, I was let down by the finale not just because of its improbable “all’s well that ends well” qualities but also because, after Sinatra is seen toiling at his magnum opus throughout the whole movie, the result is just a corny love song! At the very least, I was expecting the classic title tune to be it (which he does get to sing over the opening credits). Incidentally, he seems to have had a good working relationship with director Gordon Douglas – since they would reteam three more times in the next 14 years.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "The lives and romances of three sisters in a musical family; the youngest daughter's life is complicated by the subsequent arrival of a charming composer and a cynical music arranger.",
        "duration": "PT2M26S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3405890329",
        "name": "Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmQ3Y2U3ZGMtYTFkZC00OTRlLTliYjQtOWQxYjRjMjQyMjZiXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmQ3Y2U3ZGMtYTFkZC00OTRlLTliYjQtOWQxYjRjMjQyMjZiXkEyXkFqcGdeQWxiaWFtb250._V1_.jpg",
        "uploadDate": "2022-01-31T21:40:22.309Z",
        "url": "https://www.imdb.com/video/vi3405890329/"
    },
    "url": "/title/tt0047688/"
}