{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ekin Cheng",
            "url": "/name/nm0155562/"
        },
        {
            "@type": "Person",
            "name": "Jordan Chan",
            "url": "/name/nm0150952/"
        },
        {
            "@type": "Person",
            "name": "Chingmy Yau",
            "url": "/name/nm0946873/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1169,
        "ratingValue": 6.7,
        "worstRating": 1
    },
    "alternateName": "Young and Dangerous 2",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0015592/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0050080/"
        },
        {
            "@type": "Person",
            "name": "Sharon Hui",
            "url": "/name/nm0401206/"
        },
        {
            "@type": "Person",
            "name": "Manfred Wong",
            "url": "/name/nm0939236/"
        }
    ],
    "datePublished": "1996-03-30",
    "description": "The story is told in two parts: the first focuses on Chicken and his exile in Taiwan skipped over in the first film. The second half deals with the Hung Hing Society trying to ally with Chicken's Taiwanese triad.",
    "director": [
        {
            "@type": "Person",
            "name": "Andrew Lau",
            "url": "/name/nm0490487/"
        }
    ],
    "duration": "PT1H41M",
    "genre": [
        "Action",
        "Crime"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYWMzZWQwZmQtZDI5Yy00NzgzLWJhZGMtNDM2ZmNkOGYyN2FkXkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1_.jpg",
    "keywords": "gang,triad,taiwan,sequel",
    "name": "Goo wak chai 2: Maang lung gwoh gong",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Tweekums"
        },
        "dateCreated": "2019-09-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0260932/"
        },
        "name": "Young and Dangerous 2",
        "reviewBody": "This sequel opens with Chan Ho Nam asking his friend Chicken about his time in Taiwan. We then get a flashback showing how he was introduced to a local triad boss, and aspiring politician. We also see how he gets involved with Ting Siu-Yiu, his new boss's beautiful mistress. Certain actions lead to his rapid promotion. The action then returns to the present and we learn that Nam is competing with a man named Tai Fai to become the leader of a local Triad branch. It also becomes apparent that Chicken is in Hong Kong to facilitate a meeting between Hong Kong and Taiwanese Triads to discuss a deal involving a Macau casino... what follows leads to conflict between the various groups and a series of betrayals.\n\nI enjoyed the first film in this series and if anything I think I enjoyed this one even more. Of course it helps that most key protagonists have been introduced already and a few flashback scenes quickly remind us what happened before. The first half of the film, detailing Chicken's time in Taiwan does a fine job introducing new key characters, most notably Ting Siu-Yiu, and provides some action. Once back in Hong Kong the tension and level of action increases as the rivalry between various groups provides many excuses for conflict. It also provides plenty of twists as betrayals occur. While the level of violence isn't that high the action is pretty good... the only laughably cheesy moment being when our protagonists jump from a fairly tall building, land on car rooves and walk away unharmed! The cast is solid; Ekin Cheng and Jordon Chan continue to impress as Nam and Chicken and Chingmy Yau is great as Ting Siu-Yiu. Overall I'd definitely recommend this to anybody who enjoyed the first film.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0260932/"
}