{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Jô Shishido",
            "url": "/name/nm0794425/"
        },
        {
            "@type": "Person",
            "name": "Misako Watanabe",
            "url": "/name/nm0913843/"
        },
        {
            "@type": "Person",
            "name": "Tamio Kawaji",
            "url": "/name/nm0442709/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 3702,
        "ratingValue": 7.4,
        "worstRating": 1
    },
    "alternateName": "Youth of the Beast",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0022792/"
        },
        {
            "@type": "Person",
            "name": "Ichirô Ikeda",
            "url": "/name/nm0407426/"
        },
        {
            "@type": "Person",
            "name": "Tadaaki Yamazaki",
            "url": "/name/nm1250332/"
        },
        {
            "@type": "Person",
            "name": "Haruhiko Ôyabu",
            "url": "/name/nm1143207/"
        }
    ],
    "datePublished": "1963-04-21",
    "description": "A violent thug plays opposing yakuza bosses against each other.",
    "director": [
        {
            "@type": "Person",
            "name": "Seijun Suzuki",
            "url": "/name/nm0840671/"
        }
    ],
    "duration": "PT1H32M",
    "genre": [
        "Action",
        "Crime",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTFkZmM3ODMtYTg1YS00NjM1LTk3MmMtMTVkYTZkZDJjNGRiXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
    "keywords": "gang war,organized crime,yakuza,neo noir,violence",
    "name": "Yajû no seishun",
    "original_info": {
        "id": "Youth of the Beast_1963",
        "name": "Youth of the Beast",
        "year": "1963"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Quinoa1984"
        },
        "dateCreated": "2017-03-09",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0057697/"
        },
        "name": "gripping direction from a man bringing post-modernism and brutality to the forefront",
        "reviewBody": "I think one of the aspects of Youth of the Beast, the late genre- filmmaker master Seijun Suzuki's breakthrough, to take into account is that the story moves at a breathless pace. It's not that it is a story that is hard to follow - there are a good many characters to get to know, and after a black and white prologue (though at first I wasn't sure if it was a 'show-end-at-beginning' thing before going into full color for the majority of the film), we're put right into the physical space of this seemingly violent thug played by Jô Shishido (also named Jo here, good call) - it's that Suzuki, I think, is not so much interested in the story as in how a film MOVES. After all, it is a movie, right? Let's get that motion picture moving and vibrant and with energy. This is like a shotgun blast of 60's crime cinema that makes us feel a lot of things through a lot of intense visual choreography of the frame and what is in it (i.e. the old Scorsese axiom, cinema being a matter of what's in the frame and what's out, is paramount to Suzuki)/\n\nYouth of the Beast is not necessarily the most remarkable film as far as the story goes, and I'm sure there have been other Yakuza films and other gangster thrillers that have similarities; in a sense this isn't unlike Yojimbo/Fistful of Dollars/Red Harvest, though this time the main character has more of a motive than in that story. What's remarkable is the direction and how the tone is brutal and yet it's staged in some creative ways. There's times when you know a character is about to lunge at someone else, or that we get a piece of visual information like a knife being held under a table or somewhere else, before that character lunges and strikes. Other times it's more about how he'll pan the camera, like when the car full of the one crime family gets ambushed by another car (the music cue here is especially, terribly exhilarating, and the rest of the score has a wonderful jazz rhythm to it), and when we see those faces of the guys with their masks on and how he pushes in.\n\nHell, even just how Suzuki uses color cinematography is impressive, all of those reds (the woman being whipped on the carpet), and how he'll have a backdrop like at the movie theater where the Yakuza do some of their business and a film screen projecting some movie or other is in the background of the frame. It feels like one of those moments where post-modernism is creeping in to Japanese cinema, and of course Suzuki would continue making such advances with Tokyo Drifter and particularly Branded to Kill. The movie is hard and rough, violent and the characters' motivations - well, I should say Jo, who is basically undercover playing one side and then another until it's an all-out war - are intense enough that the cast rises above what could be basic (even boiler-plate) B-movie pulp. I don't know how much input Suzuki had on the script, but he knows how to keep his actors moving and being interesting, whether it's Jo, who is the stand-out of the film, or his 'friend' who has a thing for the ladies. \n\nThis is pulp Japanese cinematic excellence, all feeding off of a vision that is unique.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0057697/"
}