{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Matthew Labyorteaux",
            "url": "/name/nm0479612/"
        },
        {
            "@type": "Person",
            "name": "Wayne Grayson",
            "url": "/name/nm0969901/"
        },
        {
            "@type": "Person",
            "name": "Tony Salerno",
            "url": "/name/nm1002867/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4882,
        "ratingValue": 6.8,
        "worstRating": 1
    },
    "contentRating": "TV-PG",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0046382/"
        },
        {
            "@type": "Person",
            "name": "Kazuki Takahashi",
            "url": "/name/nm1444457/"
        }
    ],
    "datePublished": "2005-08-01",
    "description": "A semi-spinoff of the popular Yu-Gi-Oh anime series, focusing on a boy named Jaden and his misadventures as a student at an esteemed Duel Monsters academy.",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BZWQ1MDNlMjgtYjUwYS00ZGU0LWJjNTYtYmRlY2FhMWFkZjI1XkEyXkFqcGdeQXVyMTA3OTEyODI1._V1_.jpg",
    "keywords": "creature,trading card,card duel,based on comic book,monster",
    "name": "Yu-Gi-Oh! GX",
    "original_info": {
        "id": "Yu-Gi-Oh!: Season 1_2004",
        "name": "Yu-Gi-Oh!: Season 1",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "smetin"
        },
        "dateCreated": "2017-06-04",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0493334/"
        },
        "name": "Not great, but still good fun",
        "reviewBody": "I had heard mixed things about Yu-Gi-Oh! GX, both from my friends and online. Polls online show that GX or Zexal are consistently on/near the bottom of people's ranking of the Yu-Gi-Oh! series. I have watched the original series and 5D's and liked them both (although I still found the concept of speed duels a bit silly). I was hesitant to watch it, but after being given all the episodes on DVD I couldn't pass it up. To be upfront, this is only a review of series 1-3 as these are the only dubbed episodes.\n\nSo, what did I think of it? Well, its a bit of a mixed bag really. The series is canon and starts with a nice nod to the original cast members. It even had occasional appearances of other cast members throughout the series. I liked that idea, since they did acknowledge the original (and best) series without relying on it. The new cast was good, but very very different from the original. Jaden is a very talented duelist with a knack for truancy. This laid back attitude can get quite annoying at times, but what I found more grating was his over-exuberance for the game. He loved duelling a bit too much...The rest of the cast was good too. What I liked about this series is that we got more action from the cast other than the main protagonist compared to the original series. More duels = more variation, which I liked.\n\nIt seems that each series has a type of duelling that they like to latch onto and not let go. The original series utilised the same monsters over and over again, whilst 5Ds seemed to love synchro summoning. GX is no different and fusion was the name of the game. It was good since we got to see a wide variation of fusion monsters. However, it did get quite \"samey\" after a while, since we knew what Jaden was going to do most of the time. The only difference was the \"winning move\", which was very clever at times. I did also enjoy the new monsters and their use of the old monsters in the original series. The Egyptian Gods were even involved, along with a different version (which are considerably less powerful) that I enjoyed. So, although there were some aspects of duelling that I did not enjoy, there was plenty to be admired.\n\nIn terms of the actual storytelling, it is mixed in my opinion. Series 1 is obviously trying to get us used to a new cast and a new concept of a duelling academy. As such, the majority of the plot occurred in the duelling academy and the main storyline was very much internal. It was very good up until the end, which I found to be a bit of an anticlimax. Series 2 was my favourite, because the creators got a bit more...creative. The did so without it being too crazy. I enjoyed the concept of the \"light\" being evil and having main characters turn evil. It got us to see a different side of them. Series 3 was where it went a bit off. It started out OK, but when the duellists started going inter-dimensional duelling demons and beasts, it was a bit too weird. I just think that they were trying to out-do the previous season, but went a bit too far. It was still enjoyable, but it just seemed a bit confused (and confusing at times).\n\nAll in all, this was a Yu-Gi-Oh! series that was worth watching. To be honest, I enjoyed it more than 5Ds (cue the boos!), but that is because I just like the traditional method of duelling. However, nothing will compare to the original series. Its not the nostalgia goggles, I just genuinely believe the story lines and characters in the original series were better.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from 4Kids Entertainment",
        "duration": "PT35S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi803406105",
        "name": "Yu-Gi-Oh! GX: Welcome to Duel Academy v.1",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BZmMzZjQzMWEtNTk0YS00MjZmLWEzZWMtOGRlOTNkZWJkYWRmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZmMzZjQzMWEtNTk0YS00MjZmLWEzZWMtOGRlOTNkZWJkYWRmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-18T12:18:50Z",
        "url": "https://www.imdb.com/video/vi803406105/"
    },
    "url": "/title/tt0493334/"
}