{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Robert Altman",
            "url": "/name/nm0000265/"
        },
        {
            "@type": "Person",
            "name": "Vera Carlisle Anderson",
            "url": "/name/nm1975647/"
        },
        {
            "@type": "Person",
            "name": "C.L. Batten",
            "url": "/name/nm1976690/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1492,
        "ratingValue": 7.6,
        "worstRating": 1
    },
    "contentRating": "R",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0044390/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0046530/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0090780/"
        }
    ],
    "datePublished": "2007-08-16",
    "description": "The story of Z Channel, one of the first U.S. pay cable stations and its programming chief, Jerry Harvey. Debuting in 1974 in LA, their eclectic slate of movies became a prime example of the untapped power of cable television.",
    "director": [
        {
            "@type": "Person",
            "name": "Xan Cassavetes",
            "url": "/name/nm0144018/"
        }
    ],
    "duration": "PT2H",
    "genre": [
        "Documentary",
        "Biography",
        "History"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTQzOTEwMTA2MF5BMl5BanBnXkFtZTcwMTExMDkyMQ@@._V1_.jpg",
    "keywords": "title directed by female,cable tv,television history,memory,film history",
    "name": "Z Channel: A Magnificent Obsession",
    "original_info": {
        "id": "Z Channel: A Magnificent Obsession_2004",
        "name": "Z Channel: A Magnificent Obsession",
        "year": "2004"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Chris_Docker"
        },
        "dateCreated": "2004-08-28",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0405496/"
        },
        "name": "Documentary about one man's passion for film",
        "reviewBody": "Z Channel was a Los Angeles pay-tv channel run by one Jerry Harvey. His devotion to cinema as art, broadcasting uncut (directors' versions) of films or other worthy efforts sidelined by the studios or TV channels that interspersed them with advertising, earned him the enduring respect of a multitude of Hollywood greats, many of whom are interviewed in this touching movie. One wonders if he had lived in France or even Latin America perhaps their might have been a public outcry to defend an institution he created, rather than lawsuits. In USA and Britain there is a lethargy, an apathy for cinema as art  art is viewed as almost a luxury item, something that is nice but hardly necessary. What do we need to do to ignite a fire in the hearts of students and film aficionados? What do we need to do to bring about a cultural revolution where the people who appreciate art can nurture and control it, rather than those that make money from it, or government ministers of culture' who, lacking sufficient conviction themselves, are also unable to effectively encourage art. During the French New Wave, students took to the streets to defend a cinema. In Rio de Janeiro, the main arthouse cinema bookshop sells two kinds of books  those on cinema and those on philosophy. These examples show a different kind of cinema-going public: a thinking, educated viewer who probably sees cinema firstly as art, as a source of ideas and inspiration. This film shows that such people exist even in the USA. It is a valuable document and perhaps shows the way forward in consumer-orientated cultures where the jaded palates of the citizens have little collective desire for good cinema.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0405496/"
}