{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Amitabh Bachchan",
            "url": "/name/nm0000821/"
        },
        {
            "@type": "Person",
            "name": "Jaya Bachchan",
            "url": "/name/nm0080149/"
        },
        {
            "@type": "Person",
            "name": "Pran Sikand",
            "url": "/name/nm0695199/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 4056,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0019952/"
        },
        {
            "@type": "Person",
            "name": "Javed Akhtar",
            "url": "/name/nm0015287/"
        },
        {
            "@type": "Person",
            "name": "Salim Khan",
            "url": "/name/nm0451311/"
        }
    ],
    "datePublished": "1973-05-11",
    "description": "A tough and honest police officer clashes with a crime boss who, unbeknownst to him, happens to be his parents' murderer.",
    "director": [
        {
            "@type": "Person",
            "name": "Prakash Mehra",
            "url": "/name/nm0576488/"
        }
    ],
    "duration": "PT2H25M",
    "genre": [
        "Action",
        "Crime",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjg3NmNjMGYtZGYzNy00MmMzLWE3ZDItYTdmOGY4YTIyYjVmXkEyXkFqcGdeQXVyODE5NzE3OTE@._V1_.jpg",
    "keywords": "loneliness,gambling den,sharpening a knife,childhood trauma,memory",
    "name": "Zanjeer",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "philban65"
        },
        "dateCreated": "2005-02-10",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0070947/"
        },
        "name": "Thrilling, carefully crafted art that is essential viewing",
        "reviewBody": "Zanjeer (The Chain) is the film where Amitabh Bachchan made the breakthrough from being an established actor to superstardom, and where the trend was set towards the revenge film in Indian cinema. Amitabh's Angry Young Man character was born in this film in his brilliant portrayal of the brooding, temperamental Vijay who is haunted by a recurrent nightmare. Indeed, his performance as a disturbed, vengeful young man propelled him to new heights, such that he was at the top of many directors' wanted list for at least a decade afterwards. Interestingly, the role was rejected by several stars of the early 70s before being offered to Amitabh, illustrating how luck can play a part in a career's success or failure. Who knows what different turns Bachchan's career would have taken had he not had the chance to play Vijay, the young man with chips on both shoulders. Surely his talent would have found an outlet somewhere, but would he have made such a ground breaking impact in any other role?\n\nZanjeer is certainly not all about one actor, and a strong cast showcase their talents to the full. The greatest character actor of all time in Indian cinema, Pran, gives a very enjoyable performance as Vijay's loyal friend, Sher Khan. As ever, Pran's attention to detail and willingness to 'live the character' is immediately obvious and doubtless he will have researched the Pathan dialects to deliver a richly authentic performance. Jaya Badhuri cleverly plays the sassy knife sharpener with great depth and sensitivity. Ajit is no conventional villain: not the hothead that is seen in so many Indian movies; instead he is cold and cruel but nevertheless, quintessentially evil. Even Iftekhar's cameo as Vijay's boss, the Police Commissioner is worthy of praise.\n\nThis classic thriller is tightly scripted by Javed Akhtar, and never loses its pace thanks to Salim Khan's screenplay and Prakash Mehra's clever direction and the richly talented cast. It has a high octane tension which is sustained throughout. An example of this is in Vijay's visit to the party when the gangster's moll (played by Bindu) seeks to seduce Vijay in the raunchy number Dil Jalon Ka. The posturing of the unimpressed Vijay and Teja (Ajit), the cool, calculating tycoon and his cronies with the backdrop of the gyrating Bindu and superb musical score are captured expertly by a circling camera team. Mehra achieves all this without being overly melodramatic, something that might not be said of one of his other big hits, Muqaddar Ka Sikander, and that is very much to Zanjeer's benefit.\n\nThere are several haunting, dark moments in this film which last long in the memory. The initial murder scene against the backdrop of the firecrackers of the Diwali celebrations, as well as Vijay's nightmare of the black hooded rider atop a galloping white horse are enduring images which immediately spring to mind. The film is essentially dark in mood and many of the images - the inner city back streets and railway sidings give it a real gritty feel - and yet in contrast, many of the scenes are shot in bright daylight. Mehra's attention to detail influences all aspects of the film, giving it a rich texture, quite literally in some cases! Vijay's costumes are very early 70s Western chic, without going over the top, and the Pathan, Sher Khan (Pran), wears authentic cultural dress.\n\nThe enjoyment of this film is slightly detracted from in a couple of scenes, as the cropping of the edges of the film mean that facial expressions of the leading characters are missed. This does not detract from the fact that Zanjeer is pure, carefully crafted art and that this seminal film is essential viewing for anyone with an interest in Indian cinema.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 10,
            "worstRating": 1
        }
    },
    "url": "/title/tt0070947/"
}