{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shintarô Katsu",
            "url": "/name/nm0441526/"
        },
        {
            "@type": "Person",
            "name": "Mikio Narita",
            "url": "/name/nm0621456/"
        },
        {
            "@type": "Person",
            "name": "Chizu Hayashi",
            "url": "/name/nm0370610/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1481,
        "ratingValue": 7.3,
        "worstRating": 1
    },
    "alternateName": "Zatoichi and the Chess Expert",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0067278/"
        },
        {
            "@type": "Person",
            "name": "Daisuke Itô",
            "url": "/name/nm0411866/"
        },
        {
            "@type": "Person",
            "name": "Kan Shimozawa",
            "url": "/name/nm0793753/"
        }
    ],
    "datePublished": "1965-12-24",
    "description": "A samurai with a high skill in chess makes friends with Zatoichi, who finds that things become peculiar in his presence.",
    "director": [
        {
            "@type": "Person",
            "name": "Kenji Misumi",
            "url": "/name/nm0593014/"
        }
    ],
    "duration": "PT1H27M",
    "genre": [
        "Action",
        "Adventure",
        "Drama"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYjNjZDQwYTctNWE1YS00YjFjLTgwNTctNDI0NTQ2NTczOTkwXkEyXkFqcGdeQXVyMjQwMzc0MzM@._V1_.jpg",
    "keywords": "zatoichi,chess,yakuza,samurai,cult film",
    "name": "Zatôichi jigoku-tabi",
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "rsoonsa"
        },
        "dateCreated": "2001-08-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0059942/"
        },
        "name": "Zato Ichi is possessed by the demon of compassion.",
        "reviewBody": "The state of blindness does not hinder the swordsman masseur, Zato Ichi, in this well-crafted tale of pre-modern Japan, as he is determined to do what is correct by assisting a young girl's recovery from a severe wound suffered in tangential fashion during a sword-fight involving gangsters in the bandit-ridden country. Of the approximately 25 Zato Ichi films, this must rank as one of the better ones, as Shintaro Katsu who portrays the sightless samurai during the entire series, permits us to see more of the inner man behind the warrior facade, aided by an interesting story written by Kan Shimozawa, who contributes the most complex scenarios of this group of works. In early civilized Japan, all masseurs were blind, as then they could not look upon the bodies of their clients, and Zato Ichi (\"Ichi the Masseur\") is following this tradition, but he is as well an inordinately successful warrior with his cane sword, mastering with cold aplomb each challenge by aggressors, no matter how many they might be. Ichi is a prototypical loner who makes his way in this work, as in all others, by massaging, while handsomely adding to his income through his cheating skills at gambling, since he is also an inveterate confidence man, yet one who makes mistakes and these errors in judgement serve in strengthening his accessibility to the viewer. There is a pleasingly intricate plot, which places Ichi as a travelling companion of an itinerant samurai named Jumonji, played well by Mikio Narita in his first cinematic role, who is the chess expert of the English language title, and the two interact with several other groups of characters in a neatly-woven narrative. The complicated scenario is capably handled by veteran director of samurai motion pictures, Kenji Misumi, who later added other outstanding Zato Ichi films to this first one in his list, as he balances the interwoven dramatics neatly and nicely. Reasons for the societal and artistic success of this series are manifest in this film, wherein Ichi represents values that most peoples are struggling to identify and capture, with the blind swordsman becoming an iconic figure as he stumbles and totters, rather than riding, into the sunset, after completing his clash with evil.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 9,
            "worstRating": 1
        }
    },
    "url": "/title/tt0059942/"
}