{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Shintar么 Katsu",
            "url": "/name/nm0441526/"
        },
        {
            "@type": "Person",
            "name": "Rentar么 Mikuni",
            "url": "/name/nm0586733/"
        },
        {
            "@type": "Person",
            "name": "Hisaya Morishige",
            "url": "/name/nm0605662/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1022,
        "ratingValue": 6.9,
        "worstRating": 1
    },
    "alternateName": "Zatoichi at Large",
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0037408/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0002219/"
        },
        {
            "@type": "Person",
            "name": "Kinya Naoi",
            "url": "/name/nm0620970/"
        }
    ],
    "description": "On the road, Zatoichi meets a dying pregnant woman and delivers the child moments before she passes. Honor bound, he sets out to find the next-of-kin who he discovers have their own problems.",
    "director": [
        {
            "@type": "Person",
            "name": "Kazuo Mori",
            "url": "/name/nm0605245/"
        }
    ],
    "duration": "PT1H30M",
    "genre": [
        "Drama",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMjI4NDU1ODk5MV5BMl5BanBnXkFtZTgwOTEyODIyMTE@._V1_.jpg",
    "keywords": "zatoichi,twenty third part,cult film,sequel,martial arts",
    "name": "Zat么ichi goy么-tabi",
    "original_info": {
        "id": "Zatoichi at Large_1973",
        "name": "Zatoichi at Large",
        "year": "1973"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "kluseba"
        },
        "dateCreated": "2018-03-25",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0202153/"
        },
        "name": "Misunderstood samaritan",
        "reviewBody": "Zatoichi at Large is the twenty-third entry in the Japanese franchise about the blind masseur, skilled swordsman and lowly yakuza with a strong moral compass whose words speak louder than his actions. It tells how Zatoichi meets a dying pregnant woman on the road who got attacked and robbed by an unknown assailant. Zatoichi helps her give birth to a baby boy but the mother dies in the process. With her last dying breath, she tells Zatoichi the name of the father. A child witnesses the woman's death, follows Zatoichi and occasionally throws rocks at him. Zatoichi travels to the father's hometown but only comes across his sister who reluctantly accepts to take care of the child with the help of an old family of eight children. Zatoichi decides to wait for her brother to arrive in town to bring him all the bad and good news. While he stays in town, Zatoichi witnesses how a rude boss suddenly arrives, pitilessly controls local businesses and brutally makes the local population suffer. Things get worse when the baby's father finally arrives and is told by the child who witnessed the mother's death that Zatoichi robbed and killed her. Zatoichi decides to stay to clear his name, find the mother's murderer and rid the town of its new boss.\n\nThe twenty-third film is an average movie of the Zatoichi franchise. On the positive side, the film's atmosphere is quite gloomy from start to finish which makes for a entertaining, fluid and intense experience. The idea to show how Zatoichi seems to be doomed to be misunderstood as that his good actions are so often misinterpreted as bad ones adds a tragic note to the movie and makes the protagonist even more interesting. The side characters are intriguing enough to make the viewers care about them, especially the dead mother's family. The final fight sequence is quite impressive as Zatoichi is attacked with burning ladders and needs to use all his skills to survive.\n\nOn the other side, the film's story is quite exchangeable. Zatoichi has already taken care of children of dying parents in Fight, Zatoichi, Fight as well as in Zatoichi Challenged. This movie's boss is also quite exchangeable and not a real threat for Zatoichi. The protagonists are overall much more developed than the stereotypical antagonists who remain shallow.\n\nIn the end, Zatoichi at Large will please to the franchise's collectors and fans of old date. It's interesting while it lasts but a movie you won't remember for a very long time. On the positive side, the film's gloomy atmosphere, intriguing protagonists and the final fight sequence justify watching this film. On the negative side, the antagonists remain shallow and the plot is predictable. Those who aren't familiar with the franchise yet shouldn't start here but rather watch the two excellent predecessors. Zatoichi at Large is of an average quality but a small step back after the brilliant Zatoichi Goes to the Fire Festival and Zatoichi and the One-Armed Swordsman.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 7,
            "worstRating": 1
        }
    },
    "url": "/title/tt0202153/"
}