{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Ian McCulloch",
            "url": "/name/nm0567135/"
        },
        {
            "@type": "Person",
            "name": "Alexandra Delli Colli",
            "url": "/name/nm0217493/"
        },
        {
            "@type": "Person",
            "name": "Sherry Buchanan",
            "url": "/name/nm0118076/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 5611,
        "ratingValue": 5.2,
        "worstRating": 1
    },
    "alternateName": "Zombie Holocaust",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0014561/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0137336/"
        },
        {
            "@type": "Organization",
            "url": "/company/co0040883/"
        },
        {
            "@type": "Person",
            "name": "Fabrizio De Angelis",
            "url": "/name/nm0170354/"
        },
        {
            "@type": "Person",
            "name": "Romano Scandariato",
            "url": "/name/nm0768899/"
        }
    ],
    "datePublished": "1982-05-14",
    "description": "An expedition in the East Indies, encounters not only the cannibals they were looking for, but also an evil scientist and his zombie army.",
    "director": [
        {
            "@type": "Person",
            "name": "Marino Girolami",
            "url": "/name/nm0320946/"
        }
    ],
    "duration": "PT1H24M",
    "genre": [
        "Adventure",
        "Horror",
        "Mystery"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYTc1YzgxNzktMWY4Mi00ZmUwLTkwODktMzAwZDUwMzA0YTRhXkEyXkFqcGdeQXVyMzMwMjI2NA@@._V1_.jpg",
    "keywords": "cannibal,corpse,young woman,blonde,intestines",
    "name": "Zombi Holocaust",
    "original_info": {
        "id": "Zombie Holocaust_1980",
        "name": "Zombie Holocaust",
        "year": "1980"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Jonny_Numb"
        },
        "dateCreated": "2005-01-05",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0079788/"
        },
        "name": "Doctor Butcher, Monkey Dung",
        "reviewBody": "Being an obsessive-compulsive fan of old-fashioned Euro-gore for several years now, I've come to expect the absurd (and usually nonsensical) plots, the constant 'borrowing' from other films, and the over-the-top gore, all mixed together to form what is usually an enjoyably trashy cocktail. I picked up \"Zombie Holocaust\" with some optimism and a little knowledge of its reputation, and after watching it, could only help but wonder what had just happened. No, it wasn't the incoherently surreal thrill of watching \"City of the Living Dead,\" but a general, head-scratching confusion that raised questions such as: \"How was this awful waste of time ever released?\" As Tom Servo would say: \"Meanwhile, in YET ANOTHER MOVIE...\" \"Zombie Holocaust\" doesn't have a brain in its head (even though the title Doctor is a deranged neurosurgeon)--it's a low-budget splatter flick without even the slightest hint of innovation. It borrows settings and characters from Fulci's \"Zombie\" (not to mention a few actual snippets from that film), jungle savages from \"Make Them Die Slowly,\" and a couple bronze-faced zombies that look an awful lot like the wooden-toothed wonders in \"Burial Ground.\" Sounds like a swinging good time, but the movie is downright distracting in its own indecisiveness, flipping back and forth between these awkwardly, incompetently blended genres without a hint of wit or style. Perhaps this is attributable to Fabrizio de Angelis, who is known less for his screen writing capabilities than as a producer on Lucio Fulci's most notable works. It is conceivable that the producers wanted to churn out a genre-bending smörgåsbord knowing they would get some return on it, but the utter ridiculousness of the finished product is an endurance test for the viewer's patience.\n\nIan McCulloch (his usual stuffy self) and Alexandra Delli Colli (\"New York Ripper\") venture off to some faraway island to investigate a doctor's odd practices. Along the way, they encounter hostile natives, zombies, and an climax that looks suspiciously like another, better zombie flick. Eyeballs are gouged out, entrails are eaten, and Delli Colli is painted in the nude for a \"Laugh-In\" audition.\n\nThere's ultimately nothing in \"Zombie Holocaust\" that hasn't been done before, and better. Pass."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Trailer for Doctor Butcher M.D.",
        "duration": "PT2M44S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi3257906713",
        "name": "Doctor Butcher M.D.",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTVkZmYzMWMtZTEwYy00ZmM1LTlmOTMtMWQ5MDVhMWE0MDQyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTVkZmYzMWMtZTEwYy00ZmM1LTlmOTMtMWQ5MDVhMWE0MDQyXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2017-01-18T16:16:21Z",
        "url": "https://www.imdb.com/video/vi3257906713/"
    },
    "url": "/title/tt0079788/"
}