{
    "@context": "https://schema.org",
    "@type": "TVSeries",
    "actor": [
        {
            "@type": "Person",
            "name": "Tesshô Genda",
            "url": "/name/nm0312656/"
        },
        {
            "@type": "Person",
            "name": "Travis Dean",
            "url": "/name/nm1104200/"
        },
        {
            "@type": "Person",
            "name": "Britt Baker",
            "url": "/name/nm1451835/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 102,
        "ratingValue": 7.5,
        "worstRating": 1
    },
    "alternateName": "Zone of the Enders: Dolores, i",
    "contentRating": "Not Rated",
    "datePublished": "2001-04-07",
    "description": "James Links is a 49-year-old space trucker anxious to return to Earth and reunite with his estranged children Leon and Noel. While transporting some goods to Earth, he stumbles upon \"Dolores,\" a highly-advanced Orbital Frame with ...",
    "genre": [
        "Animation",
        "Action",
        "Adventure"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BNjA2NmU1NDMtNDczNi00MzdkLTliNjMtZjVlNTUxYWM4ODM2XkEyXkFqcGdeQXVyMTA3OTEyODI1._V1_.jpg",
    "keywords": "tough guy,based on video game,mecha,military,space",
    "name": "Z.O.E Dolores, i",
    "original_info": {
        "id": "Zone of the Enders: Dolores_2002",
        "name": "Zone of the Enders: Dolores",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "johnnythewolf"
        },
        "dateCreated": "2009-09-06",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0446257/"
        },
        "name": "An under-appreciated gem - Gundam meets Policenauts",
        "reviewBody": "Who would have expected that an under-appreciated mech action franchise on the PS2 would spawn an equally as under-appreciated anime series? Zone of the Enders: Dolores I (or \"DOLORES I\" for short) may be a Gundam \"clone\" with a few twists and a preference for hard science-fiction, but it is also a fun and funny anime that doesn't require any previous knowledge of the series in order to enjoy. Its creators were apparently aware that they couldn't surpass the success of other more prestigious series in the genre, so they've instead opted for a more tongue-and-cheek approach.\n\nThe series takes place in 2172, around the same time that the events of the first Zone of the Enders game and five years after the events of Zone of the Enders: 2167 IDOLO, a rather bland prequel OAV that you don't even need to watch to enjoy the series. The story centers around James Links, a fifty-year old estranged father who lives as a space cargo transporter between Mars and Earth. He's also a big loser who drinks too much and is regarded as a embarrassment by his own children. But this all changes when he's given the task of delivering a strange cargo, which contains a rather unusual \"Orbital Frame\" (ZOE equivalent of Mobile Suits), the titular mech character Dolores. To James's surprise, it is equipped with a sentient AI that behaves like a whiny teenager girl and considers him to be his uncle. This and other evidence contained in Dolores lead James Links to suspect that his reportedly dead ex-wife is still alive and well on Mars. During the series, he reconnects with his children, Leon and Noel, and convinces them to help him in discovering the truth behind Dolores while preventing her from falling in wrong hands. Interestingly enough, for once the main protagonist is NOT a ridiculously talented angsty teenager, nor is he particularly good at piloting, so he must rely on Dolores for the fighting.\n\nAs you can see, the plot itself is not exactly original but it delivers. For the most part, it is rather serious and dramatic (and even a bit corny), especially towards the end, but most characters are not. This makes for a nice blend of comedy and action with its share of sci-fi references and parodies, ranging from Gundam (of course) and Macross to 2001, Total Recall, Star Trek, Star Wars, Starship Troopers, Die Hard (not a sci-fi flick, I know), and even, believe it or not, Hideo Kojima's japan-only adventure game Policenauts. Compared to most shounen animes, the series runs only for 26 episodes, which it's a good thing because there are no filler episodes and all loose ends are tied up nicely by the rather satisfying ending.\n\nOf course, it is not perfect. Despite being animated by Sunrise, the very same studios than the Gundam series, the animation is a mixed bag, particularly in the first episodes. The mechs themselves are incredibly animated for the most part, especially considering their complex designs, but the character designs and animation leave a bit to be desired. Still, it's not too bad either, and the series thankfully doesn't rely on reused shots like, say, Gundam SEED. On the other hand, the music is memorable, and so is the voice acting in both languages, surprisingly enough. Still, as always, I recommend watching it in Japanese with subtitles.\n\nThe saddest thing about this series is that it doesn't seem to be well-known even among mecha anime fans. It is truly a shame. Heck, as someone who's never been too fond of the genre, it may be the only mecha anime I truly dug so far. The first time I watched the series, I was totally sucked in, and each episode left me with a huge smile.\n\nIn any case, I highly recommend it to fans and non-fans alike.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Home Video Trailer from ADV Films",
        "duration": "PT1M31S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi2061697305",
        "name": "Zone of Enders: Dolores",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjZiM2M3MzAtYTAzNi00YjMxLWE5MzEtNTQzYjhkMTkxZmNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjZiM2M3MzAtYTAzNi00YjMxLWE5MzEtNTQzYjhkMTkxZmNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg",
        "uploadDate": "2008-04-18T12:21:10Z",
        "url": "https://www.imdb.com/video/vi2061697305/"
    },
    "url": "/title/tt0446257/"
}