{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Stanley Baker",
            "url": "/name/nm0048939/"
        },
        {
            "@type": "Person",
            "name": "Jack Hawkins",
            "url": "/name/nm0370144/"
        },
        {
            "@type": "Person",
            "name": "Ulla Jacobsson",
            "url": "/name/nm0414965/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 40577,
        "ratingValue": 7.7,
        "worstRating": 1
    },
    "contentRating": "Not Rated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0103340/"
        },
        {
            "@type": "Person",
            "name": "John Prebble",
            "url": "/name/nm0695667/"
        },
        {
            "@type": "Person",
            "name": "Cy Endfield",
            "url": "/name/nm0256831/"
        }
    ],
    "datePublished": "1964-06-17",
    "description": "Outnumbered British soldiers do battle with Zulu warriors at Rorke's Drift.",
    "director": [
        {
            "@type": "Person",
            "name": "Cy Endfield",
            "url": "/name/nm0256831/"
        }
    ],
    "duration": "PT2H18M",
    "genre": [
        "Drama",
        "History",
        "War"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BYzdlYmQ3MWMtMDY3My00MzVmLTg0YmMtYjRlZDUzNjBlMmE0L2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg",
    "keywords": "zulu,british army,military tactics,historical event,bayonet fight",
    "name": "Zulu",
    "original_info": {
        "id": "Zulu_1964",
        "name": "Zulu",
        "year": "1964"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "Scaramouche2004"
        },
        "dateCreated": "2004-08-14",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0058777/"
        },
        "name": "An edge of your seat spectacular.",
        "reviewBody": "22nd January 1879, Rorke's Drift. Natal Province. On that day an epic battle was fought between 4000 Zulu warriors and approx. 100 British soldiers.\n\nNow I have noticed many of our American cousins have made remarks in their reviews of Zulu, to the effect that the soldiers were nasty-pasty British Empire builders and that they all deserved to choke on their own vomit, however the film does not try to justify the Zulu War or it's origins so I will not either, suffice it to say that you shouldn't be expressing assumptions and opinions on nineteenth century political attitudes with such an obvious twenty-first century viewpoint. They are two very different worlds which cannot be compared.\n\nThis film is beautifully shot and scripted, and the the John Barry musical score keeps the battle scenes moving well. It seems to makes the sometimes long periods of heavy fighting pass by quicker. Barry took authentic Zulu songs and chants and added the dramatic score around them to make an original and haunting theme which still ranks as one of his greatest film score offerings.\n\nStanley Baker is fantastic as Lt. Chard, the Royal Engineer who is able to use his skill in successfully fortifying the little hospital outpost against the onslaught of the foe.\n\nMicheal Caine plays Lt. Bromhead the professional line soldier and upper class officer who after a little whining and grumbling accepts his position of second in command and fights valiantly in the battle. It was this film that propelled Caine to international stardom, so powerful was his performance. \n\nOther noted cast members include James Booth as an excellent but inaccurate Hook, and Nigel Green as Colour-Sergeant Frank Bourne the typical Victorian Sergeant-major complete with side whiskers and moustache.\n\nThe Great Jack Hawkins who did not like the character he played or his work on the film, portrayed Otto Witt, the pacifist missionary with a drink problem and again it is another performance worthy of an award. It was upsetting however to hear in his voice, his wonderfully clipped speaking voice, the early effects of the throat cancer which had by this time plagued him for three years and which was eventually to lead to his death.\n\nAlso special mention to Richard Burton, who narrated the whole show. He truly had one of the best dramatic voices in the world and speaks his lines beautifully. \n\nIt was also good to see the Zulu's portrayed with dignity and honour rather than just mere savages with bones through their noses. They were a brave and strong opponent that day and they are deserving of tribute as much as the British.\n\nThe basis of this film is taken from historical fact, although certain characters and events have either been altered, erased or just plain fabricated for dramatic purposes. I hope that should any producers in the future be foolish enough to attempt a remake of this classic epic, they will put historical accuracy first and Hollywood sensationalism second if at all.\n\n Enough has been said by others regarding the blatant slander of Private Henry Hook, so I will not elaborate on it, save that it was a gross slur on the bravest of men. I hope should the film ever be remade his honour will be restored and his gallant deeds on that day be portrayed accurately.\n\nTo quash further popular myths none of the film is shot on the exact spot at which the battle took place, (the real Rorke's Drift was in fact about 60 miles from the location shoot.)\n\nThe regiment in question did not become the South Wales Borderers until two years after the battle and was at the time a Warwickshire Regiment. They were however based in Brecon which is where the Welsh connection was born and would explain why there was a higher amount of Welsh nationals attached to it.\n\nDespite this the regiment consisted mainly of Englishmen and only about 12 percent were in fact from Wales. With these demographics being how they are I can assure you, \"Men of Harlech\" would not have been sung at Rorke's Drift, (at least not without the culprit being bayoneted by an Englishman with ear-ache.)\n\nLt. Chard himself was an Englishman having been born in Plymouth into an established and respected Somerset family. This being the case, I find it funny that although Stanley Baker never refers to Chard as a Welshman, he none the less seems to revel in promoting Welsh pride at ever opportunity. Of the eleven V.C's won in the battle, only three of them were awarded to Welshman so why the big Welsh message Boyo?\n\nAlso the final salute made by the Zulu's did not occur. When they re-appeared on the hill they returned with the sole intention of finishing off the gallant soldiers at the outpost, but decided against it when they noticed a sizable relief column approaching Rorke's Drift from the south.\n\nFinally, a few people have made references to Colour-Sergeant Frank Bourne, wondering whether or not he really existed and if so why he was never awarded the V.C. for his conduct on the day. Yes, he really existed and yes, he did fight at Rorke's Drift. He was in fact recommended for a Victoria Cross, but told the powers that be that he would rather have a promotion instead. This he was given along with a D.C.M and an O.B.E. He was the last surviving veteran of Rorke's Drift when he died on V.E. Day 8th May 1945 aged 91 and with a rank of Lt. Col. \n\nFor more historic information about The Battle of Rorke's Drift and it's combatants, I recommend you visit www.rorkesdriftvc.com."
    },
    "trailer": {
        "@type": "VideoObject",
        "description": "Outnumbered British soldiers do battle with Zulu warriors at Rorke's Drift.",
        "duration": "PT2M36S",
        "embedUrl": "https://www.imdb.com/video/imdb/vi1889321753",
        "name": "Official Trailer",
        "thumbnail": {
            "@type": "ImageObject",
            "contentUrl": "https://m.media-amazon.com/images/M/MV5BYTk3MTRjYmEtMGRhYy00NmUxLWFhOWQtNDgwYzNmNTZmMjJkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"
        },
        "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYTk3MTRjYmEtMGRhYy00NmUxLWFhOWQtNDgwYzNmNTZmMjJkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg",
        "uploadDate": "2021-10-12T18:27:58.972Z",
        "url": "https://www.imdb.com/video/vi1889321753/"
    },
    "url": "/title/tt0058777/"
}