{
    "@context": "https://schema.org",
    "@type": "Movie",
    "actor": [
        {
            "@type": "Person",
            "name": "Sylvia Poorta",
            "url": "/name/nm0691014/"
        },
        {
            "@type": "Person",
            "name": "Anneke Blok",
            "url": "/name/nm0088845/"
        },
        {
            "@type": "Person",
            "name": "Monic Hendrickx",
            "url": "/name/nm0376826/"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "bestRating": 10,
        "ratingCount": 1663,
        "ratingValue": 6.1,
        "worstRating": 1
    },
    "alternateName": "Zus & Zo",
    "contentRating": "Unrated",
    "creator": [
        {
            "@type": "Organization",
            "url": "/company/co0054929/"
        },
        {
            "@type": "Person",
            "name": "Paula van der Oest",
            "url": "/name/nm0644309/"
        }
    ],
    "datePublished": "2002-05-08",
    "description": "Zus & Zo shows what three sisters are willing to do to stop their would-be sister-in-law from coming into possession of Paraíso, their beloved family summer home on the Portuguese coast.",
    "director": [
        {
            "@type": "Person",
            "name": "Paula van der Oest",
            "url": "/name/nm0644309/"
        }
    ],
    "duration": "PT1H46M",
    "genre": [
        "Comedy",
        "Fantasy",
        "Romance"
    ],
    "image": "https://m.media-amazon.com/images/M/MV5BMTIxMjQxMzExNl5BMl5BanBnXkFtZTcwMDAyMTcxMQ@@._V1_.jpg",
    "keywords": "title directed by female,title written by female,sex scene,hotel,portugal",
    "name": "Zus & zo",
    "original_info": {
        "id": "Zus & Zo_2002",
        "name": "Zus & Zo",
        "year": "2002"
    },
    "review": {
        "@type": "Review",
        "author": {
            "@type": "Person",
            "name": "alexvanderlinde"
        },
        "dateCreated": "2002-05-24",
        "inLanguage": "English",
        "itemReviewed": {
            "@type": "CreativeWork",
            "url": "/title/tt0245157/"
        },
        "name": "Enjoy the funny and moving portrait of a slightly derailed family",
        "reviewBody": "Even in The Netherlands, Dutch movies hardly ever get the attention and number of viewers as movies from the United States. I don't know what the box office results for 'Zus & zo' finally will be. But it is very likely that the American remake (RCV bought the rights) of this movie will be more successful than the Dutch original.\n\nThis is unjust. 'Zus & zo' is a romantic comedy, with a soap like story-line, and is very funny, yet moving - and thus nothing like a soap at all. The timing of the actors - very important for a comedy - is good, as most actors know each other from the same theater company. Every character - both male and female - gets it's share of scepsis by sharp observation of their manners, yet the director managed to prevent over-the-top acting.\n\n'Zus & zo' provides a real life mirror for everyone. Choose your own character to take 'example' from: one of the three jealous sisters in their thirties, not satisfied with their lives, but also not able to change it. Or one of the husbands, one addicted to women, or the other being a doormat suffering under his wife's hospitality for just about every one who needs help. Or the timid gay brother, marrying a woman (!) to inherit his parents summer residence in Portugal. Or the optimist (opportunist?) bride-to-be Bo, much more self-confident than the three sisters and apparently without a weak point.\n\nOr just enjoy this tragi-comic portrait of a slightly derailed family.",
        "reviewRating": {
            "@type": "Rating",
            "bestRating": 10,
            "ratingValue": 8,
            "worstRating": 1
        }
    },
    "url": "/title/tt0245157/"
}